{
    "n2a9mv": {
        "score": 633,
        "title": "Mark NSFW posts accordingly",
        "selftext": "Hey everyone, hope you're having a swell day.\n\nJust a reminder to mark any posts that are nsfw (anything related to sex, gore, etc.) accordingly.\n\nNow, you may be thinking, \"Mr.Scary mod man, how do I apply such a strange thing to my *stayawaykids* posts?\".\n\nWell, let me tell you....\n\n**FOR PC - Click \"+NSFW\".**\n\n**FOR MOBILE - Click the 3 dots in the bottom left corner, followed by the \"NSFW\" button.**\n\nIf you have any questions feel free to ask in the comment section of this posts.\n\nThanks!",
        "url": "https://www.reddit.com/r/AMA/comments/n2a9mv/mark_nsfw_posts_accordingly/",
        "comments": {
            "gz15ufw": {
                "body": "Will do mr. internet person",
                "comments": {
                    "h39b6ti": "Thank you Happy Amumu :)"
                }
            },
            "gwir3w8": {
                "body": "[deleted]",
                "comments": {
                    "gx7tbb5": "Reddit",
                    "gz9emjs": "e621.net",
                    "h00ltrl": "lMAO.COM"
                }
            },
            "gwiqk85": {
                "body": "What's your favourite type of hot sandwich?",
                "comments": {
                    "gz0kbmq": "Hot dog"
                }
            },
            "gwokm5a": {
                "body": "I came here after a minor anxiety attack reading the black on red words \"Super Scary Mod\" and feel duly disappointed!",
                "comments": {}
            },
            "gwzl9yu": {
                "body": "I just got questions about this subreddit asking if it contains any nudity,discussion of firearms, recreational drugs,etc. Why did it ask me all of those questions",
                "comments": {
                    "gwzlvwm": "Reddit randomly sends those questions to members of a subreddit so they can better classify said subreddit (to recommend it to people who have similar interests, not show it to work-safe accounts if it's adult content, add restrictions/tools if it's it's a sensitive topic, etc.)"
                }
            },
            "gycxs3q": {
                "body": "How many languages can you translate this rule into?",
                "comments": {}
            },
            "h3ap6sg": {
                "body": ">Mr.Scary mod man\n\nDamn reddit has nice ppl",
                "comments": {}
            }
        }
    },
    "ublebv": {
        "score": 140,
        "title": "I (29M) just went on my first date ever this past weekend. She (25F) was great and I got my first kiss and held hands with a woman romantically for the first time. I am feeling better about myself. AMA",
        "selftext": "",
        "url": "https://www.reddit.com/r/AMA/comments/ublebv/i_29m_just_went_on_my_first_date_ever_this_past/",
        "comments": {
            "i64nk1i": {
                "body": "Good for you. I had to wait a long time before anybody found me even remotely attractive or interesting, so I know it can be very depressing after a while.",
                "comments": {
                    "i64nu9i": "Agreed. I worked on every aspect of myself, especially losing weight and getting fit, for 3 years and was feeling discouraged. It was great to see some results though."
                }
            },
            "i64oj5h": {
                "body": "Does she know it was your first date and first kiss?",
                "comments": {
                    "i64owmj": "Yes. We spent about 5 hours talking and she knows everything. I know everything about her too. She seemed a little turned off about it initially, but I guess I was doing something right toward the middle and end."
                }
            },
            "i64npwt": {
                "body": "Hey congrats man, all i can say is don't rush it And good luck",
                "comments": {
                    "i64nvt1": "Will do, thank you."
                }
            },
            "i64ncqi": {
                "body": "I have no questions. Just, good for you.",
                "comments": {}
            }
        }
    },
    "uazqho": {
        "score": 1050,
        "title": "I am inbred. AMA.",
        "selftext": "My mother was the daughter of my father. Impossible though might sound, she was not raped. From what she's told me and what I saw myself, their relationship was loving and healthy, or as healthy as it could have been I guess. (He died last year.) \n\nGo ahead Reddit, hit me up.",
        "url": "https://www.reddit.com/r/AMA/comments/uazqho/i_am_inbred_ama/",
        "comments": {
            "i60zl7a": {
                "body": "Who did you think your father was before finding out? Do you have any siblings? Was it kept a secret from the rest of your family?",
                "comments": {
                    "i610wvr": "I thought he was just my father. I didn't know my mother was his daughter. They never really talked about how they met, and I didn't ask many questions. At one point I realized he was older than her (though he's only fifteen years older, actually) and they clarified their ages, and what ages they were when they met. But I didn't find out the full story until college. \n\nNo siblings, I was an only child. Relatively normal childhood, one of privilege. (Financially we're quite comfortable and always have been, so it's nice to not have to worry about that.) I was never mistreated, but I also didn't see much of any extended family. When I learned the truth, I noticed that was the case and I realized why. \n\nI found out later that our extended family did not know who my father was. They just figured my mother got pregnant from a one-night stand and that my father was helping support her and the baby. That was the official story to anyone who knew they were related."
                }
            },
            "i612adq": {
                "body": "Was your mother raised by her father, or in a separate household?",
                "comments": {
                    "i612rkm": "She was raised by him. In fact, given what an absent parent my grandmother was, (she really only wanted my Dad's money, apparently) my Dad was basically the only one raising her. He had some help from his parents but they basically left the kids to do the rearing on their own. \n\nSo yeah, she grew up calling him \"Dad\" and that is definitely the part of all this that has always felt the most dicey to me. It would be one thing if they met as adults and didn't know they were related at first, as I know that can happen. But no, they were a family, and they ultimately chose to do that anyway."
                }
            },
            "i611kcx": {
                "body": "Three questions that can probably be summarized in one answer: Do you have much contact with extended family? Are they aware of the relationship? Do they accept it/you?",
                "comments": {
                    "i6126h3": "You're right, the answer to all three questions is basically no. \n\nI was kept away from extended family growing up, and now I know why. There aren't too many of them left, though. My mom had no siblings, her mother lives out of the country (I've met her like, once) and though my Dad had a brother, they didn't get along very well. \n\nMy uncle does not know. My grandmother might - according to my mom, there were times where it seemed like she suspected what was going on and just didn't say anything. (It began well after she and my Dad had divorced) But if so, my grandma hasn't mentioned anything to me about it. \n\nWould they accept it? Or me? I don't know. I kind of doubt it. I feel like they probably wouldn't blame me since I have no control over where I came from, but it wouldn't be lost on them and they'd probably see me differently. They probably wouldn't accept the relationship. Then again, like I said, it's possible that my Grandma knows and chooses to close her eyes to it. I'll likely never know for sure."
                }
            },
            "i60w0ge": {
                "body": "Do you really think it's a \"healthy\" relationship if you fuck your parent, even if both agree?",
                "comments": {
                    "i60wk2k": "Eh, I guess that's a subject for debate. I will say that growing up, I had no idea. They didn't tell me until I was twenty-one, and until that point, I never had any reason to suspect anything. Though in hindsight, I did notice some clues, like how secretive they could be with other people. But from everything I saw, before and after I found out, it wasn't an abusive or toxic situation.",
                    "i612xj1": "That actually has a few levels to it, Say if he didn't know she was his daughter until Much much later and realized it-The relationship by definition would have been a healthy relationship accepted by all\n\nWhat you mean is that it isn't really publicly acceptable by dating and relationship standards of this era, Very weird at best fucking disturbing at worst. \n\nI would imagine they did in fact know of their family ties but pursued a relationship anyway which just means the father was a very sad and troubled one. A daughters love to the man whom unconditionally loves her is something to note but a loving father would guide those feelings to someone he approves of-Not resend them in an inappropriate way and would certainly explain to her that the feelings she has towards him aren't \"proper\" even if it means hurting her feelings."
                }
            },
            "i60zjt1": {
                "body": "How do you feel about your father/grandfather and what he did?",
                "comments": {
                    "i6106kj": "Ultimately, I would say that I don't hold it against him at this point. What is done, is done. \n\nThere was a long period where I didn't talk to him, like about two months. Not even because I didn't want to see him or because I was angry, but just because I was so thrown and did not even know what to say or feel. My mom had several discussions with me, lasting hours, where she explained and affirmed again and again that he didn't \"do\" anything, that it took two to tango, that their romance was mutual. \n\nI mean, she was a grown woman when it started, so that's not impossible, and she would know better than me. She's had a lifetime to reflect on it and now close to a year without my Dad. If she ever tells me that she's reconsidered what happened and that it wasn't totally consensual, that would be one thing. But until such a time comes, if it ever does, I don't think I can, in good conscience, just assume this to be the case. Not when it contradicts everything that I've been told and seen over the course of my life. \n\nI'm not a father but I can't even begin to imagine being attracted to a girl that I brought into this world and raised since her infancy. I can't imagine falling in love with her as a partner. So in that sense, I don't get him. But he never mistreated her. He wasn't controlling. While they had problems, they were standard couple problems and they were basically very happy."
                }
            },
            "i613heg": {
                "body": "Do you have any notable birth defects? The obvious glaring issue with inbreeding is the defects that come with it but they usually apply to long term exclusive inbreeding like the tales of old kings queens if i'm not mistaken. \n\nI would imagine you're as healthy as you can be due to a single tangled family tree branch  vs the stigma of being hillbilly ultra instinct levels of inbred-ness (which is probably just the stigma of hillbillies in general being stupid)",
                "comments": {
                    "i6146qx": "I had a cleft lip when I was born, that they had removed with an operation when I was about four. According to my Dad, the way the nurses looked at him made him worry that they knew (or suspected) why I had it. But they never did any DNA tests. I mean, it can happen to people who aren't inbred as well. But apart from that, nothing else was ever discovered.\n\nI've always been pretty healthy as far as I can tell. I do have asthma, but I don't know if that's related at all. Apparently my great grandfather had it too, so it could just be hereditary."
                }
            },
            "i60y0e7": {
                "body": "How does that affect your day to day life?",
                "comments": {
                    "i60yg87": "These days? It doesn't, I suppose, beyond giving me a somewhat colored perspective on incest. I wouldn't say I approve of it, exactly, but it did lead to my own existence and the one major example I know of was an entirely positive and happy one. So I guess I don't judge, because I don't really have any right to, the way I see it. \n\nThe last five years (since I found out) are when it really affected me, so basically my twenties thus-far. I went through a lot of introspection and self-reflection and questioning who my parents were as people. But for the most part, they were still the same people I'd always known, and had good relationships with. It was just hard to reconcile that with what I had learned about them, about our family, and about myself. I guess I do have some identity issues."
                }
            },
            "i616qwa": {
                "body": "How has this effected your relationships? Would you tell a boyfriend/girlfriend/SO?",
                "comments": {
                    "i6175w8": "I would never tell anyone, because they might not understand, and it's not just my secret to share. I mean, I feel as though I have every right to tell whoever I want, since this is my origin, but that wouldn't bode well for my mom, and I don't want to do that to her - even if I did want people to know which I basically don't. Maybe, in twenty years time, if I'm married and my mom has passed, then I'll open up about it. \n\nAs to how this has affected my relationships, difficult to tell. I've only had one serious relationship since finding out, one that fell through the cracks thanks to Covid. As far as I know, my outlook on relationships wasn't really affected beyond the general impact it had on my self image, and the fear of other people finding out."
                }
            },
            "i60w0uy": {
                "body": "Achievement Unlocked \"Came From Whence Ye Came\" (50)",
                "comments": {}
            },
            "i61l12f": {
                "body": "Do you guys dress up as the Targaryen’s for Halloween 🎃",
                "comments": {
                    "i61ld9p": "Took three hours for Game of Thrones to get referenced, that is also surprising."
                }
            },
            "i616z9z": {
                "body": "You've said you'd like to have children in the future. \n\nWould you tell your future partner and / or children of their (ie yours) family history and how you were conceived? \n\nWould you do genetic and fertility testing if your partner asked? \n\nWould you consider not having genetic children?",
                "comments": {
                    "i617f7s": "I don't know if I would tell my partner. I want to believe I would, but I feel like I'd never be able to bring myself to, even if my Mom was long dead. \n\nI don't see the point of doing genetic testing, since I don't think there's any risks involved in my having biological children. But better safe than sorry, I suppose. Sure, I'd do it. \n\nI'm also up for adoption, totally. I'm presuming my children will be biological because not everyone wants to adopt and I could go either way, so it will be down to my partner's comfort zone."
                }
            },
            "i619xrg": {
                "body": "Do you think you’ll gain a different perspective if you end up having a daughter of your own?",
                "comments": {
                    "i61aavw": "Perhaps. \n\nI'm not in that place. I'm still pretty young. I'm closer to the age my mother was when she began the relationship, not my father. \n\nIs it possible that, if and when I have a kid, that it will change how I feel about what happened? Maybe. But to be completely fair, I couldn't have an accurate understanding of my dad's place in life and in the relationship until my child was an adult in their twenties. \n\nBut honestly, I don't expect myself to ask the question \"Is my child a sexually attractive being\" ...pretty much ever, but not at that point either. I mostly just intend to move on with my life. It happened, and neither of them regret it, so there's not much sense in my regretting it."
                }
            },
            "i61mriu": {
                "body": "Just when I thought it was time to sleep I had to get notified about this?",
                "comments": {}
            },
            "i6139bv": {
                "body": "What did your mom tell you about your grandfather when you were growing up?",
                "comments": {
                    "i614tb0": "Basically nothing. My paternal grandparents were in my life during the earliest years, but by the time I was starting middle school, they weren't living with us anymore, they had moved away to retire. They both died while I was in high school, and they were the people that I really knew as my \"grandparents.\" \n\nMy Mom never talked about her family, and I sort of picked up from a young age that it was a subject that it was best not to push her on. I wondered a few times if they had all died tragically or something, or if they were in prison. The truth never even crossed my mind until I was told."
                }
            },
            "i613wsr": {
                "body": "Do you plan to have kid and what will you do to make sure they won't have defect?",
                "comments": {
                    "i614gft": "I do want to have children someday, once I meet the right person. \n\nThat said, I don't think I have to worry about them having defects. No more than I would in a normal situation. \n\nIt's not like either of my parents were inbred themselves. I'm the only generation of it. When I find the right person, they won't be a blood relative. So my child's genetics will effectively be reset."
                }
            },
            "i61qob3": {
                "body": "How did you react when they told you? Do you still live with them both?",
                "comments": {
                    "i61rmkc": "That was a long, long, LONG afternoon. It was dark by the time that I left. \n\nAt first, I didn't believe it. Thought they were messing with me, that it was some weird, bad joke. But in another moment, a bunch of stuff began falling into place. Mysteries from my childhood that I didn't even recognize as mysteries, were suddenly solved. \n\nI kind of had a panic attack. They tried to comfort me but I wouldn't let them. Went up to my room for a while and wouldn't answer the door. Came back down after about fifteen minutes and demanded they tell me everything. So they did. \n\nI kept asking questions. Directed them all at my mom and at one point asked if my Dad could leave. He understood and left without protest. After a long conversation, I just needed some air, and I left to go stay with a friend for a few days. Which turned into more than a month. \n\nEventually though, I did come back, and we made peace. \n\nAs of present day, I don't live with them anymore. I live in another state, slowly working on my Masters degree. I do talk to my Mom regularly, though. We have a phone call at least once a week."
                }
            },
            "i61iwev": {
                "body": "Damn OP,\n\nAre you sure your mom wasn't abused? What age did they start?",
                "comments": {
                    "i62zib1": "The fact a father had sex with his child alone is abuse. No matter what the daughter says…that type of power imbalance is insane.",
                    "i61k54n": "When she was twenty-four and he was thirty-nine. \n\nWhen I voiced this fear, she was vehement that it was not true. That they just kind of leaned on each other when they were bored, pretty much. They weren't star-crossed lovers. They were two (related) adults, who decided \"It's probably fine if we do this once or twice so long as no one ever finds out, right?\" And then never really stopped. \n\nCourse, when it started, they were also using the excuse that they \"might not even be blood related\" (turns out yep, they were) never mind that he had raised her since she was a baby. So yeah, it's weird as hell. But is it abuse? I don't know if I have the right to call it that when everything I've been told and seen suggests otherwise."
                }
            },
            "i61ae74": {
                "body": "Do you know if your mom and her family were originally from the area in which you grew up (where incest is legal), or did they move there for that reason? Basically I’m kinda in awe at the odds of them falling in love in one of the three states where it’s legal to do so, I imagine they’re extremely low",
                "comments": {
                    "i61bair": "Oh no, they did indeed grow up in one of those states. (I mean, unless they lied about that, but I don't see any reason to when they were telling me everything else.) I grew up in the same state that my parents did - though I actually don't live there anymore.\n\nIt was tricky. Because they knew it wasn't technically illegal but that didn't mean it wouldn't be stigmatized. That they wouldn't get stones thrown through their windows. Sure, it's legal, but how many people know that, even cops? They could still be called and my parents could still have been arrested. So they kept it quiet. \n\nOh, one more thing that I haven't actually mentioned until now. In the beginning, for the first few months, they were operating with a paper-thin excuse handed to them when my grandmother (Dad's ex-wife) who is far from the greatest person, told them that my mom wasn't his. That she was some other man's kid. \n\nThing is, my grandma is a compulsive liar and she WAS lying. And I think they both probably kind of figured she might be. But nonetheless, it was only a month or so before they slept together for the first time. They didn't do DNA tests or anything. They just said \"Well, turns out we're not related, so it's fine.\" And after they got it verified from my Grandma that she was lying, like two months later they decided \"It's already happened, no turning back now.\" \n\nBut really, I think they knew the whole time."
                }
            },
            "i60wksh": {
                "body": "Would you ever date your mom?",
                "comments": {
                    "i60wy7v": "No, I've never felt any desire to be romantically involved with her or any family member. In their case, I don't think it was a kink, so much as proximity plus physical attraction led to them becoming intimate, and romantic feelings evolved from there.",
                    "i6155l0": "Do you mean would he ever date his sister?"
                }
            },
            "i61knrl": {
                "body": "I wouldnt have enough respect for them to talk to them anymore.",
                "comments": {}
            },
            "i613kuv": {
                "body": "So your mother is also your sister, like that guy in gta3?",
                "comments": {
                    "i613tld": "Haven't played GTA. I was always more of an Animal Crossing, Nintendogs sort of kid."
                }
            },
            "i61lf7n": {
                "body": "Sigmund Freud has some questions, I imagine.",
                "comments": {}
            },
            "i616osh": {
                "body": "How old were you when you found this out?",
                "comments": {
                    "i616sfe": "Twenty-one years old."
                }
            },
            "i62xtlr": {
                "body": "She was most certainly raped. She just doesn’t know it",
                "comments": {}
            },
            "i61edq9": {
                "body": "How do you rationalise that he is both your dad and grandad. Genetically he is both to you. You and your mum are half siblings.\n\nDoesn't this just sort of blow your mind a bit?\n\nI can't imagine. You're so well adjusted to this, I'm so impressed.",
                "comments": {
                    "i61fzgm": "I've had five years to get used to it. I was NOT well-adjusted when I first learned the truth. \n\nAs for the double-relationships I have with them, I just try not to think about it. Not only because it's messed up, but because it's plain and simple confusing. I know them as my parents, so that's what they are, regardless of whether they are also technically my sister and grandpa. Just, way too confusing, don't need that in my life."
                }
            },
            "i61zfxy": {
                "body": "Would you accept your mum wanting to sleep with your future son?",
                "comments": {
                    "i6202yd": "By the time I have an adult son, my mom will be in her seventies at the youngest. So even if she wanted to (she wouldn't) and I accepted that (I wouldn't) the question arises: Do you think a twenty-something guy wants to sleep with his pushing-eighties grandmother? Yeah, he wouldn't. \n\nNot to mention that he could wind up being gay, asexual, or in a committed relationship by that time. \n\nIt's just not gonna happen."
                }
            },
            "i61d5x5": {
                "body": "How do you feel about the step family genre on a certain website?",
                "comments": {
                    "i61fso9": "I'm more of a \"boss and his secretary\" type, myself. \n\nIn all seriousness, I don't really care. I don't watch it, so it doesn't really matter to me if this is a kink for people. Virtually everything is."
                }
            },
            "i6217lo": {
                "body": "How would you describe the relationship between your parents when you were growing up? Before you knew about the incest. Were they affectionate to each other? Did you see the love between them? Were there fights?\nVery interesting AMA!",
                "comments": {
                    "i621v67": "It seemed pretty standard to me. They were indeed affectionate with each other, I would see them cuddling and such. At one point, I must have been about five, I walked into the hallway and saw them basically making out, and like the kid I was, I giggled and went \"Eeeeww\" which led to them pulling apart and laughing too. \n\nOh sure, there were fights. About basic stuff, mostly. Disagreements over whether I deserved grounding or just a warning when I misbehaved, bickering about that one chore that both of them would always forget. (For my dad it was dishes, he would always leave them in the sink. For my mom it was laundry, she would leave hers everywhere.) But I can't think of one time that they yelled at each other, at least not with me around. They were very calm and easygoing. \n\nI did see the love between them. I'd see them dance together in the living room, and they'd go out some nights when I had a babysitter and when I was old enough not to need one. And I know they still had sex because (again, when I was little) I remember going to the bathroom in the middle of the night once, and hearing ah, sounds, coming from their room."
                }
            },
            "i61ht7p": {
                "body": "Have you done a DNA test?\n\nHave you considered this might also be a lie? Like your mother was actually kidnapped by your father as a child and \"she's my daughter\" either grows from a smaller lie to a bigger one, OR is meant to be weird enough that you stop asking questions.",
                "comments": {
                    "i61i97e": "I haven't done a DNA test because I don't want anyone else to know, I don't want this on record. \n\nIt's not a lie. I knew my father's parents, and I knew his brother, and his ex-wife. I've seen old photos. The moment I was told the truth, part of the reason that it completely overwhelmed me was because I KNEW in that moment, I knew, that it was true. And that in hindsight, it seemed so obvious. \n\nEven without all of that, I can't think of any reason why THIS would be the go-to lie to tell me, even if my Mom had been kidnapped or something. (She wasn't, sorry, but that's kind of ridiculous.)"
                }
            },
            "i61ne30": {
                "body": "Ive seen OP saying multiple times that she was an adult when it started. That doesn’t make it any better at all lol. He raised her. That’s still absolutely fucked up",
                "comments": {
                    "i62c3tm": "For real. OP also alludes that his mother was hard to control and that the two of them “fed each other’s bad habits.” There has to be more here. She was troubled for sure and maybe drugs? For neither of them to want to meet other people, they must have been very reclusive. For a father to want to hinder his daughters life like that? Insidious.",
                    "i61npod": "Her being an adult makes it a hell of a lot better than if she had been a child or a teenager. \n\nI don't think I could have handled that if that were the case. This is still skeevy, but not as bad. My mom insists that it was consensual and since she was an adult at the time, I don't really have much leg room to argue. I wasn't there."
                }
            },
            "i60wkko": {
                "body": "Was she at least legal age when the relationship began?",
                "comments": {
                    "i60wsxg": "Yes, she was well into her twenties. Twenty-four I believe. It was another ten years before I was born."
                }
            },
            "i62fmpn": {
                "body": "Fucking your father is a healthy relationship?",
                "comments": {}
            },
            "i60w974": {
                "body": "Since your granddad is really your dad, do you send him a Father’s Day card?",
                "comments": {
                    "i60wnju": "I always sent him Father's Day cards, because he was my father. That kind of took precedence over him being my technical grandpa."
                }
            },
            "i61mwvy": {
                "body": "do you have any deformities from this? up to a 1/4 of your genes could possibly be identical",
                "comments": {}
            },
            "i61sinq": {
                "body": "How has this affected your physical health, mental health & life in general up until now? Extra question: if you have no physical health problems now, has your doctor warned you about anything that might still come up?",
                "comments": {
                    "i61u4p0": "I've only told one doctor about this so-far, and she was rather convinced that if nothing has turned up by now, that I'm likely safe. Still, better to know and keep an eye out for it. \n\nAs for everything else, it definitely affected my mental health when I found out. Took me a while to process. Physically, it hasn't had much impact I suppose, other than my cleft lip. As for my life in general, I guess I didn't see as much of my extended family as other kids probably did? Apart from that, I didn't notice a change."
                }
            },
            "i625n9q": {
                "body": "If this is real-very messed up.",
                "comments": {}
            },
            "i62ey4o": {
                "body": "One issue is the power differential.  Your mom might not have really been able to consent and eventually did because it was easier.  I highly recommend reading up on Stockholm syndrome.",
                "comments": {}
            },
            "i61exvq": {
                "body": "Your mother was groomed into believing the relationship was a good and healthy one by her father.\n\nI’m very sorry you’re going through finding this out. Counseling is always available to help you sort your thoughts constructively.\n\nHave you been medically checked? Just curious…",
                "comments": {}
            },
            "i61l26z": {
                "body": "Is it noticeable?\n\nHow did you find out?\n\nDoes it disturb you?",
                "comments": {}
            },
            "i63j082": {
                "body": "OP, you might claim to not give a fuck but you really should. Just because they are your parents doesn't mean they would never lie to you.\n\nWhat your mother went and IS going through is grooming. He RAISED her, she believed him because, come on he's her dad. The power imbalance here is terrifying.\n\nFrom your answers, your father got a baby at 15, raised her, then started having sex with her. Do not believe everything a father dating his own child is saying. \n\nPeople do not have sex with their parents when they're bored. She was most likely made to think that. \n\nYou may not be your family, but your family is fucked so either cut contact to live a life where you don't acknowledge it or keep it and HELP your mother.",
                "comments": {}
            },
            "i61gwyj": {
                "body": "So you three lived together as a \"normal\" family, not seperate?",
                "comments": {
                    "i61h9dc": "That's right. Grew up in a house, went to school, did extracurriculars. Had a good relationship with my parents the whole way. Prior to knowing the truth, the worst fight we ever had was about me breaking curfew. It was pretty typical."
                }
            },
            "i623x25": {
                "body": "Have you heard of John Phillips and Mackenzie Phillips? Got some of those vibes going on! If you haven't heard of them before, you should look into it. Maybe more drug use than your parents situation! \n\nI know you insist your father wasn't abusive or manipulative, but do you think maybe you've been manipulated or brainwashed too? This situation shouldn't be natural to us as a species, like biologically! Scientifically!! \n\nYou seem like a really together person and very intelligent! I know I may sound like a troll or something, but I hope you find some solace in this AMA",
                "comments": {}
            },
            "i626bp0": {
                "body": "There’s no way that’s a healthy relationship. If it’s incest, especially child and parent there is no way it can be healthy. However how are you and how have you coped with this fact?",
                "comments": {}
            },
            "i61ce10": {
                "body": "What was your dad wealthy from? We’re they both fat slobs or unattractive in their own right? How do you know your grandmother just went in for the money any personal anecdotes to back that up? Like if this nasty relationship the one outside opinion that held the most weight I would trash on that person any chance I could. How confident are you that you have the circumstances of grandmother correct? Is she still alive? Have you ever heard her side of the story?",
                "comments": {
                    "i61efkw": "It was inherited wealth. My father's family owned a particular brand, that brought in a lot of money. I am not going to say which one for privacy reasons, but it's possible that you've heard of it. \n\nNeither of them were ever overweight, to my knowledge. Beauty is the eye of the beholder, but neither of them ever seemed particularly good or bad looking. But maybe I just find it hard to gauge them like that. I will say that most people who met my mom when I was younger considered her to be very beautiful. \n\nI have no evidence that my grandmother was only in it for the money beyond the stories my parents told me. But I know my grandmother, and I can believe it. She's an opportunist and a compulsive liar, and just overall not a great person. I've seen the evidence with my own eyes, and heard multiple anecdotes about what she's like. \n\nShe is still alive. It's difficult to know what her side of the story is, because it tends to change every time she tells it. Which gives you some idea of what I'm talking about."
                }
            },
            "i62tngv": {
                "body": "Your dad should be in jail, sounds like grooming to me 🤷",
                "comments": {}
            },
            "i617oc8": {
                "body": "I cant get the song Sweet Home Alabama out of my head",
                "comments": {
                    "i617u2r": "Genuinely surprised it took a full hour for that state to be name-dropped in the comments."
                }
            },
            "i61cu7h": {
                "body": "Do you just feel dirty all the time? How do you get over being the product of that..",
                "comments": {
                    "i61dnma": "I have felt dirty about it in the past. But mostly, it's just time. With time passing, and everything else going on in the world, including my getting older, I've mostly dealt with my issues about this. Mostly."
                }
            },
            "i61sncs": {
                "body": "This post is so enlightening (comments included). What an interesting read! Thank you so much for sharing this. Thank you for you patience providing thorough and very comprehensive answers with such an open state of mind. This is very impressive. \n\nThis post makes me realize how deeply judgment is engrained in our approach to concepts that have been programmed into our brains as being “wrong”. \nWhen you exclude the reproduction/genetics aspects of it, and guarantee that there is consent between two adults in a capacity to form valid consent, why wouldn’t it be ok for people that are mutually attracted to each other to become partners/have sex with each other? From a purely objective standpoint, there shouldn’t be any issue. People have free will. Why not let them be?\n\nI would never be possibly attracted to my father. However why would I judge someone who would?",
                "comments": {
                    "i61uc98": "Thanks for this. \n\nI guess it just feels creepy because he raised her, like I feel that ick factor too. But as they were both consenting adults, and it led to my existence, I can't really complain? \n\nAnyway, thank you for the kind words, they did make me feel a bit better."
                }
            }
        }
    }
}