{
    "score": 163,
    "title": "I work in a sex shop. AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/unhrve/i_work_in_a_sex_shop_ama/",
    "comments": {
        "i8892dt": {
            "body": "weirdest encounter with a customer?",
            "comments": {
                "i88b5f7": "One time, a guy spent a really long time looking at every product and asking questions about what purpose served each of them only to say it was all 'satanic'. He went on weird tangents about how the human mind could create anything, even satanic and dangerous things, like guns and dildos.Another insisted to pay us for a threesome and gave us a very detailed description (with hand movements) of how he would 'masturbate a clitoris'.",
                "i88e23f": "When I was working at one we would get calls all the time from guys who would ask me to explain different products and would just continue to ask questions but was really just masturbating the whole time."
            }
        },
        "i885l6v": {
            "body": "What is the weirdest-named sex toy you sell? Weirdest-shaped one?",
            "comments": {
                "i88a0xo": "No weird name comes to mind but we have a cock ring in the shape of a big ass butterfly that you just don't want anywhere near your penis and we hardly ever sell any.We also have a chili pepper dildo made of glass that I find both funny and charming.For the longest time we had a Bad Dragon's huge tentacle dildo. We only ordered one because we knew it'd be hard to find a hole ambitious enough to welcome it."
            }
        },
        "i885025": {
            "body": "What items do you recommend for what groups of people?",
            "comments": {
                "i889ffb": "The large majority of our clientele is:- Young women looking to buy their first toy. The go-to are clitoral massagers. It's all the rage rn. Best-selling brands are Satisfyer (for small budgets) and Lelo (around 70$). Rabbits and small vibrators are always a safe bet too.- Straight couple. What they will usually like the most are small toys like cock rings and vibrating fingers.Many are also into pegging: we have strap-ons and lots of dildos to choose from.Lots of folks are also curious to try anal. Many brands will sell plugs in boxes of three. These are usually really good deals because you get 3 for what is often the price of 1 and there are different sizes and shapes so you can experiment all you want."
            }
        },
        "i886plg": {
            "body": "Why do most employees treat you like you should be uncomfortable, when you don't really have questions about products? I always feel like I'm assumed to be uncomfortable just because I'm a regular joe.",
            "comments": {
                "i88abrq": "Sorry this was your experience; we don't do that here haha. We try to make it a place without taboo where anyone feels comfortable going in and asking questions."
            }
        },
        "i88v1hy": {
            "body": "Is there any products you (silently) judge customers for buying? Have you ever openly judged someone? Do you tend to try and talk to customers or let them just come in and out in silence?",
            "comments": {
                "i8alc6p": "We are instructed to go and talk to customers the moment they step foot into the store haha. Ask if they are coming for something specific, if we can help and such. We do our best to guide those we need advices (and many come to a physical store for this very reason) and give space to the others.If we see someone trying to understand how a toy works we go up to them and engage conversation again."
            }
        },
        "i8840gq": {
            "body": "What discount do you get?",
            "comments": {
                "i887mjd": "30% off all products. When we get tons of new products from a brand we didn't have in store before, we get to test out and keep some. Some cheap stuff we have a hard time selling we sometimes get to get for free too.",
                "i8898vt": "Are those sex machines that retail for $500+ always sold out?"
            }
        },
        "i895hhb": {
            "body": "I'm surprised sex shops survive with the ease of accessing porn on mobile devices, the rise of tube sites/extinction of DVDs. Not to mention the anonymity of ordering sex toys, etc online, perhaps for cheaper.Question is how are these stores surviving?",
            "comments": {
                "i8atds7": "Exactly what another user said: many people like to see the product before buying it. In our store (and in most other stores)  we have testers for the majority of our toys. Ofc you can't use them but you can see how big they actually are, feel them, see how much they vibrate etc. They also like to have a real person to answer their questions and guide them depending on what they are looking for, what they usually like and such.Totally valid question, I was surprised too to see how many customers don't really trust online stores and prefer to go to a physical shop.",
                "i89gl3y": "Personally, if I am going to spend that kind of money, I want to physically see what I am getting. I have gotten some poor quality products ordering online. Plus the staff is usually super helpful if you have an idea and aren't sure exactly what you might want."
            }
        },
        "i884tih": {
            "body": "How many people have you caught masturbating in the store?",
            "comments": {
                "i889l8y": "Thankfully none. The place is small and very open so no one can really hide and... do stuff. Some clients will be very pushy and gross tho."
            }
        },
        "i8955kd": {
            "body": "Lol I'm a security guard stationed at a sex shop, do you have security over at your place? If so, have you had any customer/guard horror stories?I'm new at my site so I'd like to learn to not make mistakes ",
            "comments": {
                "i8am6zs": "Wish I could help but we unfortunately don't have security at ours! I've never seen sex shops with security in my country actually.But some people have asked if we do and are shocked that we don't haha. We are mostly women working there but never have I felt unsafe, thankfully."
            }
        },
        "i893wew": {
            "body": "What's the best clit stimulator?  It's about the only way I get off.",
            "comments": {
                "i8am1t4": "Anything Lelo makes is life-changing."
            }
        },
        "i88geuo": {
            "body": "Do you masturbate during breaks",
            "comments": {
                "i88gtw7": "Bold of you to assume I have breaks"
            }
        },
        "i88cpfo": {
            "body": "Which the biggest dildo someone boughts, when you look at buyer and say in you head: 'Dude, wtf?'",
            "comments": {
                "i88hju6": "We actually don't have that many huge dildos because they are harder to sell, but we do order some when customers ask. Recently, one asked for a 15 inches dildo. That was a lot.We order fisting gloves from time to time too.One time a guy asked for a big sticky dildo to put on his windshield. Wild! but we don't judge!"
            }
        },
        "i883fga": {
            "body": "So how much for a sex, i really need one. Any discount for 1st timer?",
            "comments": {
                "i887cys": "Before working there, I used to think you couldn't get anything good under 100$ but turns out there is a lot of quality toys for very cheap prices. Look up Satisfyer, they have lots of good stuff under 50$. The cheapest toy we sell is a mini-vibrator that goes up for around 10$. It works with batteries, so not as convenient as the ones with USB cables but it's quite powerful. Many brands will do those."
            }
        },
        "i88uti1": {
            "body": "What's your favorite dinosaur?",
            "comments": {
                "i8al1iz": "Apatosaurous. Watched too much Land Before Time as a kid.",
                "i89nxgc": "Askin the real questions"
            }
        },
        "i893ex0": {
            "body": "How much does working in a sex shop pay?",
            "comments": {
                "i8alzqa": "Like everywhere else, it depends on your contract. I have an internship contract so I make around 900$ a month. I get a bonus on the sales that averages to 50$ a month."
            }
        },
        "i883zf2": {
            "body": "What's your age and gender?",
            "comments": {
                "i887niy": "23F"
            }
        },
        "i892ftl": {
            "body": "Best selling toy",
            "comments": {
                "i8alnu2": "Satisfyer Curvy 2+. Both a vibrator and clit massager and it connects to an app."
            }
        },
        "i88n48g": {
            "body": "Absolutely a personal query, should you have to consciously squeeze to keep a butt plug in?!",
            "comments": {
                "i88zldv": "r/sex will have your answers."
            }
        }
    }
}