{
    "score": 218,
    "title": "I called the police on my best friend AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/uln598/i_called_the_police_on_my_best_friend_ama/",
    "comments": {
        "i7we6a1": {
            "body": "Why did you do that.",
            "comments": {
                "i7wegon": "Actually a longer story. In short, my best friend became an alcoholic and would suddenly talk very weird things. For example one day a teenage girl (14 or 15) talked to me and said mister even though i am only 27 i laughed it away and told my bet friend about it because i thought it was funny. His response was 'maybe someone should rape that stupid whore so she stops being so disrespectful' even as a joke thats very unfunny but okay i didn't do anything about it untill those jokes started stacking. He would also constantly say things like '12 year old girls are just as far as 18 year olds in development' and even weirder things. After a year or so i called the police and they found child porn on his computer."
            }
        },
        "i7xhxi5": {
            "body": "Had you two been friends for a long time?",
            "comments": {
                "i7xiq8q": "4 years only, i still would've never thought something like this could ever happen"
            }
        },
        "i7xfxxn": {
            "body": "Have you met him yet and how is your attitude towards each other?",
            "comments": {
                "i7xgbp8": "We didn't meet, he is in jail and i dont want to see him"
            }
        },
        "i7yxsio": {
            "body": "did this effect your relationships with other friends or with people in your friendgroup?",
            "comments": {
                "i80eg1b": "No, he was my only friend :/"
            }
        },
        "i7xxyz8": {
            "body": "What else did he say that was due? What was the breaking point?",
            "comments": {
                "i80ewdw": "The last thing he said before i involved the police was, how he had a family gathering and he could take his eyes off of his 11 yo grand cousin. I asked wtf he meant and he would go on 'joking' how he had problems hiding his boner and stuff like that, like wtf",
                "i80ewri": "The last thing he said before i involved the police was, how he had a family gathering and he couldn't take his eyes off of his 11 yo grand cousin. I asked wtf he meant and he would go on 'joking' how he had problems hiding his boner and stuff like that, like wtf"
            }
        },
        "i7yudfa": {
            "body": "Good for you, doing the right thing. Was it hard to make that decision?",
            "comments": {}
        },
        "i7we4gn": {
            "body": "Been there. Ask me anything.",
            "comments": {}
        }
    }
}