{
    "score": 289,
    "title": "[22y M] I'm from an extremely wealthy family in Iran, Feel free to ask me anything.",
    "selftext": "Hi, I created this account for this one time AMA, specially to protect my identity, and to focus this AMA more on the subject than me.As the title suggests, I'm from an extremely wealthy family in Iran, You could ask me about anything you wish, so you could understand how life really is in Iran and not what media portrays or to get a better grip on how it is to be wealthy in middle east or specifically Iran.There is no red lines, and no answer or question will be censored.Thank you!",
    "url": "https://www.reddit.com/r/AMA/comments/un3ahv/22y_m_im_from_an_extremely_wealthy_family_in_iran/",
    "comments": {
        "i85lyt3": {
            "body": "1. Are most people in Iran more secular than ppl in the west think?2. If so, why do they tolerate the 'religious police' and all that?  Isnt it just a hassle?3. Are Iranians materialistic people?  Seems some of them that live in the West are.4. My ex gf was half Persian, she grew up in Tehran. She told me never trust an Iranian they will lie to your face.  She told me its because the culture requires many things to be kept hidden. Do you think this is true?5. Are many people in Iran against interracial / inter-cultural marriages, ie a white guy marrying a Persian woman, would it be looked down upon?Thank you bro",
            "comments": {
                "i85msq2": "People in Iran are VERY secular, religion as we say is only the government's instrument to control people and nothing more, I bet you could find more islamophobes in Iran than anywhere else.&#x200B;We tolerate the religious police cause it's a joke, they stopped me once while i was going to our summer villa, i had weed, and alcohol in the trunk, and 2 girls in the car. you would think uh-oh i'm fucked, but nope i just paid them a little bit of money, had a laugh, gave em a bottle of vodka, one of em said cute girls bro and i left lmao.&#x200B;Persian by nature are EXTREMELY materialistic, I am also very guilty of that, we just hoard anything marked as 'premium' or 'luxury'&#x200B;Yes she was right bro, we say persian are extremley kind but very twofaced, hence why i'm keeping my identity secret here, you cant trust em with anything if you are also persian yourself.&#x200B;Oh no, actually interracial marriage is a heartwarming topic, we are always like 'aww, now we gotta teach michael how to cook kebab, dance like a persian and how to consume garlic like a motherfucker' &#x200B;XD",
                "i85m3e7": "Also -- was your family rich before the revolution or only after?My ex-gf's family was very rich before the revolution, but then their wealth was taken and basically seriously downgraded their social class.  Her father still seems a failure because of that.  Do you feel lucky that your family got to keep its wealth when other peoples was taken away?"
            }
        },
        "i85m7gk": {
            "body": "Can you confirm if you're currently in talks to buy a English premier league team?",
            "comments": {
                "i85m9hw": "Lmao wtf, nope..."
            }
        },
        "i85nh3f": {
            "body": "Well I am from Turkey, working as a lawyer. I just like decent Iranian businessman's, they are always so polite. So do you work with Turkey?",
            "comments": {
                "i85no6u": "We like turkey, its our favorite tourist destination.I dont work with turkey atleast yet, but we have a house in izmir and one in antalya,. and i listen to gazapizm haha"
            }
        },
        "i85m141": {
            "body": "What do you do for fun over there?",
            "comments": {
                "i85m4i2": "Mostly pool parties, getting hammered and road trips. skiing in dizin resort was also really fun.&#x200B;but atleast once  day i used to just go drive around and eat with my friends."
            }
        },
        "i85jo12": {
            "body": "Are there any measures you take to make sure you stay grounded and not act too spoiled?What about Iran is different from how the media portrays it?",
            "comments": {
                "i85k4ln": "Great question, the only measure i ever took which my dad taught me is, stay as lowkey as possible when spending, or enjoying. having eyes on you might feel good specially at your age, but it brings nothing but trouble. I used to laugh at that, but now i see why he said that.&#x200B;The short answer to that would be, everything, but the fun you could have in iran you cant find the same in Europe (Where i currently reside)"
            }
        },
        "i85jzlw": {
            "body": "Do you know any dirty secrets that could have major concequences for someone involved?",
            "comments": {
                "i85kmv2": "Yes, being wealthy a lot of government officials hung out with my dad. The things i've seen them do, if went public, would destroy their career, rip apart their image and families."
            }
        },
        "i85lk4w": {
            "body": "Do you spend more time on a daily basis doing what you want to do or what you are obligated to do?",
            "comments": {
                "i85m02y": "Could you open the question up? I mean if you mean in my personal life currently i do more what i HAVE to do, i party less nowadays and focus on being an entrepreneur, but back in the day life was 24/7 a party."
            }
        },
        "i85qh47": {
            "body": "This might be offensive, and I'm very sorry if it is but I gotta know.Is there (or was there) any moment/event/series of events where you just went like Oooooh this is a poor people thing ? Or were you just integrated into all social layers (meaning you knew others might not have the things you do)?",
            "comments": {}
        },
        "i85m6vw": {
            "body": "Is hashish or cannabis widely used / available in Iran?",
            "comments": {
                "i85m88z": "Yep, all my friends are stoners"
            }
        },
        "i85kkph": {
            "body": "Are you a spoilt twat",
            "comments": {
                "i85ksld": "Used to be, not anymore."
            }
        },
        "i85lrgu": {
            "body": "What's your comfort food from home that you miss?",
            "comments": {
                "i85lui1": "Definetly Kebab, the OG persian kebab not the ones immigrants brought to europe.but thank god my mom is also in the same country as me, and i still eat her food daily."
            }
        },
        "i85jsg2": {
            "body": "What kind of bussines does your family?",
            "comments": {
                "i85kj57": "My father is in construction, money transfering and oil,Mom is a therapist and also makes pottery.I have a few IT and marketing companies in europe."
            }
        },
        "i85n4qo": {
            "body": "Would you still be considered rich if you were to convert your money, lets say... USD?",
            "comments": {
                "i85nco4": "Yeah, not you know elon musk rich, but yeah.",
                "i85q65h": "His dad apparently bought him a maserati before he even had a license or knew how to drive it so yeah I'd say fairly rich lol"
            }
        },
        "i85vgm8": {
            "body": "Okay I will ruin the mood here with some political/religious questions:1. I am a Lebanese from a Shia background. The whole community around me supports a party that is, *ehm ehm*, backed by Iran. I have heard that many Iranians have some sort of resentment towards the Lebanese (Shia) because of the money being spent here instead of Iranian people. How true is this sentiment/what is the general feeling amongst Iranians towards Iran's outer politics when it comes to such topics?2. I am not sure if you keep a close eye on Iranian universities and academic systems, this is a bit of a niche question: as far as I know, there is some sort of objection by Iranian authorities regarding the material taught in humanities and social sciences classes. They say they don't want to teach these subjects based on material coming from the *west*, but rather they want create their own humanities and social sciences versions based on *Islam* (huge face palm). How true is this? Is this a topic that you ever heard about or came to your attention?",
            "comments": {}
        },
        "i85nc4f": {
            "body": "What's the most ridiculous thing you've spent money on?",
            "comments": {
                "i85nh54": "My dad bought me a brand new 2010 maserati grancabrio fendi, when i didnt know how to drive or even had a license yet lmao."
            }
        },
        "i85ji1d": {
            "body": "Can I have some money ",
            "comments": {
                "i85jthc": "Hahaha, My father always said, the rich stays rich by keeping their money to themselves and to hand it generation after generation as the family legacy, but the short answer would be,No, Sorry XD"
            }
        },
        "i85m9lu": {
            "body": "Do you agree that Iranian girls are the most beautiful women in the world or do you have other tastes??",
            "comments": {
                "i85mbmo": "I'm into blondes or korean girls, i watched a lot of Kpop growing up haha."
            }
        },
        "i85k8w5": {
            "body": "Do you have a personal harem of women ? Do you currently live in Iran or another country ?",
            "comments": {
                "i85krv1": "Jesus christ dude no, lmao I'm just like every other 22 year old. just because i come from wealth and used to live my whole life in Iran, It doesnt mean i have a harem.I live in central europe currently."
            }
        }
    }
}