{
    "score": 226,
    "title": "I (19F) am the daughter of two spiritual cult leaders, I escaped in Nov of 2020. AMA",
    "selftext": "To give a short explanation,I was raised in a cult in CA with around 40-60 members. They were spiritualists who claimed to be taoist masters. My step dad, the founder, was a psychoanalyst and was trained in hypnotism. He would use these skills along with copious amounts of LSD, ecstasy, ayahuasca, and shrooms to brain wash and sexually abuse people. I was isolated from society until age 12 and did not see a Dr until I had a heart attack at 14 due to a preexisting condition we were not aware of. My step-dad claimed to have went to medical school in India, but didn't graduate because he 'didn't like blood'. He would reset my sister and I's broken bones with no pain relief, give us stitches, and in my case rip giant cactus needles going all the way through my foot out with forceps. They also preformed multiple exorcisms and were preppers, they believed the society would collapse. They got heavily into Qanon in my teen years, from age 12 onward. I am now happy, healthy, and surviving. I don't think I will ever recover from all the trauma, but things are getting better.",
    "url": "https://www.reddit.com/r/AMA/comments/uoyb25/i_19f_am_the_daughter_of_two_spiritual_cult/",
    "comments": {
        "i8hihnt": {
            "body": "are they still in operation?",
            "comments": {
                "i8hmmzp": "From my understanding, yes. They moved from San Diego CA to Asheville NC and are building it up again there under the name All is One or ASO"
            }
        },
        "i8ib2md": {
            "body": "Did your sister also escape?",
            "comments": {
                "i8ibykr": "She did thank God, about 10 years before I did when she turned 18. She tried to get me to come visit her in another state, that way she could keep me safe and call the police/CPS, but my family would not let me go. I think they knew to a degree. They taught me that CPS would steal me, vaccinate me (they were antivaxxers and heavily instilled that they were horrifically dangerous in me). Now, we both live in the same city! My other sister who grew up outside the cult is a few states away. We are all extremely close, and though we had a massive rift growing up due to her step-mom (my mom) and her dad (my step-dad) turning me against her, we now have a healthy and happy relationship."
            }
        },
        "i8hkmny": {
            "body": "No questions. Just glad you're ok.",
            "comments": {}
        },
        "i8itfrb": {
            "body": "What's the weirdest thing you saw the cult do?We're you also drugged by them?How does the cult draw in followers?  What's the motivator?",
            "comments": {
                "i8ivxlm": "Have massive orgies in a garage on a giant bed while tripping on ecstacy, ketamine, and shrooms. Yes. I was also given fake medicines, and was poisoned by my mother with iodine because she believed it cured all diseases, resulting in said heart attack and chronic damage to my thyroid. They advertise themselves as spiritual teachers, gurus basically. They know 'the way' and can teach you, essentially."
            }
        },
        "i8hooi5": {
            "body": "No questions, I just hope you the best, and I'm glad ti see that after everything you've been going tbrough you can still enjoy life. Have a great day !",
            "comments": {}
        },
        "i8hq2ht": {
            "body": "I'm so so sorry, you're incredibly strong.. I hope you live a long, happy life!",
            "comments": {}
        },
        "i8i27rc": {
            "body": "Hey, I just checked your account, I wonder you being into BDSM and humiliation has something to do with the trauma you faced growing up?",
            "comments": {
                "i8i40gv": "Oh absolutely! It's a huge part of my interest in BDSM. As an adult, BDSM has been extremely healing. It has taught me how to trust people again, and helped me gain control of myself and in my life as well. As a cam and boudoir/fetish model, I now use my platform to educate people about BDSM, sex, and trauma recovery. It's something I'm extremely passionate about. 'Every year I live I am more convinced that the waste of life lies in the love we have not given, the powers we have not used, the selfish prudence which will risk nothing, and which, shirking pain, misses happiness as well...'After everything I've been through, I live by this quote. It's how I have coped and found happiness and healing as an adult, and my greatest aspiration in life is now to help others do the same, and explore aspects of their true selves and interests which societal taboos have taught us to repress. It's something I love about being a dominatrix, being able to show people (most of the time powerful men) what it's like to be vulnerable, and give absolute trust to another person."
            }
        }
    }
}