{
    "score": 271,
    "title": "I work as n IT for a Live Cam P*rn Company. Ask me anything!",
    "selftext": "I've been working as an on call IT for various Companies that deal with ' sensitive materials ' for over 7 years. I can't disclose which companies I'm working for because obviously it's private.",
    "url": "https://www.reddit.com/r/AMA/comments/w6mbka/i_work_as_n_it_for_a_live_cam_prn_company_ask_me/",
    "comments": {
        "ihesb87": {
            "body": "Do you have any correspondence with the performers? What genres of performer do you work with? Have you ever had any weird or memorable interactions with the audience members?",
            "comments": {
                "ihet4uh": "Yes. I'm friends with most of the performers or 'streamers' which is their technical positions. I work with 'appropriate' streamers meaning nothing with illegal activities like minors, aggresive porn, and/or anything that may include drugs. We never actually have any interactions with the 'viewers' but we recently experienced a stalker who found out where one of our streamer lives. Police got involved and sadly the streamer retired for her own safety. The guy was I think from the UK just from his accent."
            }
        },
        "iheqee6": {
            "body": "How did you end up working on 'sensitive material'? Was this something you wanted?",
            "comments": {
                "iheqoj3": "I started working as n IT for a Call Center Company. This compny I'm working for now just pays better. It's actually not that bad. Almost everyone is really proffesional."
            }
        },
        "ihf5w5u": {
            "body": "A friend of mine went to McGill University in Montreal, where PornHub's headquarter is located, and studying CS at that. I've always teased him to send in his resume to PH for an IT position cuz they definitely need some tech guy to run the business, which he never did. Looks like you are living that role, what's it like? Do you feel it to be any different from the same positions in regular companies?",
            "comments": {
                "ihf6he6": "I get why he didn't send an application. It's a bit weird when people ask you what do you do for a living and say 'IT' then they ask where and you'll have to explain that you're not some kind of pervert. That's why I rarely talk about my job with anyone in public. They really judge you instantly. TBH the higher ups are more professional and understanding with lower brackets of the company. Maybe because the employees are the actual 'product'. But as an IT, there's little to know difference. Except for the usual dicks nd tits here and there."
            }
        },
        "iheuv7x": {
            "body": "Can you describe your infrastructure?",
            "comments": {
                "ihev8lx": "Can you clarify?"
            }
        },
        "iheon0p": {
            "body": "Does server uptime mean something different in your part of the industry?",
            "comments": {
                "iheqc05": "can you clarify your question please? I forgot to mention I'm from Asia"
            }
        },
        "iheptyo": {
            "body": "How often do you go on camera?",
            "comments": {
                "ihepxhb": "I'm the computer guy, not the streamer."
            }
        },
        "ihf8h9e": {
            "body": "You said that you don't feel anything when watching them. Do you think your job could hurt your relationships?",
            "comments": {}
        },
        "ihf3pkh": {
            "body": "How can I get into porn IT? I just got my Comp TIA and ITIL certs and am working on more. What steps can I take to get my foot into this area of the industry?",
            "comments": {
                "ihf3wz0": "I don't know what to tell you man. They were just looking for an IT, I just applied and got hired."
            }
        },
        "ihf214s": {
            "body": "Do the streamers try to get close to you knowing you may have an advantage to get them more views or people throwing money at them?",
            "comments": {
                "ihf2fw7": "They do but nothing like what you said. Another deparment is in charge on who gets featured and who to expose more. Everybody gets an equal treatment with the exception of 'stars' and the 'real money makers'. Some streamers get flirty just because they think they can get better equipment. While others are just friendly in general."
            }
        },
        "ihflulw": {
            "body": "What percentage of the talent is trafficked?",
            "comments": {}
        },
        "ihfa172": {
            "body": "If you ever decide to switch jobs, do you think the details of your current position could potentially affect your resume in a negative way?",
            "comments": {}
        }
    }
}