{
    "score": 293,
    "title": "I know everything and I have answers for everything you want to know AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/w65lmu/i_know_everything_and_i_have_answers_for/",
    "comments": {
        "ihc61sc": {
            "body": "Will she text me back",
            "comments": {
                "ihc6j0f": "MaybeBut if you text her that you've been to her house and you're watching her at night, she'll probably reply that she's going to call the police (that's also something)"
            }
        },
        "ihct7qi": {
            "body": "This thread is basically an 8 ball on steroids. Is that right? *shake your head to get an awnser*",
            "comments": {
                "ihcv9oq": "Yes"
            }
        },
        "ihcms1a": {
            "body": "What is the answer to life, the universe, and everything?",
            "comments": {
                "ihcp7n9": "That's easy 42"
            }
        },
        "ihbvjhw": {
            "body": "What is the airspeed velocity of an unladen swallow?",
            "comments": {
                "ihbw71g": "11 meters per second"
            }
        },
        "ihcin2s": {
            "body": "Who stole my lawn gnome?",
            "comments": {
                "ihcni97": "His family, you kidnapped him"
            }
        },
        "ihcpibq": {
            "body": "Why are the only people that want me mentally unstable?",
            "comments": {
                "ihcq3uw": "You probably naturally want to help them be their best and they probably see that so they want you. But, you can't fix people who can't change."
            }
        },
        "ihby8n3": {
            "body": "Should I pick wedding dress #1 or wedding dress #2?",
            "comments": {
                "ihbywjh": "Which one you like more on first sight"
            }
        },
        "ihce3e8": {
            "body": "Whats the meaning of life and when will I be happy?",
            "comments": {
                "ihcnthf": "The meaning of life is to be happy and live to the fullest, enjoy every second, because you got the greatest gift. You'll be happy when you figure it out"
            }
        },
        "ihck28v": {
            "body": "so do you know Victorias secret?",
            "comments": {
                "ihcmxpi": "Beautiful girls on commercials are not only attractive to men but also to women."
            }
        },
        "ihcpgiz": {
            "body": "Where did I put those god damned keys?",
            "comments": {
                "ihcptgz": "Where you last left them"
            }
        },
        "ihcfpxi": {
            "body": "If oxygen en hydrogen are both lighter then air? How come water ways so much?",
            "comments": {
                "ihco4to": "Water is heavier the O2 and H2 gases because the H20 molecule's particular electron configuration cause it to be a liquid between 0 C and 100 C at 1 atmosphere of pressure.Liquid water is much denser"
            }
        },
        "ihcyr2n": {
            "body": "Where is the best place to find a girl to date? (In real life, not tinder)",
            "comments": {
                "ihd0poc": "Universities (with student housing), libraries, cafes, gym, etc"
            }
        },
        "ihd4i4p": {
            "body": "Does a set of all sets contain itself?",
            "comments": {
                "ihd4ln4": "In theory yes"
            }
        },
        "ihc475n": {
            "body": "Who was phone?",
            "comments": {
                "ihc5shw": "The phone was a device possessed by ghost"
            }
        },
        "ihbtuyg": {
            "body": "Why are there two different answers for the speed that the universe is expanding?[please solve the crisis in cosmology](https://www.space.com/why-is-there-a-cosmology-crisis)",
            "comments": {
                "ihbuo4k": "It could be that dark energy, which we don't understand , that our physics is wrong, or that we are misunderstanding something about Cepheid variable stars, that there is something we get wrong about the Hubble constant at local scales etc."
            }
        },
        "ihcx1lx": {
            "body": "Why do some men intentionally stay with women who are only with them for their money, especially when the woman isn't even attractive?",
            "comments": {
                "ihd1pfd": "Because they are used to that person.It's like when you don't use an object anymore but you don't want to throw it away because you've created a relationship with it that isn't love."
            }
        },
        "ihclruw": {
            "body": "Will she agree if I ask her out?",
            "comments": {
                "ihcmfey": "If you charm her and ask her politely yes",
                "ihcmh7v": "If you charm her and ask her politely yes"
            }
        },
        "ihcc2bd": {
            "body": "What date and time will I die?",
            "comments": {
                "ihcocus": "When you heart stop working"
            }
        },
        "ihdaqc7": {
            "body": "Why whenever I find a solution to my problems (anxiety, specific health issue, social situation), within next few months it either stops working, or I am forced to abandon it?",
            "comments": {}
        },
        "ihc9nwj": {
            "body": "How to physics? :\\\\\\",
            "comments": {
                "ihcot45": "If you mean learning then First you have to learn the rules and formulas, then you have to be sure when you use them and then practice as much as possible"
            }
        },
        "ihcspkh": {
            "body": "You doing good?",
            "comments": {
                "ihcw92w": "Absolutely"
            }
        },
        "ihcyzgf": {
            "body": "I got prescribed Plaxovid, but never picked it up because there is no data saying it actually would help.  Did I make the wrong decision?",
            "comments": {
                "ihczi4d": "No you didn't"
            }
        },
        "ihcjh37": {
            "body": "Tell me the lottery numbers of my country",
            "comments": {
                "ihcnb0a": "How much numbers do you need to win",
                "ihd0vyx": "4 8 15 16 23 42"
            }
        },
        "ihclqkx": {
            "body": "What's the best form of govt",
            "comments": {
                "ihcmrge": "If you mean the government, then it is the one that helps people, doesn't steal from them and doesn't lie."
            }
        },
        "ihcy7h6": {
            "body": "will she come back to me? were friends again but shes unsure for now. shes having a rough time, but im here for her now",
            "comments": {
                "ihd1ad9": "try to get close to her again, after that ask her for relationship. If she doesn't want to, don't be sad, there are other girls"
            }
        },
        "ihcysjy": {
            "body": "Where are the Snowdens of yesteryear?",
            "comments": {
                "ihczv5x": "Snowden's of yesteryear are no longer around because they were killed."
            }
        },
        "ihd3cgh": {
            "body": "Is there a inter-dimensional time rift near Jupiter?",
            "comments": {}
        },
        "ihd8rzj": {
            "body": "What was the name of the stud of Arabian horses run by the Iraqi Khalastchi/Haroon family, and where can I find more info and possible living or recently deceased descendants (of those horses)?",
            "comments": {}
        },
        "ihdfp8q": {
            "body": "Did Adam & Eve  have belly buttons?",
            "comments": {}
        },
        "ihdr3ji": {
            "body": "Will I ever be able to ignore my anxiety and make a music career?",
            "comments": {}
        },
        "ihcd5ni": {
            "body": "Are things ever going to change?",
            "comments": {
                "ihco9l9": "They are changing now, everydayEverything passes and changes, both good and bad"
            }
        },
        "ihcxh5h": {
            "body": "Well who doesn't these days now with the internet. Anyone can dm me for help in any topic, and I'll just research it on Google for a bit and give them an answer.Learning how to Google stuff is the best skill one can have nowadays.",
            "comments": {
                "ihd1eta": "Exactly"
            }
        },
        "ihcjq3p": {
            "body": "What is the true origin of our universe?",
            "comments": {
                "ihcn5m3": "Big Bang or as scientists call it Gang bang among themselves"
            }
        },
        "ihd3h5h": {
            "body": "Amugus?",
            "comments": {
                "ihd44l3": "It's me"
            }
        },
        "ihdbuz4": {
            "body": "How come every poopoo time is pee pee time, but not every pee pee time is poo poo time.",
            "comments": {}
        }
    }
}