{
    "score": 74,
    "title": "I'm a McDonald's worker. AMA.",
    "selftext": "BEFORE YOU ASK, our ice cream machine is rarely broken. Sometimes it actually breaks and leaks out water with chunks of ice cream. But no it's not broken. Any other questions?",
    "url": "https://www.reddit.com/r/AMA/comments/w3r4go/im_a_mcdonalds_worker_ama/",
    "comments": {
        "igxxov1": {
            "body": "How old are you?Are you happy with this job? If not what would you like to do?",
            "comments": {
                "igxxvmr": "I'm 16Decently happy with it as a job, not as a career obviously. No other places wanted to hire me (so much for a job shortage) and I like my coworkers here. It's stressful and painful but it's okay overall."
            }
        },
        "igyqleg": {
            "body": "We used to tell assholes it was broken because they were assholes",
            "comments": {
                "igyrp9k": "Slay"
            }
        },
        "igxzgi0": {
            "body": "What is the worst customer you have had?",
            "comments": {
                "igxzner": "Oh yes. Someone once had a complicated order, which involved making something fresh, so it took about ten minutes to come up. Then once I handed it to him, he opened it up, and HOW DARE THERE BE PICKLES ON IT. Not like you can just pick them off. He threw the sandwich on the counter and threatened to throw the next one at our kitchen staff if it wasn't perfect.Turns out I made a mistake and I accidentally said add instead of only on the register. I was also repeating the order to kitchen as only so I see where the confusion was. But seriously, just take the pickles off. There were like two. We had to make him a whole new one.Next time he came in I had to tell my manager I wouldn't service him because of what happened.",
                "igxzt80": "There's also this one regular lady that aggressively orders her food, then when she gets to second window she checks her food vigorously. If you try to hand out her food and then her drink, she will make you sit there with the drink out the window while she checks her food first. Like lady do it in the parking lot"
            }
        },
        "igy5urn": {
            "body": "Does the frying machine alarm give you PTSD?",
            "comments": {
                "igy5x8i": "In my first few weeks of working I would hear it in my sleep and have nightmares",
                "igzehdc": "Bro I still hear the grill is done alarm as the top raises up in my dreams sometimes. It's been like 12 years."
            }
        },
        "igzhpai": {
            "body": "do you give people extra mcnuggies in their box if they're being a good boy",
            "comments": {}
        },
        "igxrfxv": {
            "body": "Can I have a KFC bargain bucket?",
            "comments": {
                "igxrihb": "Nah man this is a Wendy's"
            }
        },
        "ih04hjk": {
            "body": "Hey could I get uhhhhhhhhhh 20 piece chicken nugget meal with uuuhhhhhhhh",
            "comments": {}
        }
    }
}