{
    "score": 160,
    "title": "I got falsely charged with manslaughter over a meme AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/up7n21/i_got_falsely_charged_with_manslaughter_over_a/",
    "comments": {
        "i8j6gb6": {
            "body": "How?",
            "comments": {
                "i8j6lip": "Posted a made up fake story meme for karma and a guy called the police and reported the meme and that led to a very long investigation against me"
            }
        },
        "i8j67og": {
            "body": "show us the meme",
            "comments": {
                "i8j6edj": "I don't have it anymore, but was basically a confession bear meme with a fake story for karma"
            }
        },
        "i8ja57b": {
            "body": "This seems very unrealistic. How could any police department or government official think that a meme could count as a murder confession, especially one warranting criminal charges, without any evidence beyond that? I'm sorry if this is the truth and this did happen, but this just isn't believable to me.",
            "comments": {
                "i8k38di": "I get it, it seems like i pulled it out of my ass but it actually did happen. I didn't even know you could report some random on the internet to the police and something happens, let alone from a different country. When i was questened at the police station he showed me printed out the meme and comments. Asked a bunch of questions, even recorded them. Eventually he showed me pictures from my Instagram which at this point wasn't even active anymore . When i asked him he confirms that they have been investing months for this shit. Basically tldr from what he could tell me was :  I post fake meme on internetSomeone sees meme thinks is real and that somebody got hurt Dude calls his local police and tells them about the meme and my user name say i hurt someone potentially (which is in a different country, police refused to tell me which one when i asked further)Police looks up my name and meme and apparently thinks it's worth investigating Calls other country police (mine) and tells them and they take over Months go by police puts pieces together like some creepy beautiful mind freak and it eventually led them meI did happen and i have prooof here in paper form, ob don't have to believe me. I probably wouldn't as well if i was you ngl. But yea stupid shit"
            }
        },
        "i8k60f1": {
            "body": "The tide pod & cinnamon challenge era of the internet was the downfall of humanity. There was a fire challenge too, but I can't remember what it was.",
            "comments": {}
        },
        "i8kk9sv": {
            "body": "Please provide the top and bottom text of the meme, to the best of your recollection.And since I need a question: Would you ever post a meme like that again?",
            "comments": {
                "i8kldk5": "I really don't know the wording any more, has been a couple years. Something like 'Told a guy about the tide pod challenge and now he is in hospital' someone like that but again it's been couple year's, meme doesn't exist anymore. To answer ur question, probably not. People are stupid, especially on the internet. Some people have that 'it's on the internet so it must be true' mentality."
            }
        },
        "i8j7976": {
            "body": "Did you learn anything from the experience?",
            "comments": {}
        },
        "i8kfecp": {
            "body": "Op be like:1: I lied about causing the death of a human to people on the internet for fake internet points lol. 2: wtf why is the police here??",
            "comments": {
                "i8kfsns": "Nowhere did it state i caused a death. My meme  didn't involve death either in any shape or form. Please learn to read before you comment. The only time death got involved is when the person reporting me made that up to the police, which turned obviously out as false later on."
            }
        }
    }
}