{
    "score": 463,
    "title": "Am Apparently Unhygienic, wanna see if Im not aware of any basic routines. AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/umemp5/am_apparently_unhygienic_wanna_see_if_im_not/",
    "comments": {
        "i8170lr": {
            "body": "Do you wash your hands with soap after visiting the bathroom, and before eating or handling food?",
            "comments": {
                "i81761f": "Yes"
            }
        },
        "i82h9u7": {
            "body": "I just want to say that it's okay that you didn't know these things. It doesn't make you gross. Now that you know better, you'll do better. If sensory issues are keeping you out of the shower, consider following 'nestingyourlife' on TikTok, where she gives tips on making bathing a less painful experience.Showering:Some people take showers daily (or more) and wash every inch of themselves with soap. They think it's gross if you don't scrub your shins. Other people's skins would be very angry with them if they did this, and overwashing can make acne worse. So start with a daily shower where you use a gentle soap on your face, neck, chest, pits, back, in between your toes, and  your 'bits' . MEN: *You have to wash your butthole every day, with soap and water. No, letting water and shampoo run down your crack isn't enough. Trust me*. And I say men because it's been rare that I've heard of a woman not doing this, but it's apparently a thing with many guys. Gradually work your way up to washing everything, and see how your skin handles it. If you start to break out worse or your skin gets irritated, back off, try another cleanser or go back to just rinsing.Ideally, you have a clean washcloth every day that you use to start with your face and move down, then throw in the dirty laundry, but even soap on your hand is better than nothing. Keep a nail brush in the shower and use it. Any skin that feels tight after your shower, use moisturizer on while your skin is still damp. Always shower after working out - even if it's just a quick rinse until you can take a longer one. Only reuse towels that you can hang up and get completely dry in-between uses, and don't reuse them more than two or three times before washing them. Even though you're 'clean' when you use them, you're exfoliating skin flakes on to them when you dry off, and those feed bacteria.Hair washing is very variable but if you have short and straight or wavy hair you can probably shampoo daily without worrying about it. If you have issues like dandruff or very dry hair, have curly hair, or use product every day, talk to your barber/stylist about the best way to care for it. Don't be shy - every stylist I've ever met loves to talk about this stuff.The general rule is that the clothes that sit directly on your pits, crotch, and feet get changed daily - so t-shirts, underwear, and socks. Buy enough to last between laundry days, plus a few extra. Wash them weekly in as hot a temperature as they can tolerate, and expect to buy new ones every year because hot water is hard on clothes.Clothes that are a secondary layer can sometimes be reused. You generally want them to be natural fibers and you have to hang them up to air out in between wearings, ideally for at least a day. If they're in a pile on the closet floor, that doesn't count.  Synthetics tend to hold odors so they don't normally work as well being reused. Even if they don't smell bad when you sniff them the next day, once they're warm from body heat, they'll start to stink. Rinse workout clothes out after wearing if you have to reuse them. The bacteria that cause odors basically live off your sweat, so you want to get rid of that sweat.Ask a dermatologist about how best to treat your body acne if it doesn't improve just from getting a bit cleaner. Visit places like r/SkincareAddiction for product suggestions. Keep your nails clean and trimmed and rub moisturizing cream into your cuticles at least once a day after you wash your hands, and your partners will thank you.It was really rude of that girl to call you out in public like that. Even if your hygiene could use improvement, you don't deserve to be treated that way.  ETA: Another missing component of hygiene for a lot of people is sheets! Change your sheets every week if you can, or at the very least change your pillowcase. Get a few sets if you have to save on laundry money/time, but don't go more than a month at most on the same sheets. You sweat a ton in your sleep, and you'll undo all your other hygienic good work by getting into a dirty bed every day.",
            "comments": {
                "i85hjn4": "Thank you so much!! Im gonna save this n put it on a post-it note."
            }
        },
        "i81kn9p": {
            "body": "You can clean under your nails with a toothpick. Nails get dirty, but it's a big turn off for women. We do not want dirty or sharp nails inside us, so it's just gross. Deodorant is important, do some research on brands regarding chemicals and apply it after you dry your armpits after a shower, with additional applications if you know you might get sweaty (anxiety, exercise, ambient temperature) Hair doesn't need to be washed every day, and there are dry shampoos that you can use if it's greasy.",
            "comments": {
                "i81u9n5": "Or, better and less gross and also less painful, a nail brush (little brush you do all your nails on one hand at once with)",
                "i82k3pv": "Personally, regular trimming takes care of most of nail problems."
            }
        },
        "i82a2jj": {
            "body": "If you're male and your foreskin wasn't cut off, slide it back and wash under it when you bath or shower.",
            "comments": {}
        },
        "i8269eq": {
            "body": "How often do you wash the knife you keep next to the toilet?",
            "comments": {
                "i8295ta": "I got that reference. Poop knife gang represent",
                "i8364og": "i burst out laughing at my desk. thanks for that solid joke. (solid... no pun intended.)",
                "i83u9x1": "You guys wash the poop knife?!"
            }
        },
        "i81490k": {
            "body": "Brush teeth at least twice a day, shower at least once a day, change underwear at least once a day and change clothes once every 1-2 days.",
            "comments": {
                "i81785m": "Brush twice - Yep Shower - Once every 2-3 days Underwear - Once every 2 daysClothes - Shirts : 2 days Shorts: Everyday"
            }
        },
        "i82c379": {
            "body": "Bit of a recap:Underwear: DailyShirts: Daily Jeans: 1-3 wears unless you're heavily active in them then 1 day. Teeth: twice a dayDeodorant: DailySkin care: DailyShower: 5-6 times a week you cant really smell yourself so best to showerNails: Once a weekSocks: DailyAlso talk about how you dont know when you smell to a friend, theyre probably worried about the same thing and you two can help each other out by telling the other when you be stanky. Happens to all of us bro. [Formatting is shit on mobile](https://imgur.com/a/Xt97q4N)",
            "comments": {}
        },
        "i81b6iy": {
            "body": "Shower every day. Using soap, and a wash cloth, you need to clean every area thoroughly. Deodorant every single day.  Clean underwear everyday, if not twice a day. I personally like fresh underwear in the morning, and before bed at night. Clean clothes including socks every day. Fresh bed sheets every week, fortnight at the most. Wash your hair also. Find a shampoo that works for you. I wash my hair every about 4th day (woman with thick wavy, bleached blonde hair that gets too dry if I over wash it)  earlier if needed, but I shower every single day.",
            "comments": {}
        },
        "i81c0ca": {
            "body": "Shower everyday. Use deodorant everyday you go out. Change your damn underwear everyday.",
            "comments": {
                "i83ief2": "You don't need to shower every day. Healthline says you can get dry flaky skin, itchiness, or dry brittle hair if you shower too much.I imagine since a lot of people are saying to shower every day, I'm guessing those people are either ignoring those symptoms or just exempt from them."
            }
        },
        "i8149bw": {
            "body": "How often do you shower? What do you wash your hair with? What do you wash your body with? Do you use a loofah? Do you wash your asshole? Do you wash your penis properly? Do you wash your feet? Do you wash behind your ears? Do you wash your belly button? Do you use deodorant? Do you floss? How often do you brush your teeth? What kind of toothpaste do you use? Do you moisturize after you shower? Do you use perfume? Do you change your underwear twice daily? Do you wash your clothes following their instructions? After how many washes do you wash your shirts? After how many washes do you wash your pants?These are the most basic hygiene steps.",
            "comments": {
                "i817pym": "Once every 2 days, I recently stopped using shampoo cause I Noticed my hair falling and noticed some bald spots from my whorl. I wash my body with Dettol. No I don't use a loofah (gonna google that). yes I Wash my ass. Recently discovered about pulling back foreskin, thankfully the stuff inside was cleaned off easily. Yes I wash my feet and legs.&#x200B;I try to wash my belly button but it hurts I try going in deep. No i don't use deodorant. (No smelly complaints either so I'm good ig)Yes I floss. I do moisturize. No I change my underwear once every 2 days.....(I didn't know i needed 2 everyday)What do u mean wash clothes following THEIR instructions? (for this the answer would be no)I just my clothes in the laundry and that's it."
            }
        },
        "i81yr4u": {
            "body": "I'm gonna say it since I haven't seen it here yet: after you're all clean and stuffMOISTURIZER. Growing up it was always weird putting on lotion. Men have skin. Skin needs moisture. Find a nice one (I love the Gold Bond men's stuff) and treat yo'self. Your skin will thank you.",
            "comments": {}
        },
        "i82yo15": {
            "body": "When you scratch your balls do you immediately smell your fingers or let it marinate for a couple second first?",
            "comments": {
                "i82yy5f": "Yo wtf",
                "i8500g9": "This is so fucking gross"
            }
        },
        "i82x4sf": {
            "body": "Sorry, OP. I'm reading some of your comments and you've got some work to do. If a single person has said to your face that you are unhygienic, that means countless people have said it behind your back.Shower with soap & shampoo everyday. Use deodorant every day. Brush your teeth every day. Wear fresh clean clothes every time you are going to be around people. That's the absolute minimum.",
            "comments": {}
        },
        "i82v7wa": {
            "body": "My boyfriend doesn't wash his legs or his feet. He thinks the soap running over it is enough. It bugs the hell out of me. Also, if you need help with the acne, I'm sure you could find some help on r/skincareaddiction . Acne does not always mean you're unhygienic. None of that is a question, so here's some. How's your day going so far? Who do you lean on when you need help? What are you most grateful for? What's your favorite food?",
            "comments": {
                "i82ypeb": "Thanks for the recommendation.It's been a slow day so far. Reading all these comments has made me realize that I've got a lot to learn in terms of life skills, I'm falling behind others but that's ok I'll catch up.  I'm an introvert with parents who would not qualify (imo they shouldn't) if there were any means to evaluate if they should have kids. So I have a small circle of the boys, they're my brothers and I'd share anything with them (obv not infront of their girlfriends haha). And my 2 older cousin brothers as well. I am grateful to be privileged enough to have a roof over my head, to access the universe through the internet. And today particularly I'm grateful to evey single commentor on this post. It's been so helpful and such an eye opener honestly. I appreciate the help.Food? Brisket all day long baby.Hope you're having a good day as well! As for ur knuckle-dragger boyfriend, GODSPEED!"
            }
        },
        "i81bug2": {
            "body": "How old are you? Caue the older you get the more care you'll need to put in.Are you hairy? Cause hairy people shed hair eveywhere and any smells around them sticks to thei body hair. Basically if you're wet or sweaty any smells around you like cooking or smoke will stick to you, and you'll need to shower.How active are you? The more active you are the more you're gonna sweat. But also the more active and athletic you are the less you're gonna stink from a little sweat, dunno why but found it to be that way.How do you wash your body? Soap is only half what cleans you, using a loofah or something similar to scrub, especially scrubbing your armpits, dick, inner part between your thighs ass crack and feet. Of course take it easy on your balls and asshole, if you aggressively scrub your asshole and it blister or something you could develop worse issue. Balls are self explanatory.Use a facewash or soap for your face and eyes, if you're  using a soap bar dedicate one only for face. And don't over do it, overdoing it would make your face oily. So once a day with soap is pretty much it, though do wash it with water every few hours or half a day. Especially  after being in the sun for long.Gunk under your nails isn't acceptable at least when your over 20 maybe not for a teenager, you have to wash under your nails or you'll be carrying germs under them that you could ingest while eating. Easiest way is to scrup your fingers onto the palm of your hand when washing your hands. Pimples on your chest are a sing for less than acceptable hygiene. You need to shower daily, and wash your body with soap and a loofah every two days at least, and daily if you you're active and do sweat a lot.Of corse everything has to be in moderation and highly dependent on your level of activity, diet and body type. If you wash too much you remove your body oils completely which is bad, but if you don't wash enough you let germs and bacteria go wild and it could develop skin problems, or other diseases, you can kinda feel it, your skin will tell you. Same of course goes with shampoo and hair, keep in mid shampooing doesn't cause hair loss, hair loss is mostly genetics and bad blood circulation in the scalp",
            "comments": {}
        }
    }
}