{
    "score": 270,
    "title": "the girl I had feelings for just left me for another girl, AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/w3nuos/the_girl_i_had_feelings_for_just_left_me_for/",
    "comments": {
        "igxgbv6": {
            "body": "Ross is that you?",
            "comments": {
                "igxgm0s": "Not ross but he sounds like a relatable guy",
                "igxi7y4": "Maybe they're just on a break"
            }
        },
        "igy2ab4": {
            "body": "Plenty more fish to fry in that river. Or something like that.",
            "comments": {
                "igy2d4p": "I like salmon"
            }
        },
        "igy0ds3": {
            "body": "Not trying to minimize - I remember what broken hearts feel like but here's something I've learned through life - everything is ok if you chalk it up to experience. Did you get dumped? Yes. It happens to EVERYONE at least once. But think about all the kissing/touching/humping skills you've gained! Go find a new someone to practice some more. Eventually the practice stops being a game and becomes feelings, you'll know the difference. In the meantime be young and have fun (also be safe and ask for permission, obvs).",
            "comments": {
                "igy11m9": "Yea no, I'm totally aware that I'll feel better (also I love your formulation) and that it's all just temporary, but it still isn't a nice feeling yk? But I totally get what you mean"
            }
        },
        "igxui7k": {
            "body": "If you had feelings why is it deep? It's not like you were in a relationship",
            "comments": {
                "igxv46r": "Well, it's a weird story. Everytime we met we got intimate with eachother or were making out, so on and so forth. So we got really close to each other and we had a few 'dates' if you wanna call them that."
            }
        },
        "igxyq79": {
            "body": "Are you ok? What are your thoughs on this?",
            "comments": {
                "igxz90d": "No, I'm not. I just feel a little used yk? It's no her fault because I made myself vulnerable but it's just that, I had my first sexual experiences with her and she was the first person I was interested in that actually treated me as equal and showed me that she cared about me. Having it all gone now feels like I'm drowning in loneliness. I know it's formulated overly dramatic, but it's just the way it feels to me. I definetly would wanna still be friends with her, but I don't think she feels comfortable atm because we did kinda have a thing going on."
            }
        },
        "igxotf3": {
            "body": "Why?",
            "comments": {
                "igxqeht": "She said that she's unsure about her sexuality and she's having a hard time in general, saying she's all over the place"
            }
        },
        "igysccv": {
            "body": "I'm a dude and this has happened to me on like 4 occasions. Not that they directly left me for a girl but they'd start dating one afterwards. Some men just like that bi girl energy i guess.   What's your favourite type of pizza?",
            "comments": {}
        },
        "igy8h3a": {
            "body": "Are you a girl?",
            "comments": {}
        },
        "igyhjca": {
            "body": "How are you feeling?",
            "comments": {
                "igyhp5s": "Eh, pretty shit, I know it's gonna get better but right now I feel like falling asleep while crying"
            }
        },
        "igy1p7a": {
            "body": "you shoulda dressed up in a pink dress n let her peg u",
            "comments": {
                "igy1ted": "Good idea"
            }
        }
    }
}