{
    "score": 432,
    "title": "My wife has been and will be out of state for a few months and I have the house to myself. AMA (30M)",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/w48fgc/my_wife_has_been_and_will_be_out_of_state_for_a/",
    "comments": {
        "ih0pyq0": {
            "body": "When was the last time you've washed the dishes?",
            "comments": {
                "ih0qh88": "Uhh two or three days ago. I've been using the same bowl, fork, spoon and cup that way I don't have to wash as much."
            }
        },
        "ih0ork4": {
            "body": "Have you gone through the fridge and pantry yet?",
            "comments": {
                "ih0p2td": "Absolutely. I got rid of all the stuff she bought and kept saying I'm still going to eat it but never did."
            }
        },
        "ih11ld4": {
            "body": "Would you like my scrambled eggs & salami recipe? That's what my dad made when mom was out of town.",
            "comments": {
                "ih17obo": "I would",
                "ih1fqql": "Me three!",
                "ih1m93h": "Need it"
            }
        },
        "ih12lmj": {
            "body": "When is the party, and how much for admission?",
            "comments": {
                "ih12txb": "Not sure yet and I'll keep the cover pretty cheap."
            }
        },
        "ih12l0p": {
            "body": "What day did you start missing her?",
            "comments": {
                "ih12sqb": "The first day."
            }
        },
        "ih1mvj4": {
            "body": "How long did it take for the boredom to set it?  Everytime my wife and kids leave I'm like fuck yeah I'm gonna play so many video games. Then about 2 or 3 hours in the fiest night I'm like well fuck I'm bored.",
            "comments": {
                "ih2ng2a": "Yeah I'm right there with you. I'm so used to her getting in the way while I'm doing something that now when I have no interruptions I'm like fuck."
            }
        },
        "ih1gmlt": {
            "body": "yo bro my (39) wife (40) is in another country for the next month.We should do something.",
            "comments": {
                "ih27y6v": "r/suddenlygay"
            }
        },
        "ih1p78z": {
            "body": "What do you miss most about her being around?",
            "comments": {
                "ih2npoe": "The general comfort of her being around. The home feels more like a home when she's around."
            }
        },
        "ih1rjik": {
            "body": "how much % of your time you been runnin around the house without any clothes?",
            "comments": {
                "ih2o57o": "A good amount now. Especially since it's hot."
            }
        },
        "ih2u8l6": {
            "body": "How many geese could you, unarmed, take in a fight?",
            "comments": {
                "ih2uzoi": "I think I'm good for about 10 geese."
            }
        },
        "ih14gyn": {
            "body": "Are you planing on duing a quick super cleaning before wifey gets home? Lol",
            "comments": {
                "ih1dmjv": "I always hire a cleaner to come a day or two before she gets home.",
                "ih2k6nm": "I thought about hiring one of those topless maid services just so I could get a show while the house gets cleaned. But my friend who's gotten one said they don't do very well for the price you pay. So I'll just deep clean myself."
            }
        },
        "ih0pzca": {
            "body": "Have you watched porn on the big telly yet?!",
            "comments": {
                "ih0qis7": "Yes I have! And it was amazing. I have a sound bar too so it was even better."
            }
        },
        "ih14z3n": {
            "body": "Are you planning on learning a skill or picking up a hobby, I did archery and the guitar.",
            "comments": {
                "ih2kffh": "Yeah right now I'm learning how to do vector illustration. I've always doodles and made designs so might as well turn that into t-shirts or logo designs."
            }
        },
        "ih0ybhr": {
            "body": "Are you glad you have that time all to yourself? Any itinerary you have in mind while she is away?",
            "comments": {
                "ih0z1db": "In a way I'm glad to have alone time. And no not really. Just a daily routine that I've started."
            }
        },
        "ih1krzz": {
            "body": "In the same boat. My wife is a nurse and took a travel assignment across the country.",
            "comments": {
                "ih2na0l": "Good luck to both of you and hopefully you see each other soon."
            }
        },
        "ih0k5zg": {
            "body": "What is your thoughts about people who are drinking and driving? Why is your wife gone for a few months?Do you want a BJ from a great guy",
            "comments": {
                "ih0kflm": "I wouldn't recommend doing that. Too many innocent people could be hurt/killed. She's gone for training. And no thank you, I prefer women."
            }
        },
        "ih16z4r": {
            "body": "You, shirt, sunglasses, no pants, socks, slide on floor. Did you do it? If yes, were you playing the song or did you go 'dudududu dudu dun' a capela?",
            "comments": {
                "ih34le9": "He didnt wear sunglasses. That's the Mandela effect",
                "ih2knkz": "I haven't done that yet but I'll add it to the list"
            }
        },
        "ih1dle2": {
            "body": "How many Bates/hr you planning?",
            "comments": {}
        }
    }
}