{
    "score": 71,
    "title": "AMA I wear diapers",
    "selftext": "AMAThis is one of those topics that seems like no one ever talks about, and its one of the things that shouldn't be as secretive as it is.I'm 28, I work a full-time job and do basically everything someone my age would do, but I wear diapers.Ask me anything.Back story:I'm not good at back stories, but I've had some incontinence problems since around 10 years old due to nerve problems.My level of control is likely what you would expect from a toddler whos fresh out of diapers, maybe ok on short times away from a bathroom but if I wait 15 mins.And yes I've tried many medications they never work well, and no, a catheter is absolutely not better they are very uncomfortable and risk infection.Ask me anything",
    "url": "https://www.reddit.com/r/AMA/comments/w5atx3/ama_i_wear_diapers/",
    "comments": {
        "ih6wndu": {
            "body": "has it impacted you dating life?",
            "comments": {
                "ih6x7sh": "I'm a fairly asexual person so not really, I can't imagine it wouldn't however."
            }
        },
        "ih77viy": {
            "body": "Do you constantly worry that people will notice or hear or smell that you're wearing a diaper?",
            "comments": {
                "ih79tnp": "it varies honestly, most of the time the answer is no, wearing a diaper is just normal, and frankly, you kind of forget about it often. The noise isn't normally a problem either, at work I wear jeans, there's no real sound. The smell is really the biggest giveaway but good wipes and changing quickly help a lot. There are times I get self-conscious about it, but it is not as often as you think after a while you kinda give up on trying hard to make it not noticeable. The other big thing is no one notices, or if they do they never say anything anyway."
            }
        },
        "ih7kqfb": {
            "body": "Do you have a great Dr?",
            "comments": {
                "ih7mxry": "Not really being that I've got a rather rare disease I'm often referred to different doctors and all most all of them start back over from the beginning, it's incredibly frustrating and expensive"
            }
        }
    }
}