{
    "score": 101,
    "title": "I am a former white collar criminal",
    "selftext": "Hello everybody, my name is Michael Reno. A friend suggested i download reddit and do this.i grew up in a middle class home in Redondo beach/ Torrance CAI was involved in a number of crimes including bid rigging, fraud and tax evasion.I was arrested in 2008 for credit card fraud, relating to a scam i was pulling in a restaurant with a friend of mine. I ended up skipping bail and hiding out in a property i owned in Texas.I turned myself in, in late 2010.I plead guilty to my charges and got 7 yearsSo, great people of reddit, quite literally ask me anything!&#x200B;dont be confused, from now one im gonna be answering your questions from my nephews account.",
    "url": "https://www.reddit.com/r/AMA/comments/umazuw/i_am_a_former_white_collar_criminal/",
    "comments": {
        "i80o2gi": {
            "body": "Why did you turn yourself in?",
            "comments": {
                "i80oapg": "i was living away from my family for 2 years. saw my kids maybe 2-5 times a month. i was very lonely. i decided i would just suck it in and do my time and then move on with my life and stop scamming."
            }
        },
        "i80mma8": {
            "body": "Mike Reno is the singer from Loverboy, are you *THAT* Mike Reno?Are you related to Danny Vegas?",
            "comments": {
                "i80o5t5": "nice one dad!"
            }
        },
        "i80mqbr": {
            "body": "Are you famous?",
            "comments": {
                "i80o7qg": "No, to be honest my friend. maybe in the los angeles county jail."
            }
        },
        "i811zm7": {
            "body": "How much did you make?Do you still have any of the proceeds?",
            "comments": {
                "i823ft8": "i made roughly 3-6 million every year. i had to forfeit all the properties with my name it on it, which werent a lot. but i forfeited 3 million dollars. any other proceeds i have or in offshore accounts"
            }
        },
        "i815fvd": {
            "body": "How did the time you served affects your daily life?",
            "comments": {}
        },
        "i80yysh": {
            "body": "What was your prison experience like?",
            "comments": {
                "i824gcq": "ill be honest. i went to a minimum security. they were some scary guys but they were all bark. i feel if i went to a maximum they wouldve bit more. hey, im not complaining! to be honest most of it was boring, i spent a lot of time in my cell, felt like i was going insane."
            }
        }
    }
}