{
    "score": 332,
    "title": "I walked home from work, found two extremely drunk girls, spent two hours finding a brand new iPhone (found) got them food and they are currently sleeping in my bed AMA.",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/w56lnx/i_walked_home_from_work_found_two_extremely_drunk/",
    "comments": {
        "ih67924": {
            "body": "How will you explain the situation when the ladies wake up/come to?",
            "comments": {
                "ih67jr2": "I'm still trying to figure that one out. I mean at the end of the day I did the right thing. RIGHT?!"
            }
        },
        "ih71rmn": {
            "body": "So how'd it go when they woke up?",
            "comments": {
                "ih7nwb2": "They woke up and I got some beers because they wanted hair of the dog, then I got home and they started dropping valliums. I'm not in to pharmas"
            }
        },
        "ih65756": {
            "body": "Can you find my iPhone?",
            "comments": {
                "ih65dio": "I would like to make a living out of this"
            }
        },
        "ih6pkry": {
            "body": "Update?",
            "comments": {
                "ih7oey6": "So I made water and hot drinks and woke them up. They added all my social media without asking and they started taking a lot of Valium which isn't my thing you know"
            }
        },
        "ih69urg": {
            "body": "Anyone who takes care of the vulnerable without taking advantage of them if a hero.You could tell them you are gay unless u want to date 1 of them.If they were tremendously drunk u might get away with the truth.Does either 1 have a husband or boyfriend waiting on them?",
            "comments": {
                "ih6a5cs": "Not a hero, decency should just be common. Nahhhh I couldn't even vaguely pretend to be gay haha!!! (I hate lying) One of them is very cute and was arms length all night but was so drunk may ask for her Facebook?I have no idea either of their relationship statues but they are both 19 & 20 (I'm 24)"
            }
        },
        "ih6hmgw": {
            "body": "Show them this conversation and they will be won over by your kindness.",
            "comments": {
                "ih6nw4a": "They are awake now.. I think im okay to be fair"
            }
        },
        "ih64kv8": {
            "body": "F or M?Who's iphone was it?",
            "comments": {
                "ih64vwz": "I'm maleIt was one of the girls, the newest iPhone out. Fortunately I bumped in to them 2 hours prior by a 24 hour garage and my gut told me it'd be there (it was)"
            }
        },
        "ih6642s": {
            "body": "Finding phones or rescuing ladies in distress?",
            "comments": {}
        },
        "ih9cgvx": {
            "body": "You're decent. As a woman who has encountered assholes in those circumstances, I am grateful. Be so so proud of yourself. X",
            "comments": {}
        },
        "ih8ltad": {
            "body": "They probably aren't gonna remember anything when they wake up. I would not ask for any contact info unless they remember you. And don't ask for the Facebook. Ask for her number man.",
            "comments": {}
        },
        "ih7nol1": {
            "body": "Did you well, you know?  make them friendship bracelets?",
            "comments": {
                "ih7ontu": "I don't do the deed with anybody I don't see a future with because I have crazy attachment issues. I'm just glad they got home safe"
            }
        },
        "ih9htxx": {
            "body": "I would not take care of anyone in my house without a friend/witness. They can claim anything they want, true or false.",
            "comments": {
                "ih9iixw": "I suppose we're different people"
            }
        },
        "ih6h44z": {
            "body": "What's your favourite kind of cheese?When they wake up, can you also ask them for their favourite cheeses as well?",
            "comments": {
                "ih6nro7": "Mexican, the hotter the better.Ermmmm I would but they are a lot crazier than I was expecting"
            }
        }
    }
}