{
    "score": 235,
    "title": "I finished my masters degree in mathematics at the age of 20, ask me anything.",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/unjb6v/i_finished_my_masters_degree_in_mathematics_at/",
    "comments": {
        "i88nzd7": {
            "body": "What is something about math the world should know about?",
            "comments": {
                "i88paq3": "Its beauty. I like to compare mathematics to art. For a musician, music theory is merely a tool to create art, expressed in the choice of notes, the rhythm, dynamics, etc. - for mathematics it is the same but with ideas. There is a comment on that, mostly regarding how the education system treats mathematics. But the author talks about such an analogy as well. It's worth a read.[https://www.maa.org/external\\_archive/devlin/LockhartsLament.pdf](https://www.maa.org/external_archive/devlin/LockhartsLament.pdf)"
            }
        },
        "i88dar9": {
            "body": "Why didn't you specialize? Do you plan to?",
            "comments": {
                "i88fg6d": "Well, I specialized in algebraic topology, mainly homotopy theory. Still pure mathematics though."
            }
        },
        "i88iqhj": {
            "body": "What's 5 x 5?",
            "comments": {
                "i88jf48": "Depends on the group/ring/field etc. you're working in."
            }
        },
        "i8990xt": {
            "body": "How do you get to a Masters at 20? What does your education history look like?",
            "comments": {
                "i8aa0h0": "I started going to university when I was 15, during school. Finished what the equivalent to high school here is at 17, so really not too young. Then I just continued studying."
            }
        },
        "i88g3zq": {
            "body": "Do you look down on anyone who sucks at maths?",
            "comments": {
                "i88gecc": "Not at all. I think people who are good at something and look down to others that aren't are idiots."
            }
        },
        "i89di63": {
            "body": "Can you explain like I'm 5, why is the derivative of e^x always e^x?I just memorized that in high school but never understood why and I have a computer science degree now and still don't know why.",
            "comments": {}
        },
        "i88owv5": {
            "body": "Favorite kind of cheese?",
            "comments": {
                "i88pgie": "Probably Brie."
            }
        },
        "i88nv7b": {
            "body": "What field do you work in?",
            "comments": {
                "i88oett": "Algebraic topology, mainly homotopy theory. Doing lots of category theory as well."
            }
        },
        "i89ddi5": {
            "body": "Is 25 old to start university ?",
            "comments": {
                "i89me6r": "nope :)"
            }
        },
        "i88d4qh": {
            "body": "I am learning disabled in mathematics. It's not that I don't want to learn, it's that my brain has an extremely hard time picturing and grasping the concept. Would you say you feel pity towards people who are not strong in math?",
            "comments": {
                "i88g4qe": "There are people that are 'stronger' in mathematics than others, I give you that. But all in all I believe it comes down to how one approaches mathematics, how it is taught and if you're passionate about it. Having a 'harder' time with mathematics is nothing to be ashamed of."
            }
        },
        "i8a3015": {
            "body": "Did you ever face problems in school for being too good at math?One of my old friends was gifted in math, but he lost marks all the time in primary school because he didn't show enough of his scratch work. He also really struggled to explain how he arrived at his answers, which would occasionally lead to him getting accused of cheating.Did you face similar issues?",
            "comments": {
                "i8af0i2": "Not really. During my last years in high school I had a wonderful teacher. She tried to answer every of my questions, which where going above and beyond the content of high school. If there was something she did not know, she would look it up for me and explain it next time in class. Earlier on I wasn't really interested in mathematics."
            }
        },
        "i88du3z": {
            "body": "Is the Euler Field Manifold Hypergroup Isomorphic to a Gdel-Klein Meta-Algebreic <0 Quasimonoid Conjection under Sondheim Calculus?",
            "comments": {
                "i88f2hq": "Maybe in the category of gibberish!"
            }
        },
        "i893754": {
            "body": "What field of mathematics? Applied or... fuck can't think of the word... pure maths? (not the word but works)What do you plan on doing with this?I've always wanted to get a degree in pure maths  but job prospects don't seem very good from what I've looked up when dealing exclusively with theoretical mathematics.",
            "comments": {}
        }
    }
}