{
    "score": 89,
    "title": "Dad accidentally sent me (22F) nudes and now I can't see him eye to eye anymore (advice is welcome, I really need to vent / talk to someone about this), AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/w6zxuw/dad_accidentally_sent_me_22f_nudes_and_now_i_cant/",
    "comments": {
        "ihgxzy5": {
            "body": "In the end we are all only human. We all get urges and arousal and some of us send pics to be playful. We all (humans) got the same parts. It's no secret we have peewees and buttholes.Try to think of it less in the view of your dad, and more it was a guy trying to be playful for someone. It's healthy to be sexual. Unfortunately you got caught in the crossfire!",
            "comments": {
                "ihgy5d0": "This is actually a really good way to look at things. Thanks! "
            }
        },
        "ihh40tf": {
            "body": "Time will dull that memory, but you have to let it dull. Everyone here is traumatized. What's your favorite ice cream?",
            "comments": {
                "ihh43by": "Mango."
            }
        },
        "ihgtn5c": {
            "body": "Tbh I would just never Adress it and act like it never Happen",
            "comments": {
                "ihgtw86": "The atmosphere around us is very awkward now, he knows that I saw them and deleted them as fast as he could but now it's like... weird, very weird."
            }
        },
        "ihha7ob": {
            "body": "In high school I sent one to my GF who's mom saw it and sent it to my dad. My dad then sent it to me. This was 9 years ago and I don't even really remember the embarrassment even though I know I felt it.You will both get past this.",
            "comments": {}
        },
        "ihgwamr": {
            "body": "Hey :) As a man i can say we do a lot of weird thingsYou need to find the right angle for your dad and you to process this. See it like a chess game were you need to make the first move. Okay so will you ever be able to laugh about it ? If yes than wait till you can and It will strengthen the connection to your dad even better than it was.If no be clear and wait till you are able to be open about his side of the story. And never think you are alone here a lot of people deal with a lot of shit and you will hopefully get it fixed",
            "comments": {
                "ihgwi89": "Thanks a lot for the nice advice! ",
                "ihh88op": "Initially really badly misunderstood what you mean by 'find the right angle for your Dad'. Sounds like he worked out the best angles himself tbh"
            }
        },
        "ihgutks": {
            "body": "What was it a pic of? Just a dick pic, or a full body pic?",
            "comments": {
                "ihgv881": "There were 2 pics. A full body pic and another mirror pic where he had his legs and you could see his... asshole (God, so nasty)."
            }
        },
        "ihh0ijm": {
            "body": "Ive sent many dick pics but never my asshole lol",
            "comments": {
                "ihh0mk2": "The asshole was definitely the worst part."
            }
        },
        "ihh5m6p": {
            "body": "Nobody can be a perfect robot.  He sent them to you by mistake, not on purpose.  I suppose you could talk to a psychologist or psychiatrist about it - there more of an expert than I am.",
            "comments": {}
        }
    }
}