{
    "score": 51,
    "title": "I've had to sit bedside with numerous people in their last moments of life AMA",
    "selftext": "For some reason people find peace with me at their bedside where they're in ICU or Hospice. I've been there till my father and stepfathers last moments on this earth , a few friends who I've lost , and currently now a friend who's got 3 different cancers , liver failure and heart damage.",
    "url": "https://www.reddit.com/r/AMA/comments/w2f9la/ive_had_to_sit_bedside_with_numerous_people_in/",
    "comments": {
        "igq19qt": {
            "body": "Who would you like to sit next to you when it is your time?",
            "comments": {
                "igq1skl": "Most likely my future wife and kids when it's time to go. The people who love me. I've been there when they ask for ones they love and the people either can't show up or won't show up due to their own selfish reasons."
            }
        },
        "igr6wsa": {
            "body": "I went to bed around 12 EST and was awoken with the news that my friend had passed away not even two hours later. May he not be in pain anymore.",
            "comments": {}
        },
        "igq1nje": {
            "body": "What did they want to talk about?",
            "comments": {
                "igq269j": "All depends. Sometimes they wanted to listen to music that they love or was soothing to them. Other times they wanted to to reminisce about life and the good times. With my dad and stepdad I thanked them for all the sacrifices they made in life to raise me and that I was grateful for that, that I loved them and I apologized for any wrongs I may have done towards them in life."
            }
        },
        "igqnt2z": {
            "body": "What is one of the most common regrets people have at that point in their life? Or similar insight or advice that people tend to give when they've reached that point?",
            "comments": {}
        },
        "igq30yh": {
            "body": "Have you seen a spirit leave anyone's body?",
            "comments": {
                "igq3q8p": "Honestly, I don't know , my father was in a hospital hospice place meant to look like a hotel room but setup for medical. And I stepped out for a call between 10 and 11pm , and I came back in and my father wasn't breathing , I called the nurse in and she said he didn't have a heartbeat , and then I saw him vomit thru his trachea tube and start breathing again with no medical intervention, and happened 2 more additional times over a 3 hour span , until I kissed his forehead at 2am and told him I was tired and going to sleep right next to him in the chairs making a makeshift bed , and that it was ok to  go home  , and held his hand as I went to sleep and at 5am they woke me and told me that he had passed. And we all had to watch him for a continuous 5 minutes before they would declare him deceased. As they had never seen anything like that before."
            }
        }
    }
}