{
    "score": 209,
    "title": "I was sexually abused as a child, but a week from now my abuser is being charged and sued, AMA.",
    "selftext": "I'm in my upper 20s male and the abuse happened for about 8 years or so by an older male cousin. Ask me anything, but keep in mind I may need to be vague about specifics to protect my identity. I'll respond to every question/comment, kinda feel like I  need to talk about it so hit me with all you got.",
    "url": "https://www.reddit.com/r/AMA/comments/w3ujdv/i_was_sexually_abused_as_a_child_but_a_week_from/",
    "comments": {
        "igyr072": {
            "body": "Well your cousin sucks!",
            "comments": {
                "igytrxt": "Yes indeed! But now he is likely going to jail for a while!"
            }
        },
        "igz6uoo": {
            "body": "Hey man, I've been where you are. I got my justice against my cousin who abused me over the course of 3 years as a kid, about 2 years after the fact. I'm a male in my early 20s and have felt your pain for a while.  I just want you to know that you're not alone that I hope you also get the justice deserve.",
            "comments": {
                "igz7x5q": "I'm glad you got the justice against him! We're you able to put it all behind you after it was said and done? I think that is what I'm really hoping for. Just some peace knowing he is not getting away with it and that he will be a registered sex offender, so that others will know he is a potential danger to children."
            }
        },
        "igyrhi6": {
            "body": "How are you doing?",
            "comments": {
                "igytx8a": "Pretty terrible to tell the truth. My mental health is bad and dealing with all this is very stressful and depressing, but I have a therapist and medications. The meds just don't seem to be helping much sadly."
            }
        },
        "igyz5wa": {
            "body": "At what age did it start? How has your family responded? Also, I'm so sorry this happened to you. Sexual abuse is incredibly difficult to heal from but it is possible. Be kind to yourself, healing is not a linear journey but the work is worth the reward.",
            "comments": {
                "igz6jpv": "I was around 8 or so when it started, 15 or so when it ended. My family has been nothing but supportive and loving, and there for me since day one. I couldn't have gotten through this mess without them for sure. Thank you for the kind words of support. :)"
            }
        },
        "igzidva": {
            "body": "Same thing happened to me with an older cousin only my parents assumed 5 yo me was just a pervert and beat the living shit out of me and called me gay all my childhood so look at the bright side you got a loving family",
            "comments": {
                "igzj3ie": "I'm so sorry that happened to you. :(",
                "ih0blf1": "WTF!? That's as eloquent as I can be about your situation, I'm sorry to say."
            }
        },
        "igywji5": {
            "body": "I'm sorry to hear that.Have a virtual cookie, it's not much, but it is a virtual cookie.",
            "comments": {
                "igz64pc": "Delicious  haha thanks."
            }
        },
        "ih02nqp": {
            "body": "I have questions about how you made it happen. I had that problem with my brother as a kid, but he was not that much older than me so I always thought it couldn't be a crime if it's committed by a child and I just had to move on. The other thing is when I told my parents a couple years ago and attempted therapy, my parents immediately took my brother's side. He's their child too and since he's a boy they love him more, so in retrospect it was dumb to think I could tell anyone.",
            "comments": {}
        },
        "igzp9ts": {
            "body": "If it makes you feel better. When he gets to prison the other inmates are gonna make him wish he never touched you. Wish you the best of luck in healing brother",
            "comments": {}
        },
        "igyfvfr": {
            "body": "awesome",
            "comments": {
                "igykjy3": "Thanks :)"
            }
        }
    }
}