{
    "score": 370,
    "title": "My (19M) parents (33M, F) had me when they were 14, AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/uq10q1/my_19m_parents_33m_f_had_me_when_they_were_14_ama/",
    "comments": {
        "i8ohio1": {
            "body": "Are your parents together?",
            "comments": {
                "i8okkc5": "Yes. They officially got married just 3 years ago tho."
            }
        },
        "i8oe86u": {
            "body": "What is the family dynamic? Do you listen more to your grandparents?",
            "comments": {
                "i8oed8o": "In the beginning like when I was a young child yes, I did listen to them more but as my parents grew older they started taking the parent responsability more onto themselves. Today I definitely see my parents as parental figures."
            }
        },
        "i8oi752": {
            "body": "What do they do for a living? And what do you do/want to do now that you're (presumably in college)?",
            "comments": {
                "i8oktmv": "My dad is an airline pilot and my mom is an OB-Gyn. I want to become an air traffic controller."
            }
        },
        "i8opwv2": {
            "body": "First, hats off to1. your grandparents that not only helped your parents raise you but supported your parents as well, explains a lot about upbringing, responsibility and much more.2. your parents to always love you and keep loving you, making you a son and a friend.3. you who appreciates, and loves them all back.Much love and respect to all above.Now my question, by grandparents do you mean both maternal and paternal?",
            "comments": {
                "i8oq5a8": "Yes, both maternal and paternal grandparents. From my birth 'till I was 9 I lived in between their houses."
            }
        },
        "i8o7rs1": {
            "body": "How were you're first years (or the first ones you can remember) having so young parents? We're they up for it alone or did they rely on help form the family? Is it cool now having young parents?",
            "comments": {
                "i8o89il": "During my first years I can remember and overall early years of my life I saw my parents as more of older siblings figures. They relied on the help their family offered completely, I was basically raised by my grandparents since my parents never gave up on school or overworked themselves to support me; they were always there for me emotionally tho so it was never like they were absent. It's so cool especially now that I'm an adult. Because the age gap is so relatively small we can relate to each other when it comes to so many things. My parents are my best friends, especially my dad."
            }
        },
        "i8odtwf": {
            "body": "Are u an only child?",
            "comments": {
                "i8oduhj": "Yes."
            }
        },
        "i8oakek": {
            "body": "How shocked do people get when people find out you're their son?",
            "comments": {
                "i8oap9z": "Very shocked. They always think I'm joking. It doesn't help that my parents still look like they could be in their early 20's. Everyone strongly believes we're siblings at first glance."
            }
        },
        "i8ojtp7": {
            "body": "How do you think having you impacted them?",
            "comments": {
                "i8okwgf": "I honestly don't think it impacted them that much 'cause my grandparents did all of the hard work in raising me because they wanted their kids to live a relatively usual life. They had tons of support."
            }
        },
        "i8ohf1s": {
            "body": "are they still together? and in which house did you grow up in?",
            "comments": {
                "i8okj8o": "They are. I grew up in between my maternal grandparents and paternal grandparents houses up 'until I was 9 and moved in with my parents."
            }
        },
        "i8ou11j": {
            "body": "So you're a little late, don't you think? /j",
            "comments": {
                "i8ouwwq": "I am, right? I should've been on my 3rd kid by now. Such a disappointment. /s"
            }
        },
        "i8orjp7": {
            "body": "How did they approach the topic of sex with you?",
            "comments": {
                "i8orzxr": "They were very open about it. Taught me the correct names of the private body parts very early on, consent, STDs, protection, contraception, all of the important things. I 'came out' to them when I was 11-12 so thankfully they never had to worry about surprise / unwanted pregnancies hahaha."
            }
        },
        "i8ott9s": {
            "body": "This is such a heartwarming story; especially wonderful how everyone came together to raise you. From your parents' perspective, what were some of the challenges they faced as young parents?",
            "comments": {
                "i8oufr3": "Oh, a lot. But the biggest one was probably the stigma. There's this constant association that young parents means uneducated, poor, stupid people. Which I won't be a hypocrite and say that it doesn't have a root in reality, but in my parents' case it really wasn't like that."
            }
        },
        "i8orfxp": {
            "body": "How old are your grandparents? I would guess under 60.",
            "comments": {
                "i8oroyp": "Late 50's, early 60's."
            }
        },
        "i8p057s": {
            "body": "do they want more kids? how would you feel if they had a child at this point?",
            "comments": {
                "i8p07wz": "They don't want more kids and I'd honestly absolutely hate it. I love being an only child."
            }
        },
        "i8p6v4y": {
            "body": "Are any of your great grandparents still alive?",
            "comments": {
                "i8p75op": "Yes! Both sets actually. They're in their 80's."
            }
        },
        "i8opkwy": {
            "body": "Did they complete high school, and any higher education?",
            "comments": {
                "i8opv0m": "Yes, they have. My dad is an airline pilot and my mom is an OB - Gyn."
            }
        },
        "i8olbhv": {
            "body": "what country are you from?",
            "comments": {}
        },
        "i8ol2l7": {
            "body": "I'm your parents age and went on a date with someone your age. Have you ever fucked anyone older than your parents?",
            "comments": {
                "i8ola19": "I haven't. Earlier this year I briefly had a fling for a couple or months with a guy who was 25. That's the oldest I've ever had sex with / dated."
            }
        }
    }
}