{
    "score": 374,
    "title": "My iq is 73 AMA.",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/w4dwl6/my_iq_is_73_ama/",
    "comments": {
        "ih1eq4v": {
            "body": "What's your favorite thing to do?",
            "comments": {
                "ih1f0g0": "Edging"
            }
        },
        "ih1e6ed": {
            "body": "How do you know your IQ is really 73? I hope not by taking a dumb test online. Also,  did you graduate high school or get your GED?",
            "comments": {
                "ih1ehuv": "Yeah i did graduate it. I passed an IQ test by a psychiatrist when i was 16."
            }
        },
        "ih2hk59": {
            "body": "My psychology professor liked to say that no one 'has an IQ of X' but rather that they 'scored X on an IQ test' and that many IQ tests are fundamentally flawed. I suspect this is th case for you, OP.Anyway, this should really be a question for an AMA.What is your favorite color of Jolly Rancher?",
            "comments": {
                "ih2hs9v": "I never tasted it, it's not popular in my country, i don't even remember seeing this in stores."
            }
        },
        "ih2j7a6": {
            "body": "What's 9 + 10",
            "comments": {
                "ih2j9b2": "910"
            }
        },
        "ih1d2g2": {
            "body": "I like potato, u like potato?",
            "comments": {
                "ih1d4gu": "Yes",
                "ih2t9y4": "why did this fucking send me"
            }
        },
        "ih1cx6n": {
            "body": "How old are you?",
            "comments": {
                "ih1cyg1": "19"
            }
        },
        "ih1sagm": {
            "body": "Hello OP,You seem quite articulate and actually self-aware. You also appear to be bilingual. Are you absolutely sure that you are 'dumb'? To me, you sound depressed and with a hint of ADHD. Many people are wrongly considered less intelligent simply because they cannot focus well. On the other hand, people who are truly dumb do not realize that they are. On the contrary, they typically consider themselves intelligent and are not at all self-aware. Also, have you checked your hearing? My hearing is not great and my attention even less so, and there has been more than one occasion in which I might have come across as unintelligent. English is not my first language but I hope I was clear enough.",
            "comments": {
                "ih1vgqw": "I don't think that being self-aware necessarily means that you don't have low intelligence. I've seen plenty of people online who claim to have low intelligence and have similar problems yet they realize it perfectly. Maybe this has to do something with environment and how you're treated by others. I've never had any friends and I've been isolated all my life so i had enough time and reasons to think about it. My hearing is absolutely fine though.",
                "ih3212v": "Listen to this guy"
            }
        },
        "ih1g5xy": {
            "body": "Would you say you're happy person?",
            "comments": {
                "ih1gdn8": "Nope."
            }
        },
        "ih2gzim": {
            "body": "My father is a teacher to low IQ teens (not only low IQ btw), they often have an IQ of 70, sometimes lower, and they clearly can't speak like you do.",
            "comments": {}
        },
        "ih1fv7h": {
            "body": "What makes you sad ? What makes you happy ? What do you think of life ? What do you think of death ? What do you think of love ?",
            "comments": {
                "ih1ga7m": "I don't know if anything makes me sad or happy, I'm just numb most of the time."
            }
        },
        "ih1veng": {
            "body": "Waiting for u/cheese_resurrection to ask OP his favorite cheese, then, make happy cheese noises.  Lol",
            "comments": {}
        },
        "ih28jdz": {
            "body": "Ever stick your dick in anything you regret?",
            "comments": {
                "ih298zb": "No"
            }
        },
        "ih1npfo": {
            "body": "Stories of when it affected your life?",
            "comments": {
                "ih1osgq": "My low intelligence showed when people asked me to do some task and i misunderstood it. In school we had to clean the classroom alone in the end of the day and i couldn't clean it good enough so teacher yelled at me and made me clean it for 3 days more. I just didn't show up to the school. That teacher hated me for all the remaining time i spent in school. Through the school i struggled with every subject except languages. I tried to sit down and understand mathematics so many times and people tried to help me but i just couldn't. I finished school with terrible grades overall. Didn't do an exam for university because there's no point. Also i got almost hit by cars many times because I'm not paying enough attention when I'm on the road."
            }
        },
        "ih1tx5q": {
            "body": "Do you think your iq has caused any issues in life.When I was a teen I got assessed with above average IQ and truthfully it doesn't feel like it's benefited me as much (or even at all) like people would believe it would.",
            "comments": {
                "ih1vqz1": "Yeah, I'm struggling a lot in life, even with everyday tasks sometimes. I can't learn anything of value, I don't think i can get a job either."
            }
        },
        "ih1w2np": {
            "body": "I have been going through your answers and it seems like you might have a tiny bit of autism and also ADHD,  ask a doctor for a test",
            "comments": {
                "ih1xhi2": "Yeah, you're right probably."
            }
        },
        "ih2jdqg": {
            "body": "You're well above 73... I think they told you that to convince you to enlist for some reason. My wife and I worked with people in the social services system for 10+ years and met quite a few disadvantaged people with super low IQ. The issues with their cognition and reasoning are apparent from the first moment you meet them.",
            "comments": {}
        },
        "ih1sxmo": {
            "body": "A low IQ doesn't equate to low intelligence you can still be very smart about some subjects, some people claim to have a high IQ but can be as dumb as mud, don't let this hold you back you live your life and don't ever let anyone tell you you can't do something just you have a low IQ.",
            "comments": {}
        },
        "ih3qvtf": {
            "body": "My IQ is lower than you. Would you feel better or  worse?",
            "comments": {
                "ih3qzte": "Wouldn't care"
            }
        },
        "ih1b9cu": {
            "body": "Is that good?",
            "comments": {
                "ih1bjjh": "No"
            }
        },
        "ih1qsa3": {
            "body": "Table of Questions and Answers. Original answer linked - Please upvote the original questions and answers.***Question | Answer | Link---------|----------|----------|I like potato, u like potato?|Yes|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1d2g2/)How old are you?|19|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1cx6n/)How do you know your IQ is really 73? I hope not by taking a dumb test online. Also,  did you graduate high school or get your GED?|Yeah i did graduate it. I passed an IQ test by a psychiatrist when i was 16.|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1e6ed/)What's your favorite thing to do?|Edging|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1eq4v/)What makes you sad ?  What makes you happy ?  What do you think of life ?  What do you think of death ?  What do you think of love ?|I don't know if anything makes me sad or happy, I'm just numb most of the time.|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1fv7h/)Would you say you're happy person?|Nope.|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1g5xy/)Do you believe in life after love?|What's that?|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1kmc4/)Is that good?|No|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1b9cu/)Stories of when it affected your life?|My low intelligence showed when people asked me to do some task and i misunderstood it. In school we had to clean the classroom alone in the end of the day and i couldn't clean it good enough so teacher yelled at me and made me clean it for 3 days more. I just didn't show up to the school. That teacher hated me for all the remaining time i spent in school. Through the school i struggled with every subject except languages. I tried to sit down and understand mathematics so many times and people tried to help me but i just couldn't. I finished school with terrible grades overall. Didn't do an exam for university because there's no point. Also i got almost hit by cars many times because I'm not paying enough attention when I'm on the road.|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1npfo/)Do you have dreams?|No|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1prtq/)favorite food? fav kind of cheese?|Barbecue, though i don't happen to eat it often. My favorite cheese is cheddar.|[Here](/r/AMA/comments/w4dwl6/my_iq_is_73_ama/ih1jk0t/)---[Source] (https://github.com/johnsliao/ama_compiler)",
            "comments": {}
        },
        "ih3732o": {
            "body": "I used to work with a young lady with a learning disability. Her iq was 71. She could not articulate herself anywhere near as well as you can, her written skills were nowhere near etc.",
            "comments": {}
        },
        "ih3di57": {
            "body": "I've read through some answers and all i see is perfect and eloquently written english, don't play yourself down op, you may have a low IQ, but that that doesn't mean you arent intelligent!",
            "comments": {}
        },
        "ih29ik7": {
            "body": "Would you rather fight 100 duck-sized horses or 1 horse-sized duck?",
            "comments": {
                "ih2aczi": "100 duck sized horses"
            }
        },
        "ih36w6o": {
            "body": "Which word in the dictionary is always spelled incorrectly?",
            "comments": {
                "ih37340": "incorrectly"
            }
        },
        "ih2jvgy": {
            "body": "How many GME stocks are you holding? And whats your favorito crayon flavor?",
            "comments": {}
        },
        "ih1jk0t": {
            "body": "favorite food?fav kind of cheese?",
            "comments": {
                "ih1k10h": "Barbecue, though i don't happen to eat it often. My favorite cheese is cheddar."
            }
        }
    }
}