{
    "score": 179,
    "title": "Both my parents are dead and I'm under 40. AMA.",
    "selftext": "My dad died in 2015 from an AAA. My mom died 2 weeks ago from dementia complicated by the vid and kidney failure. Two very different deaths. No mo' parents.",
    "url": "https://www.reddit.com/r/AMA/comments/w5xeo7/both_my_parents_are_dead_and_im_under_40_ama/",
    "comments": {
        "ihaxnbg": {
            "body": "I'm very sorry for both of the losses.How did you cope or grief with the deaths?",
            "comments": {
                "ihb7gtx": "My dad's death was really traumatic and I didn't deal well with it. Drank a lot but got a grief counselor. Eventually came out of the stupor maybe 6 months later. I'm doing a little better dealing with my mom this time around. I'm letting my friends help me when I shut everyone out with my dad. I'm seeing my grief counselor early. Exercise and meditation. Time will tell though how I really end up."
            }
        },
        "ihb43tr": {
            "body": "Welcome to the suckyest club ever! Mine have been gone since 2019.",
            "comments": {
                "ihb7ib8": "Thanks. It's oddly comforting to know I'm not alone, even though that means someone else is out here lone wolfing it."
            }
        },
        "ihb0ppx": {
            "body": "Whats AAA?",
            "comments": {
                "ihb55y4": "abdominal aortic aneurysmIt's when a lower portion of the body's main artery (aorta) becomes weakened and bulges. An abdominal aortic aneurysm is an enlarged area in the lower part of the major vessel that supplies blood to the body (aorta)."
            }
        },
        "ihaxwnb": {
            "body": "im sorry for your loss, do you have anyone to talk to about it?",
            "comments": {
                "ihb7jzh": "Yes, I have a grief counselor, amazing friends, my sister who I'm very close to, and my husband.ETA: thank you for your sympathy. Meant to include that before I answered your question."
            }
        },
        "ihc40mb": {
            "body": "Lost both mine to suicide 47 days apart at age 13 after an abusive childhood. Got passed around by various family and went to 3 different high schools. Still kept my grades up, actually got a 33 ACT and 1440 PSAT, became a national merit finalist and got into a top 50 university in Boston. At the same time became interested in the stock market and made a lot of money trading options 2019. Started dating a wonderful, loving girl. Then Covid hit, had to move out of dorms, panicked as the market bottomed and lost most my money, ended up breaking up w gf. Really depressed the next year, stuck inside doing online classes, become politically radicalized, start abusing drugs. Finally decide fuck this and move back to my shitty home state to attend state school there. Do that for a year until a few months ago I catch a felony drug charge for weed right after turning 21 so no youthful offender, get kicked out of said school. Now I'm living w my cousin working in a restaurant with this case hanging over my head. Could very well end up in the most violent state prison system in America where I'll probably die or become a monster. Diagnosed with major depression, ptsd, bipolar and I have a chronic stress tic in my neck muscles that drives me crazy. Honestly think about ending it all every day, I can't think of a bigger waste of potential than myself and I just can't believe I achieved so much after such a shitty childhood only to throw it all away so quickly. So many ways it could've been different. Woe is me I guess I just randomly felt like venting here",
            "comments": {
                "ihca5dx": "Holy shit my dude. I'm glad you could get that off your chest. That is absolutely fucking awful to have all that happen. I hope that you are met with mercy. Fucking weed is not a drug that people should be imprisoned for. I wish you the best, and I just want to say that so many people are able to turn things around. You are still young, and there is hope. One day at a time."
            }
        }
    }
}