{
    "score": 494,
    "title": "When I was 22, I made a marriage pact with my then ex-boyfriend to get married at 30 if both of us were single. We (33F/35M) followed through and have now been married 3 years, PLUS have a baby on the way! AMA",
    "selftext": "Hi all!  This will be my final post on this, because I think I've shared all I think there is to share on this topic (see my previous AMAs).Reddit reminded me I created this account a year ago, so fitting to come back on to do one last AMA to take it full circle.tl;dr: My husband and I dated in college, but ultimately broke up.  We made a pact that if we were both single when I was 30, we'd get married.We connected again, we did, and have not looked back!The most frequently asked questions in the past AMAs have been about kids, given the circumstances, and now I can answer those hypotheticals a little better!",
    "url": "https://www.reddit.com/r/AMA/comments/w1lebv/when_i_was_22_i_made_a_marriage_pact_with_my_then/",
    "comments": {
        "igkyoso": {
            "body": "Why did you two break up?",
            "comments": {
                "igkzdeb": "Hi!  So, this is my typical disclaimer for this answer: my husband will FULLY agree with this statement.He was a terrible boyfriend, and I was way more invested/capable in maintaining the relationship than he was.  He was in law school and he says he loved me then, but like didn't prioritize me at all.  He was stressed by school, worked a lot to pay for the stress of law school, and then partied to relieve stress from school and work.Just to add some more details onto this answer than what I've shared before: I was pretty heartbroken to break up with him (though it was ultimately a mutual break-up). Even mad that he couldn't get his act together enough to allow someone close enough to help him get his life together.  I didn't talk to him for almost a year after."
            }
        },
        "igl9d2e": {
            "body": "Did you two love each other when you broke up??",
            "comments": {
                "iglai3f": "I'd say we were in love, but unable to connect well enough to get on the level of loving one another like we should have.  It still hurt to break up (probably more on my part than his)."
            }
        },
        "igl8e2u": {
            "body": "Why did you back with him?",
            "comments": {
                "igl9h4w": "We had maintained a friendship after we reconnected in college.  We've always been really compatible (I can go more info detail on that if you'd like), as friends and more.   It was off and on throughout that time, and I really enjoyed being friends with him.I think ultimately, I could envision being happy with him if things had truly changed.  That was more than anything I could envision with anyone immediately prior to him."
            }
        },
        "iglgxgu": {
            "body": "Is 30 really that old",
            "comments": {
                "iglhzpl": "It really isn't!  I shared in another response on this thread that I would go back and say that 30 isn't old.  I was just young and naive (we both were).  I can say now that it was odd that at 30 I felt comfortable moving forward with it!"
            }
        },
        "igkzidd": {
            "body": "Favorite kind of cheese?",
            "comments": {
                "igkzl6s": "Comt! Also, glad you're back!"
            }
        },
        "igld2q9": {
            "body": "This made me laugh. Cause my best friend an I made the same deal.... We are engaged. And early! 27/28 he is the love of my life",
            "comments": {
                "iglk908": "That's great!  We wish you both all the best! "
            }
        },
        "igl0j1h": {
            "body": "Would you suggest a marriage pact for someone who has been currently single for the past 9 years? [23M]",
            "comments": {
                "igl1fej": "Umm, I mean.  I don't know if I'd ever recommend a marriage pact, because honestly ours was an official ending to a very unofficial pact.Like, There were so many times where we could have or either did forget about the marriage pact, we could've easily pretended to not remember making the pact when we first connected after so many years, and either of us could've backed out at any point in time once we began moving forward on following through with it. To me, it sounds like you're looking for something that is more official from the get-go because being single for 9 years is something that sticks out to you.Here's my honest advice: when we made that pact, I had very little mature understanding of aging and what life was like beyond college. And although it worked out for me in the end because a lot of factors aligned (surprisingly well), I would wholeheartedly go back and tell that 22-year-old that the reasons you are making this pact are not exactly the end-all, be-all you think they are.  I thought single at 30 was *it*, but in all honesty I feel like I'm in my early 20s just with a disposable income.I know 9 years feels like forever if you don't have something you want, but I'll just say that it isn't forever if it'll get you to the right person at the right time.",
                "iglspvo": "Dude you're too young to think being single for 9 years means anything. That means since you were 14. That's not that long. You still have so much time!",
                "iglq0pl": "Are you considering youself single since age 14?  Am I missing something?"
            }
        },
        "iglyx7x": {
            "body": "How did you guys broach the topic of the pact? How did you feel when you realized he was serious/wanted to marry you? What was your favorite memory from your time as friends? Did your family/friends have any weird or funny reactions to your engagement?",
            "comments": {
                "igm17lt": "Ooh, lots of good questions!  I will try to keep my answers organized (but I'm currently having my hair brushed, so may fall asleep before I answer).He was the one who actually reminded me of the pact, and for a little while we were joking back-and-forth about it over the phone.  Things like where we would buy a house, how we would celebrate holidays, what our hypothetical children would be like, etc. And then we met up for coffee one day, and I kind of expected to keep the joke running. But then he seriously brought it up. At first, I recognized that he was saying it seriously, but I still couldn't tell if he was joking around. So my first reaction was that I wanted to take it seriously, but then I second-guessed myself. I didn't want to be embarrassed about actually being into it.I actually almost blew it, because I kind of joked back to him.  But then he clarified how serious he was, and I took a leap of faith and was immediately like yes. Then from then on out the topic of following through on the pact dominated pretty much all of our conversation for the next couple months.My favorite memories of us as just friends are oddly enough when we weren't actually physically together. I would get late-night calls from him from his office, and he just wanted to talk to somebody. And I thought it was just him passing time out of boredom, but eventually I realized that he was calling me to unwind from the day - almost like he was looking for comfort. Not to sound overly full of myself, but I do pride myself on being generally good-natured, and therefore good company. It made me feel good to recognize that through the course of our late-night conversations he would start off really stressed, and by the end of the conversation be in a much more lighthearted mood and ready for a better nights rest. Plus, we were slightly delirious, and therefore hilarious, so those conversations were always quite a hoot.And lastly, we got engaged and married pretty quickly. We told everyone we happened to reconnect and just realized that the other person was the one.  Hilariously enough, my parents were more upset/weirded out by the fact that neither of us wanted to have a large wedding. We ended up getting married at the courthouse and had a really nice, intimate dinner for a small group of friends and family.Also, sorry for any wonky grammar. I used talk to text for this!  I'll fix any typos in the morning. :)ETA: Typos and grammar fixed!  Oof, this was a doozy."
            }
        },
        "igljub5": {
            "body": "What is your preferred streaming service?",
            "comments": {
                "iglk1pf": "Haha, we're currently in a Hulu phase because of Only Murders and The Bear!"
            }
        },
        "igmzum4": {
            "body": "My uncle literally did the same thing. Down to the ages. I was best man in the wedding. 15 years later they're divorced with two teenage daughters and they despise each other too much to co-parent effectively. Godspeed.",
            "comments": {}
        },
        "igl1eeb": {
            "body": "Did you know the gender of the baby yet?",
            "comments": {
                "igl1xca": "We don't!  I'm really fighting finding out (my husband is curious for sure).  Mostly because I wouldn't want to tell anyone, but I also know that if I know, my mother will get it out of me one way or another.And same thing if my husband knows, I'll make him tell me eventually. We're really trying to keep the baby gender neutral!Why the negative votes on this response!?"
            }
        },
        "iglx8zp": {
            "body": "Did the two of you had other relationships after the break-up? how did it went?",
            "comments": {
                "iglyxhm": "I had a couple of semi serious relationships: One that lasted a little over a year, and another that lasted two years. My husband was in a relationship for almost 3, during which he became engaged. I'll share a little bit more light on my relationships. The two guys I seriously dated were good guys. One of them I had known since undergraduate, because he and some friends from his university were close with my friends at our university. However I didn't know him directly really well, until after college and we ended up working near one another downtown. The other guy dated was originally from Hong Kong and working in finance. He was a really good person, but finance will run you ragged. I always knew that he was going to return to Hong Kong, and although I never vocalize it, he and I both knew that I would never leave the states.  It never came up, and we said we broke up for other reasons, but that was a large unspoken part of it. Ultimately, we just wanted our lives to play out very differently, and we couldn't do that together."
            }
        }
    }
}