{
    "score": 214,
    "title": "Male 31. disabled and use a wheelchair. I have an evening to myself. ama",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/ulz7vm/male_31_disabled_and_use_a_wheelchair_i_have_an/",
    "comments": {
        "i7zgb7t": {
            "body": "Bruh. I'm 31 and in a wheelchair too. This is like a unicorn meeting a griffon. We must unite and discuss out plans for world domination",
            "comments": {
                "i7zgdne": "Lol. Good to meet ya. Feel free to dm",
                "i80sv43": "Hi, I'm 33 and in a wheelchair sometimes, sometimes I throw on my peg-leg, can I join?",
                "i7zzzfa": "Hey! Remember to leave Denmark to the aces, and Finland to me"
            }
        },
        "i7yj7c5": {
            "body": "Whats your top speed?",
            "comments": {
                "i7yjf99": "Lol. Depends on how big the hill is "
            }
        },
        "i7yj52q": {
            "body": "Has your handicap affected your erections?",
            "comments": {
                "i7yjdmo": "Yes it does"
            }
        },
        "i7yin6i": {
            "body": "Were you born disabled? How's your romantic life? What's your job?",
            "comments": {
                "i7yjcoy": "Yes I was born with spina bifida. Romantic life is nonexistent. And I'm an engineer."
            }
        },
        "i7z9gte": {
            "body": "You ever check out another wheelchair guys specs like 'dang he got the latest model, must be rich'",
            "comments": {
                "i7z9lpm": "Lol most of the nicest chairs are paid for by insurance"
            }
        },
        "i7zq1uw": {
            "body": "What does typical sex mean when you're in this situation? (I rephrased ten times in order not to be rude, sorry if this is still rude).",
            "comments": {
                "i7zq6g1": "Lol no worries. Its all good. Tbh I am virgin. But for me sex would be pretty normal. I am mobile and have decent strength and balance"
            }
        },
        "i7z1wap": {
            "body": "We know there are many disadvantages to disability, but what are some (in your opinion) benefits exclusive to your disability?",
            "comments": {
                "i7z2hro": "Well because I'm in a wheelchair I get good handicap parking. And I always have a seat everywhere I go. Also just in general a different perspective on the little things in life"
            }
        },
        "i803qbl": {
            "body": "What is the biggest challenge you've faced because of your disability?",
            "comments": {
                "i803zv4": "Probably school and friendships. People just need to be given a chance"
            }
        },
        "i7zc8xv": {
            "body": "Yo engineer here, looking for a project, what is the number one thing you would change about the layout/design of your chair?",
            "comments": {
                "i7zcbhz": "The upholstery. Or the brakes."
            }
        },
        "i7zzink": {
            "body": "This is probably subjective but I have a 2yr old and I've been wondering what's the best way to handle if a kid stares at you using a wheelchair or asks an inappropriate question. Kids are very curious so it would be very normal thing to ask but as an adult I have no idea how to answer that without offending anyone",
            "comments": {
                "i801zwp": "I honestly don't mind at all. They are little kids. They're gonna be curious.",
                "i809xo0": "As a heads up, your kid is just getting to the age where they might be interested in Paw Patrol.  If they do, there's a character there called Rex, who's in all the Dinosaur episodes.  Rex is a pup with a mobility scooter, and they just handle it really nonchalantly by saying Rex has wheels.  That actually helped my son figure things out.  When he met my friend's younger sister, who's in a wheelchair, he just said, Hey, you've got wheels like Rex from Paw Patrol!  And that was pretty much it.  Also, brace yourself.  There's probably a lot of Paw Patrol in your future. "
            }
        },
        "i809dwj": {
            "body": "If you could have any actor play you in the movie of your life, who would you choose?",
            "comments": {
                "i809hpb": "Myself. Because I hate when non disabled people act as disabled people in shows and movies"
            }
        },
        "i80btpt": {
            "body": "What's one thing you wish people knew about people with a physical disability?",
            "comments": {
                "i80c70u": "That we are still humans. Still normal people with just a unique mode of transportation"
            }
        },
        "i7zo6fk": {
            "body": "What do you do when there are people illegally parked in curb access/disabled parking areas? Or like when it's full? Do you just have to wait or try and get onto the curb?",
            "comments": {
                "i7zod0c": "I used to have these stickers i put on windows asking what there excuse was for illegal parking. But if they are full I just park elsewhere and have to roll farther."
            }
        },
        "i7z4rq5": {
            "body": "Do you live alone or with any family members?",
            "comments": {
                "i7z512z": "I live alone."
            }
        },
        "i7zar5f": {
            "body": "What kinds of music do you enjoy?",
            "comments": {
                "i7zb6pq": "I switch it up. But maybe some rock, country, and old stuff. Idk. Depends on the day lol"
            }
        },
        "i810orb": {
            "body": "You're very handsome, I'm surprised you don't have a GF. Have you ever had one?",
            "comments": {}
        },
        "i7zabla": {
            "body": "What's your favorite minute of the day",
            "comments": {
                "i7zady3": "Quitting time! Lol"
            }
        },
        "i80uqf2": {
            "body": "Do you have feeling in your legs?Are you able to use the toilet unassisted? I mean without using a catheter or enema",
            "comments": {
                "i817b3i": "No feeling from knees down.  I use both of those"
            }
        },
        "i7zsu6j": {
            "body": "Do you drive?  If so, how has the vehicle been modified for you?   For example, assuming that you don't have the use of your feet, what functions as the accelerator 'pedal'?  If you do not drive, how do you commute to work?",
            "comments": {}
        },
        "i7yw412": {
            "body": "How are ya?",
            "comments": {
                "i7yxaci": "I'm good. Thanks. You?"
            }
        }
    }
}