{
    "score": 65,
    "title": "Our family moved to Denmark from the US for work and now plan to stay. AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/uap8tf/our_family_moved_to_denmark_from_the_us_for_work/",
    "comments": {
        "i5zotvi": {
            "body": "Would you say that you are an immigrant now?",
            "comments": {
                "i5zq5jc": "We do consider ourselves immigrants now "
            }
        },
        "i60at7o": {
            "body": "My partner and I moved to Denmark from the Netherlands last year after he got a new job here, we love it here that much we have just brought a house here and will begin moving in after we get the keys in June.",
            "comments": {
                "i60m01y": "Were hoping to buy in the next year or two! We want to get permanent residency first. I think its generally a bit easier for EU citizens to purchase a home here. Because the US is considered 3rd country, we have stricter rules."
            }
        },
        "i60h2ys": {
            "body": "Im danish AMA",
            "comments": {}
        },
        "i60tewj": {
            "body": "Are there any negative changes? Did you go to Denmark before moving there? How did you begin the process of moving to another country? Do you know danish, and why did you choose Denmark over other countries?",
            "comments": {
                "i619vsx": "Ooh lots of questions!\n\n1. Negative changes: I wouldnt say negative per se but its been hard to keep up with some people back home so its easy to let relationships kind of drift off. Were all busy and with the time difference it can be tough.\n\nI guess I personally have become pretty cyncical about the US now and dont want to go back. Perhaps thats negative. Its just that I prefer life here. Its much calmer. Plus, I have little contact with my family so I dont have much of a reason to return.\n\n2. We had visited Copenhagen before and were pleasantly surprised but it wasnt like we walked away with the goal of moving here some day. We didnt gl looking for Denmark. It came looking for us (as in a job opportunity came up)\n\n3. Since we are here on work visas, we couldnt do anything until an employment contract was signed. Then we got all of our visas going. Once my husband got his visa, we were able to open a Danish bank account ans start looking for homes to rent. We had a relocation package which was a huge, huge help.\n\n3. We did not know Danish before moving. \n\n4. Actually, one of the key factors for us in choosing Denmark was that most people have a high level of English fluency. This was not for me and my husband but because we were really concerned about our daughters transition. We felt that if the kids her age knew English pretty well, that would help ease her into living here. We were already uprooting her life. We wanted to make sure she could at least make friends."
            }
        },
        "i5z9v7f": {
            "body": "Cool, are you guys happy about the healthcare system compare to the US?",
            "comments": {
                "i5zap60": "For the most part, yes. Our first doctor which was assigned to us by the kommune was terrible. We didnr know enough about the area and how to change doctors to go about changing. I mean, we still got care but it was bare minimum in and out the door care.  We have a new GP that is awesome. Other than the experience with the first GP, weve had excellent care including a few trips to the ER. Its a bit mind boggling to walk out of the ER and pay nothing. \n\nI will admit that having private insurance has been really nice for getting in to see specialists. We tried for several years to get into one type of specialist just through normal means but since its not a life threatening condition there was a long wait. Once I got private insurance through my work, we were able to get into a specialist almost immediately and get help. But, thats honestly no different than in the US really."
            }
        },
        "i5z54ki": {
            "body": "I see a lot of Americans and British people who moved here to Sweden. Im wondering is it like heaven compared to US/UK? I myself want to move to the US in the future, thats my dream.",
            "comments": {
                "i5z5lq9": "For us it has been a really good move. It took some adjusting because societally Denmark is quite different so you have to learn how it works. But we love ir here. That said, we also know people who come and are miserable. It really depends on your situation and what you need to be happy. As an example, some people really need sunshine and warmth to be happy. That can be hard to come by here in Denmark for a lot of the year so those people tend to really struggle. Others come and really, really miss their family back home which can also make it hard especially if youve come for marriage and cant just move back.",
                "i5z7p7q": "Hey!! I know it's complete out of the blue but do you have any old coins or banknotes, I have been trying to get my hands on Swedish currency for some time."
            }
        }
    }
}