{
    "score": 66,
    "title": "Besides being the cheese guy, here's 10 facts about me that you probably don't know. AMA! ",
    "selftext": "1. I'm actually Canadian.I've never been there before, but my dad was born in Labrador so legally... I'm a Canadian citizen.2. I've been playing video games since I was 4. The first game I ever played was Super Mario Bros. on the NES.3. Despite being exclusively a PC gamer these days, my favorite console of all time is the PS2. I also really loved the N64.4. My favorite video game series of all time is Final Fantasy.5. I really loved Pokmon as a kid.I got out of it after Gen 1, but my favorite Pokmon is Gengar. Pikachu is a close 2nd. 6. As far as TCGs go, I loved Yu-Gi-Oh as a kid and later on as an adult, I was really into Hearthstone for a couple years. I was even in the top 1% of players in Hearthstone in the world at one point.7. I went to college twice... and dropped out twice. Had I graduated the first time I went, YouTuber PewDiePie would have played a video game that I had made as my college sponsored one of his videos and everyone in my graduating class got their games played by him in a video. 8. My favorite dessert is cheesecake. I really just love a good New York style cheesecake. 9. With my first ever Reddit account, I actually created a meme/meme template popular enough that it's on Know Your Meme.I doubt most of you have ever seen it, but I created it for Halloween one year. It was called Spooky Thomas. 10. No, I'm not a mouse ^squeakAMA!*happy cheese noises* ",
    "url": "https://www.reddit.com/r/AMA/comments/w38i35/besides_being_the_cheese_guy_heres_10_facts_about/",
    "comments": {
        "igvhbui": {
            "body": "Fat clapping ass cheeks with cheese in between em how do you feel about this?Edit: I will get you to respond to this I swear",
            "comments": {}
        },
        "igux1i7": {
            "body": "Ha! I bet you thought I didn't know about all this stuff",
            "comments": {
                "igux57u": ""
            }
        },
        "igw8vzp": {
            "body": "I hope you're doing well! I have some cheese specific questions.Best cheese (blend) for pizza?Best cheese for crackers?Best cheese (blend) for grilled cheese?And lastly, best cheese to munch on its own?",
            "comments": {
                "igxbfrc": "Mozzarella, Parmesan, Asiago, RomanoCheddar Smoked goudaCheddar"
            }
        },
        "igvcxc6": {
            "body": "When is the last time you got drunk? Are both your parents alive? Are you having a good week?",
            "comments": {
                "igvd1ax": "For 4th of July I was pretty buzzed. They are. So far, so good."
            }
        },
        "iguurje": {
            "body": "Favorite type of cheeeeeeeeeeeeseee?",
            "comments": {
                "iguut8x": "Queso Blancoooooooooo"
            }
        }
    }
}