{
    "score": 143,
    "title": "I 23f have never kissed anyone or had sex, never orgasmed, never had a boyfriend, never tried drugs, never tried alcohol, never missed a class in school, don't eat meat or dairy or eggs (about 7 years), and don't drink coffee (maybe in coffee flavored things) ama.",
    "selftext": "Just to preface I don't think these are good or moral things, it's just what works for me.",
    "url": "https://www.reddit.com/r/AMA/comments/w6md8g/i_23f_have_never_kissed_anyone_or_had_sex_never/",
    "comments": {
        "ihezplw": {
            "body": "Have you tried to orgasm from masturbation? Or did you not attempt to? What's your go to breakfast as well. Would you say you follow an almost vegan diet?",
            "comments": {
                "ihezrs3": "I have tried and it didn't go super well lol. I actually recorded it and posted it to r/gonewildaudioAnd I usually have fruit with oatmeal for breakfast. And I'm vegan except for honey"
            }
        },
        "ihf0pqp": {
            "body": "I really don't understand how a living person could exist without doing at least one of your listed things. I have written off coffee and drugs but I couldn't imagine a life without the rest.But are you happy? Cause it sure sounds like it from reading some of your comments in this thread. Then don't let anyone take that away from you just because you don't conform to the norm.As long as you don't hurt others, do as you freaking want. All the power to you.",
            "comments": {
                "ihf0yct": "Thank you!! Haha well I mean the sex stuff would be something I'd do if I was more attractive but I think at this point I'm happier not having to worry about it. I am generally pretty happy with my life. And I still have fun lol, these are all pretty specific things"
            }
        },
        "ihepyo1": {
            "body": "Not to sound any part rude but how doth one function without the brilliant caffeinated embrace of coffee in the morn",
            "comments": {
                "iheq1lc": "Hahah I am really lucky actually and sleep really well. So even if I don't sleep a lot, it's always pretty restful"
            }
        },
        "ihf15yl": {
            "body": "Looking at your other post, why do you tink so little of yourself and your appearance?",
            "comments": {}
        },
        "ihf2k3a": {
            "body": "were you in band in high school? lol",
            "comments": {}
        },
        "ihev4xf": {
            "body": "Let me guess, you're either Indian or seventh-day Adventist...? That aside, I don't think you've missed out on much, aside from relationships: I was in better health when I was a vegetarian, got better sleep before I drink coffee all the time, know that alcohol and drugs are highly overrated and think that discipline is a very good thing (never missing class is something to be proud of, you made a commitment and stuck to it!).As far as the sex part, even that is overrated: sure, it's natural to feel good after that release, but it's been my experience that sex outside a monogamous relationship loses its flavor after a while. Having a relationship feels so much nicer, and the sex inside of that is really good, it brings you closer. Since you've waited for so long, my advice is to wait until you're married, if you can.",
            "comments": {
                "ihevdft": "Haha no I'm not religious and I'm a white American. But I appreciate it, I do feel behind a lot lol.  i don't really even plan to date though tbh. I'm really not attractive so I think my best qualities shine when I'm not in a situation where my looks are gonna affect someone else's life"
            }
        }
    }
}