{
    "score": 71,
    "title": "I (25F) have an olfactophilia (odor / smell) fetish and my boyfriend doesn't shower / bathe when he knows he's going to be home for long periods of time as per my request, AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/uq27x4/i_25f_have_an_olfactophilia_odor_smell_fetish_and/",
    "comments": {
        "i8oh8em": {
            "body": "Is he circumcised or uncircumcised?",
            "comments": {
                "i8ohdj8": "Uncut"
            }
        },
        "i8ousr5": {
            "body": "I have a fetish which falls under the same category where I love the smell of someone's breath. Not necessarily bad breath but smelling a girls breath is just hot af man instant turn on",
            "comments": {
                "i8ov222": "Weirdly enough I don't like the smell of breath, like at all for some reason."
            }
        },
        "i8og0im": {
            "body": "How does one discover that fetish?",
            "comments": {
                "i8og7kn": "I personally grew up with 2 older brothers who were really into sports and even tho they did have good hygiene there were a lot of times when you could smell the sweat. For some reason that smell turned me on and it kinda lead to this fetish, I think."
            }
        },
        "i8os9r3": {
            "body": "Not to kink shame you but that is really unhealthy. It allows fungal growth to build up. I read through some of the comments, and medically it's very concerning the risk of infections and complications are crazy.",
            "comments": {
                "i8osi9o": "Don't worry, we don't do it for long periods of time. Usually it's just like 2-3 days. No different than going on a weekend camping trip and not showering."
            }
        },
        "i8oi2xe": {
            "body": "Do you know if it drives him a bit crazy not showering?For example I'm a guy with longer hair (bangs past my chin long enough to tie in a high ponytail) I can't go more than 24 hours without a shower, or it feels like my hair is going to mat and it just FEELS gross.",
            "comments": {
                "i8oiawe": "Well, we don't do it for super long periods of time. Like the max I think was 6-7 days when he had off from work and he just chilled home. He has short to medium hair and his hair is naturally pretty dry so he would wash it only like max 2 times per week anyways. I think he's fine with it 'cause he knows I'm having fun."
            }
        },
        "i8oiz6z": {
            "body": "What's the best sex you ever had?",
            "comments": {
                "i8oj4ni": "Spontaneous sex right after my bf comes home from the gym (before he takes a shower) and is dripping with sweat."
            }
        }
    }
}