{
    "score": 194,
    "title": "Im a black 14-year-old in a low-income family. AMA",
    "selftext": "(BTW. it is very hard to offend me. so truly free free to AMA)  FAQ:  Q: whats it like in the hood  A: there are no hoods in Alberta. i just live in a cheap-ish 1 story house. its not bad.  Q: do you even have a phone  A: no. but i know damn well my parents can afford me one but refuse to do so until i get ajob. when i was 10 i was pissed but now i understand. ",
    "url": "https://www.reddit.com/r/AMA/comments/w50c0a/im_a_black_14yearold_in_a_lowincome_family_ama/",
    "comments": {
        "ih5cnbb": {
            "body": "How much do you think about your future?  Are you making plans to having a different life than you live now?",
            "comments": {
                "ih5dx03": "Honestly i think very highly of my future  I always keep faith in it no matter what.  I dream of becoming a NASA engineer because I've always loves building things and space."
            }
        },
        "ih5d75v": {
            "body": "Two questions. 1) How do you feel about being black? 2) What is your attitude towards your family? . Answer those questions however you perceive them. Btw, keep your head up, poor or rich. You're no less of a person than anyone else, and I think your openness to answer these questions is commendable.",
            "comments": {
                "ih5f05o": "1. honestly, being black i dont think much of it. i was born the way i was born and there's nothing to really say about it.  2. I LOVE my family. my mom is the sweetest and most co-operative person ever. she just has trouble understanding me sometimes becuase my personality is 80%of my dad's speaking of my dad, he is a very hard working person and will do anything to keep my family afloat. he even works overtime during times of trouble. he cares about me and my brother very highly and is eager to watch me grow my future.i just thank the lord i have such caring parents. becuase some people can only dream of these things."
            }
        },
        "ih5hoso": {
            "body": "What's your gameplan to break your generational curse and become an upper middle class financially free black man?",
            "comments": {
                "ih5ii7w": "Study. Study. Study. My dad told me that 80% of his family tree had some kind of trouble academically and my mom's family tree skipped school ALOT. i think the best chances i have are to start setting up my life from SUPER early in my life so i get a massive head start when i finally break that 18 barrier, and then i am gonna pursue my dream job as a NASA engineer (which is a high-paying job). and then im gonna make sure my parents are set up for the rest of their lives because they deserve it."
            }
        },
        "ih5bdku": {
            "body": "What do you do for fun? Hobbies n stuff?",
            "comments": {
                "ih5cgnr": "Before 2020: After school i would go to the pool with all my friends and just swim/dive until our legs starting killing us. then we would go to the public library right next to the pool and play online browser games like krunker together until it got dark.After 2020: Mostly keep to myself in my room, pursuing game development and attending online school. watching yt videos and crap. and every once in a while go out to play soccer with my little brother in the nearby field."
            }
        },
        "ih57mr2": {
            "body": "[removed]",
            "comments": {
                "ih59h5o": "ayyyyy"
            }
        },
        "ih5od2l": {
            "body": "How do you know you're low income? You say you live in a house (as opposed to a project or apartment), at least your dad is employed, you go to the pool, your family is considering going somewhere for vacationare you sure you're not middle class or lower middle class?And a second question I'm often curious about with black Canadians: what's your family's history that ended up in Canada? Were your ancestors refugees from the US, or immigrants from some other country, or something else? And since you want to work for NASA I guess you hope to emigrate to the US?",
            "comments": {
                "ih5q2y1": "1) maybe i overexaggerated a bit, but sometime i feel like we are low-income whe we fall on hard times. its kind of seasonal thing. also our house is 40 years old and when we first got it the economy was up a bit2) i was in an afterschool program that allowed us to enter the pool for free, after all the other programs are finished.3) as of right now our financial status has been falling on good times, so we are planning to maybe stay at a hotel for a couple days. as a luxury or something.  4) my dad grew up in jamaica, and my mom grew up in Canada, my dad's family moves to canada for education purposes, and my parents meet for the first time.  5) as far back as my parents will tell me, my Grandma was also jamaican but moved to canada, and my dad's entire family is native to jamaica.  6) i have basically no choice but to move to the US for my dream job. i hope the food there isnt as oily and salty as literally every stereo type says they are."
            }
        }
    }
}