{
    "score": 63,
    "title": "I think I'm Asexual but my girlfriend won't accept it AMA",
    "selftext": "This could be confusing for some people. There's a difference between Asexual and Aromantic. I still am very interested in women, companionship, dates, romance, marriage etc etc but at the end of the day my goal is not to have sex. It's to go to sleep. And it's nothing to do with her I love her very much. I don't want to have sex or be sexual with anyone. Sex truly never crosses my mind. Unfortunately she is a very sexual person and always wants to have sex and unintentionally makes me feel absolutely awful when I decline. AMA",
    "url": "https://www.reddit.com/r/AMA/comments/un2mqh/i_think_im_asexual_but_my_girlfriend_wont_accept/",
    "comments": {
        "i85qgd2": {
            "body": "Have you thought about breaking up?If she wants a sexual relationship and you don't then I'd say it's times to end things. That's the only fair thing for you and for her. You'll find someone right for you, I have no doubt.",
            "comments": {}
        },
        "i85p2i0": {
            "body": "Not a question.... but it wont work for you.I also have lower libido but when matched with women with above average libido they either cheat or it becomes a fight. (The fight may not be directly related, but just intentional turmoil.) You can find a girl with low libido.",
            "comments": {
                "i86mmz0": "Finding women with low libido is really not difficult."
            }
        },
        "i867ez5": {
            "body": "Is your girlfriend a) objectively attractive b) do you agree?",
            "comments": {
                "i87c1r1": "Yes, she is objectively a 9/10. She gets hit on every time we go to a bar by either the security, the bar staff or a customer. Sometimes all in the same night. She has people from work trying to hit her up very frequently too. And I absolutely agree, she's perfect to me in terms of attraction"
            }
        },
        "i86quvp": {
            "body": "Is sex like playing basketball to you? Like you're gf really want to play basketball but you're like ugh that's a boring game. Or is it more than that? Like do you dislike sex?",
            "comments": {
                "i87b45e": "This is actually surprising accurate yes"
            }
        },
        "i85w5b6": {
            "body": "I wonder: as a asexual, how important is attractiveness of a partner to you?",
            "comments": {
                "i86cqaz": "I'm asexual so for me I'm not sexually attracted to people but I am aware who I find attractive and I do have a type. But when I see a beautiful guy or girl I admire them the same way I would admire a beautiful peice of art. And if in a relationship where I have to see them everyday I'd prefer to be looking at something pretty tbh",
                "i87cb7z": "Attractiveness is very important to me in a partner. Idk if that's hypocritical or not?"
            }
        },
        "i85zhca": {
            "body": "Hiya! I'm engaged to a wonderful woman, who recently came out as Ace. I feel you, this has been difficult for both of us. For years she felt guilt when she didn't want to have sex, and I was climbing up the walls due to being so horny and nothing could be done about it lol. But since we really wanted to stay together, we found an arrangement!Has she ever thought about getting a FWB? Would you consider that idea for the sake of not breaking up? This has worked great for us, since my romantic needs are met with her and I just need the physical side, and that way she has her peace of mind. Maybe that could be something to consider!",
            "comments": {
                "i86n93w": "One of those..Hopefully it's actually working for her and she's not just saying it because she's still feeling guilty about her sexuality."
            }
        },
        "i86c7e4": {
            "body": "Have you had your testosterone levels checked?",
            "comments": {}
        }
    }
}