{
    "score": 126,
    "title": "Currently in prison, AMA",
    "selftext": "Edit: Please stop asking about prison rape. I understand some of you are legitimately concerned about sexual assault in prisons, but a lot of y'all are getting way too giddy about it, and I don't believe you're asking in good faith.",
    "url": "https://www.reddit.com/r/AMA/comments/w3q5yd/currently_in_prison_ama/",
    "comments": {
        "igxmd09": {
            "body": "Are you on a cell using the Reddit app, if so, was the phone smuggled in in someone's butt?",
            "comments": {
                "igxncrp": "No, I'm using a computer in the call centre I work in."
            }
        },
        "igxm46z": {
            "body": "How long are u there?",
            "comments": {
                "igxn7fq": "This is my 3rd month of a 17 year sentence."
            }
        },
        "igxn815": {
            "body": "How do you have access to reddit?",
            "comments": {
                "igxnoq8": "I logged into it on a computer, which I use for my call centre job. I'm not supposed to be on Reddit, but the site isn't blocked, and I wanted to educate people on todays prison system."
            }
        },
        "igxqumd": {
            "body": "what's the food like",
            "comments": {
                "igyio3d": "Honestly, the chow food isn't horrible tasting, persay, it's just bland, and worse, repetitive. Every meal is made of the same couple base ingredients, regardless of the different foods incorporated, and it becomes disgusting eating basically the same thing three times a day every day.Basically, if someone on the outside tried it they'd think it's a decent meal, but having it every single day makes it disgusting.Inmate food is honestly pretty gross in a vacuum, but is an amazing reprieve from the bland chow food, so psychologically you think it tastes a lot better than it does.The commissary food is good, brands you'd recognize, but by the last order of the month a lot of the more perishable items have started to go bad, and you've gotta learn the cycle and know what to avoid on what days."
            }
        },
        "igxupiu": {
            "body": "Do you have chance of early release?",
            "comments": {
                "igyiyxr": "Due to the violent nature of my crime, I won't be eligible for parole until 2030. Whether or not, and when I receive it is a different question entirely."
            }
        },
        "igy6oqd": {
            "body": "Can you order stuff on Amazon with this prison computer?",
            "comments": {
                "igyjqr5": "Lol no, any financial transaction is blocked (and I don't exactly have my credit card anyways.) However, Amazon does supply a number of the commissary items and delivers them to prisons."
            }
        },
        "igxlhth": {
            "body": "Are you guilty?",
            "comments": {
                "igxllm4": "Yes, I actually turned myself in at my Deacon's request."
            }
        },
        "igxu18p": {
            "body": "Any human rights abuses in your prison you think that journalists should be made aware of?",
            "comments": {
                "igylb1z": "In a broader sense, private prisons tend to clean up their act a lot before government inspections or reporters, to give something of a curated view. They often don't even hold up to the poor government regulations in terms of nutrition, safety, cleanliness, healthcare and, most of all, quality of educational and rehabilitation programs. So much of it is an act put on for inspectors and cameras."
            }
        },
        "igyn1cg": {
            "body": "So out of curiosity, what did your wife have to say about this? i mean I totally get being hurt and seeing red, and wanting to beat someone up. I understand it probably just got way out of hand.",
            "comments": {
                "igzv8mr": "I haven't had a one on one talk with her since the incident, to be honest. She's been scared of me, and I only saw her from the other side of the courtroom. I tell myself every couple of days I should call, to at least attempt to apologize, but I can never find the strength."
            }
        },
        "ih0hbhz": {
            "body": "Why do you use British English spelling?",
            "comments": {}
        },
        "ih03ybs": {
            "body": "I have 2 question. What are your top 3 things you miss most so far? (Little things like food from your favorite place, petting a dog, or having a BBQ with friends.)Is there anything you are glad you don't have to deal with in prison? (Things like sitting in traffic or mowing the lawn.)",
            "comments": {}
        },
        "igzvry4": {
            "body": "Are you American? Your writing is not American English.",
            "comments": {}
        },
        "igy1dg3": {
            "body": "Favorite dish they serve?",
            "comments": {
                "igyy0vs": "Honestly, all taste about the same. And I don't mean in quality, I mean, no matter what food it is, it's all the same base ingredients and tastes basically the same."
            }
        },
        "igzbl5j": {
            "body": "How do you plan to spend your time? What's the first few months been like?How's your relationship now?",
            "comments": {}
        },
        "igzkg34": {
            "body": "Wait a minute, please don't downvote for me for being genuinely curious people, but how can you be in the call centre and currently in prison?",
            "comments": {
                "igzt0pl": "Lots of companies outsource their labour to prisons, because they don't have to pay us anywhere remotely close to minimum wage."
            }
        },
        "igyutez": {
            "body": "This is bullshit",
            "comments": {
                "igzh9yo": "Right lol. It takes 3 seconds to look at his profile and read his most recent posts and comments"
            }
        }
    }
}