{
    "score": 194,
    "title": "I was born intersex with extra chromosomes. XXYY. AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/umeefh/i_was_born_intersex_with_extra_chromosomes_xxyy/",
    "comments": {
        "i812z29": {
            "body": "[deleted]",
            "comments": {
                "i81388d": "He/him. Tbh? Difficult and challenging. I had lots of surgeries to current stuff and they aren't anywhere near to finish."
            }
        },
        "i8147l1": {
            "body": "How do you explain this to others? Especially me",
            "comments": {
                "i814wdv": "I usually don't open about this to anyone. None of my friends except one special one knew or know about this. So I really don't know how i'd even start explaining"
            }
        },
        "i814ces": {
            "body": "What county do you live in and what kind of support/lack thereof is available to you?",
            "comments": {
                "i814mkr": "I live in UK. There aren't much intersex support tbh but I am mostly welcome in transgender community and support groups. I did attend one for years when i was a teen but later i started feeling down and stopped attending.The lack would be knowledge and training school system had. I wasn't allowed PE or inside changing rooms and i had to get a key from the teacher's office for disabled toilet as i wasn't allowed in either bathrooms. That was quite difficult and tbh i don't know if they are still allowed to do that."
            }
        },
        "i823vvm": {
            "body": "So do you have an entire vulva or just the vagina? Is your urethra next to your vagina or on the tip of your penis? I read you like masturbation, can you orgasm with both your penis and vagina? If you can, do you prefer one over the other? Do you have a clitoris?",
            "comments": {
                "i82b4xr": "I don't have clit no, it's a penis in its place. I urinate from bottom of my penis where the hole of penis has stretched down, it never closed fully when developing. Regarding vulva it's where things get interesting in my opinion anyway. My labia majora looks awfully like a ball sack that has been ripped open. But that's it, there is one opening, no urethra, no labia manora. I never tried to masturbate with vagina tbh, i tried toys once but extremely painful so no. I masturbate with penis and feels good but I don't cum like males tho"
            }
        },
        "i82f0lc": {
            "body": "Do you feel like common LGBT+ narratives represent your beliefs/feelings? Intersex people seem to be referenced a lot when discussing topics like gender binary, but I've never actually heard from an intersex person (that I know of). Sorry if verbiage is offensive I wasn't sure how to word it.Edit: removed quotation marks",
            "comments": {
                "i82gdap": "No they don't. I personally feel my feelings are yes similar to transgenders but not entirely exact. I am happy with my body, but because of how world is i have to have surgeries to fix myself to be accepted by people. I am not a trapped person i am who i am. I am male but i have some female traces, i can never act as a fully male because i am not, nor fully female that's just who i am. I'm not none-binary either. I'm in the UK and few years ago i requested to be trained by stonewall to represent intersex community in my university for staff members not students. It didn't go well. People don't understand and they feel i am similar to transgender. I do consider close to them because i have no other choices but that also means people commenting that they should just accept themselves of who they are."
            }
        },
        "i81nwyo": {
            "body": "Do you know many other intersex people? I feel like we don't get taught enough about it and I don't know whether it's because it's not that common or just a lack of due diligence where sex education in schools is concerned.",
            "comments": {
                "i82beyl": "True intersex is rare, that's what my dr once told me but the intersex umbrella condition isn't rare at all. We might see people but not know they actually are intersex.No, i never met anyone like myself, i met a couple when i was young but none had ambiguous genitalia."
            }
        },
        "i812zon": {
            "body": "What does that mean for the develpment of secondary sexual characteristics?",
            "comments": {
                "i8135qy": "I had female puberty at 11 then started hormone blockers at 12 but male puberty happened anyway at 15.  I had to come off hormone blockers and i chose testosterone against Dr's recommendation."
            }
        },
        "i81qj4c": {
            "body": "Are you able to be aroused with either organ?",
            "comments": {
                "i82bhop": "Yes. It's very rarely my vagina gets wet, but my penis gets erection very easily."
            }
        },
        "i815i45": {
            "body": "What pronouns do you use? Sorry if I bother you with the question.",
            "comments": {
                "i815j8l": "Not at all! He/Him"
            }
        },
        "i82b1wm": {
            "body": "no need for  bad jokes this guy is opening a window to us  normies  so RESPECT ",
            "comments": {}
        },
        "i81hs7s": {
            "body": "Are you mentally impaired in any way or does the extra chromosomes just effect your sex organs?",
            "comments": {
                "i82aea7": "I have autism but as IQ i'm not lower than normal no."
            }
        },
        "i81jelk": {
            "body": "Serious question I hope you don't mind I ask. Masturbation question -  can you put your penis into your vagina?",
            "comments": {
                "i820mis": "Like a little kangaroo pouch for your penis.",
                "i82bs2p": "Haha hilarious one as i wondered if i had longer penis i would be able to. No i can't myself"
            }
        }
    }
}