{
    "score": 165,
    "title": "I was cheated on my by husband. AMA.",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/uota0f/i_was_cheated_on_my_by_husband_ama/",
    "comments": {
        "i8gq2u9": {
            "body": "What was his reaction when you confronted him?",
            "comments": {
                "i8gq8cv": "Apologetic. Regretful. Embarrassed. Promised it'd never happen again, up until the most recent time when he said he didn't want to promise me and then fuck up again and hurt me even more."
            }
        },
        "i8gifev": {
            "body": "How did you find out?",
            "comments": {
                "i8giw9s": "Every time before I actually go through his phone, something doesn't feel right, and makes me consider going through his phone. So that's what I did."
            }
        },
        "i8hr5oe": {
            "body": "You've said you don't plan on leaving him, so my question is, how do you plan to work through it? Second question: He told you that he can't promise it won't happen again - would you consider that staying together is enabling him, since he knows you won't leave if he continually disrespects you?",
            "comments": {}
        },
        "i8hz2qk": {
            "body": "You stated that you're both 20. How long have you guys been married? & moving forward will you be fine with finding him cheating again?",
            "comments": {}
        },
        "i8h4hfk": {
            "body": "How did finding out make you feel about yourself? And do you think you could ever see him the same way again?",
            "comments": {
                "i8hqbz9": "Like, my self esteem? I already had self esteem issues beforehand. So it didn't help after finding out about it. I think we can work through it, but I don't see him the same way as before."
            }
        },
        "i8hl7wd": {
            "body": "Does his family know? If so how did they react?",
            "comments": {
                "i8hpyd1": "They do not. I don't know how most would react, but I know his mom would flip shit."
            }
        },
        "i8hgn44": {
            "body": "Cheating is abusive. Not only emotionally because it holds you hostage in a relationship without the honesty of what the other person did bit also physically because it puts you at risk of STDs.",
            "comments": {
                "i8hq49q": "He didn't sleep with anyone. It was online. Trading nudes and sexting."
            }
        },
        "i8icez0": {
            "body": "I'm sorry this happened to you. If you are not in a position to leave then marriage counselling and even individual therapy may be the best option. Please just know that your husbands actions are no reflection on you as a person, no matter how it may make you feel. He is the one with the problem, not you, and this is all on him. You deserve much better.",
            "comments": {}
        },
        "i8h3w9g": {
            "body": "How old are you both?",
            "comments": {}
        },
        "i8i930k": {
            "body": "Find the self-esteem to get out or forever live the life of a carpet, trampled on again and again again. It's only lose if you stay. And it is that simple.",
            "comments": {}
        },
        "i8gjhnn": {
            "body": "are you guys considering marriage counseling or therapy?  if no I would definatley recomend it. that kind of thing going unchecked can be unhealthy",
            "comments": {
                "i8gk6en": "I plan on bringing it up some time in the future. I have issues, he has issues, and a lot of them affect our relationship, plus this happening. I don't think I can continue if it's left unresolved like it is."
            }
        },
        "i8iogg6": {
            "body": "A couple of things, from someone who's been cheated on and contemplated cheating.Whatever happens, please, please don't consider having children for a good few years after getting back on track. It's so easy to think after a few months of things going great that it would be time to start a family, bringing you closer together etc. But it never works like that. Becoming a parent is the hardest thing you'll ever do, and the biggest strain on a relationship there ever will be.I'm not saying you should leave him, nor not have a family, but give it a good two or three years minimum if you do want kids, I promise you it's worth the wait long term for the stability of your marriage and future family.Good luck with everything xx",
            "comments": {}
        },
        "i8h4p20": {
            "body": "where is that mf house",
            "comments": {}
        },
        "i8gj9sq": {
            "body": "Is the other one prettier than you?",
            "comments": {
                "i8gk8iu": "All of them have been, yes."
            }
        },
        "i8iz6mz": {
            "body": "I'm sorry, really don't mean to sound harsh or anything. But it's definitely important to say in the title that it wasn't actual sex - that it was sexting and exchanging nudes. I am sorry tho, that is very hurtful and not to be taken lightly.",
            "comments": {}
        }
    }
}