{
    "score": 145,
    "title": "I'm a 5 star hotel pastry chef! AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/ulxndd/im_a_5_star_hotel_pastry_chef_ama/",
    "comments": {
        "i7ybvjv": {
            "body": "Do you get alot of Muslims coming asking if it's Halal?",
            "comments": {
                "i7yc6hj": "Yes! However thankfully most of the time we get told beforehand so we can easily cater to it. Most desserts are halal anyways however some like mousses etc aren't due to gelatine. We treat it as any other dietary restriction and make sure it 100% is"
            }
        },
        "i7ypb3c": {
            "body": "What's your favorite butter to work with? Is European butter the best?",
            "comments": {
                "i7yr52w": "I've always worked with European butter and personally I think French butter is the best, the American type probably has a lot of additives. I also think its quite stupid how in America they use cups as measures or 'sticks' of butter rather than weighing, It seems incredibly inaccurate whilst accuracy is the most important thing in pastry"
            }
        },
        "i7yoj6i": {
            "body": "what are your favorite and least favorite pastries to make?",
            "comments": {
                "i7yrcdc": "Ahhh i think I answered my least favourite earlier ans that is pastry tart cases and favourite is probably clairs, I absolutely love making choux pastry ans seeing it rise ans the fillings you can do are endless"
            }
        },
        "i7zcfg0": {
            "body": "What 5 star desserts to you recommend for medium skilled home bakers attempt?",
            "comments": {
                "i7zhr5t": "A Creme Brulee, people are always so impressed by the as they think it's the most difficult dessert in the world but uts defo not, to make it even more fancy flavour your base with something for example Rose & raspberry Creme Brulee. It's literally three ingredients, sugar, cream, egg yolks  Another one would be any sort of mousse, but the key to this one is use some sort of silicone mould to set it in, then put it in the freezer and pop it, add a glaze and garnish"
            }
        },
        "i7yq1jw": {
            "body": "I always wondered if chefs cook for themselves/ their family at home. Also if you do, do you see it as a chore or something?",
            "comments": {
                "i7yrkiy": "Ahh yes we often do however definitely not the elaborate type stuff we do at work, at work we have pot washers whilst at home we don't. And honestly i rarely make any pastries at home as i literally do it all the time at work, unless it's something extremely simple like cookies"
            }
        },
        "i7y8i9q": {
            "body": "What defines pastry to you?",
            "comments": {
                "i7y8sek": "Well as a pastry chef It covers basically any sort of dessert related items so, chocolates, tarts, cakes, mousses, ice-creams, all the different sponges like genouise or jconde and a large variety of creams like Creme patisserie etc"
            }
        },
        "i7ylsv1": {
            "body": "Nope, working so much with desserts put me off them completely. And wben you're working 12 hours a day with no breaks there's not muxh time to eat, I'd normally snack on like toast and random kitchen scraps",
            "comments": {}
        }
    }
}