{
    "score": 326,
    "title": "I (19m) am gay and was raised muslim and live in the Middle East AMA",
    "selftext": "",
    "url": "https://www.reddit.com/r/AMA/comments/ulckay/i_19m_am_gay_and_was_raised_muslim_and_live_in/",
    "comments": {
        "i7ulu1u": {
            "body": "Is your family supportive? Do they even know?",
            "comments": {
                "i7ulyic": "No,they once threatened to kill me because they suspected I was gay",
                "i7waz7v": "Like seriously,  the guy is from a muslim family in the middle east.The real question is how does he keep it from everyone , since he's in real danger for his life."
            }
        },
        "i7ul5e1": {
            "body": "Ok two questions. Are you openly gay? Is being gay illegal in all the Middle East or in just specific parts? Also hope things are going okay.",
            "comments": {
                "i7ulby1": "No,and yes it's illegal in all the Middle East except Israel"
            }
        },
        "i7usayn": {
            "body": "Where do you think you will go to once you're 21? Do you have a country in mind?",
            "comments": {
                "i7usuwb": "I am half American so USA"
            }
        },
        "i7un7aw": {
            "body": "man thats crazy. Even the thought your writing about it here undercover. plans for the future???",
            "comments": {
                "i7unfc0": "Waiting till I turn 21 so I can leave(as I would be considered an adult in my country)"
            }
        },
        "i7utk4f": {
            "body": "Are you religious? If yes, how are you dealing with it?",
            "comments": {
                "i7uts9n": "I was when I used to hate being gay,but now I am not"
            }
        },
        "i7ur38d": {
            "body": "It's gotta be tough to always have to hide who you are man, I hope one day you'll be free to be yourself. What's the opinion on homosexuality among your peers ? Are other teens around you more accepting than the adults?",
            "comments": {
                "i7urcv6": "Thank you,the same as adults maybe more tolerant than adults as the majority think that you shouldn't kill a human being for being gay but they still see it as a sin"
            }
        },
        "i7uvvh5": {
            "body": "Do you think about leaving the Middle East often?",
            "comments": {
                "i7uyc0e": "Yes daily"
            }
        },
        "i7uz2do": {
            "body": "Is it safe for you to post this?",
            "comments": {
                "i7uzdjc": "Hopefully it is, it's just I never have true conversations with anyone in real life,so I need things like this"
            }
        },
        "i7uuy3x": {
            "body": "Good luck buddy! I wish you the best!",
            "comments": {
                "i7uvd2c": "Thank you"
            }
        },
        "i7un3g2": {
            "body": "do you know others in your situation?",
            "comments": {
                "i7un88w": "There are probably others,but no I know none"
            }
        },
        "i7uybmo": {
            "body": "Once you leave, do you think you'll have any relationship with your family?",
            "comments": {
                "i7uynon": "No it would be dangerous if I am outed to them and they know where I live"
            }
        },
        "i7vcfio": {
            "body": "I wish you the best future in the US! There is nothing wrong with being gay and is completely normal. Religion can be scary and brainwashing for sure! Will it be hard to get to the US once you turn 21? Does your parents know you are planning to go to the US. Was your mom raised Muslim in Florida also?",
            "comments": {
                "i7wbjws": "No as I told them I am going to go and stay with family members in Florida but I will leave once I get there and yes she was"
            }
        },
        "i7uz798": {
            "body": "And are you ashamed of being gay? I don't think you should be, I just know with how you were raised and the cultural climate you're in is way than less accepting of gay people. I'm very sorry for all you have to go through and I hope you can leave as soon as you turn 21",
            "comments": {
                "i7uzlpl": "I used to be but not anymore,I actually think it's a bless as it woke me up from giving my life away to the cult I am in, and thank you"
            }
        },
        "i7uyp4d": {
            "body": "Where do you want to live in the US? Are you studying anything ?",
            "comments": {
                "i7uywap": "Probably a liberal state,yes I am currently in my sophomore year"
            }
        },
        "i7vfc1r": {
            "body": "I just wanted to say that there's nothing wrong with loving others, gay or not.  I hope when you are able to free yourself from your country you come to America and get to live a long life with a full heart for the rest of your days! Bless you!",
            "comments": {}
        },
        "i7v19kn": {
            "body": "Have you thought about escaping to a different country?",
            "comments": {
                "i7v1i0y": "Yes but sadly I have to wait till I turn 21 to be considered an adult in my country"
            }
        },
        "i7vdgf3": {
            "body": "I hope you are able to leave when you can.  When I moved out of the town I grew up in to a progressive big city, it was the best feeling being able to be myself and be comfortable in my own skin.  Get there!  Peace and love.",
            "comments": {}
        },
        "i7w2z5l": {
            "body": "Can you see any hope that Islam can ever soften its stance on same-sex relationships? I'll be honest, I don't.",
            "comments": {
                "i7wc4s8": "Same I don't"
            }
        },
        "i7wmust": {
            "body": "This pan momma of a trans, pan 19 year old in the US has plenty of room in my heart to be family to you. I a surrogate mum to many, I'll be yours too. We can count down the time until you can leave together.",
            "comments": {}
        },
        "i7uy9lb": {
            "body": "Does Islam treat being homosexual (having attraction to the same sex) as a sin, or is it acting on it that's viewed as sinful? I know there are various strains of Islam and some are more rigid than others  like Wahabi, etc. I just don't know where different schools stand on this topic.",
            "comments": {
                "i7uyjvs": "The more liberal Islamic view is that acting on it is the sin, however the major view is that being gay is a sin"
            }
        },
        "i7wkcxn": {
            "body": "Do you think its possible to be muslim and believe in Islam while still being gay? Very curious because I live In India and I know few gay people who are practising Muslims.",
            "comments": {}
        },
        "i7w9naz": {
            "body": "Hey man, im from Syria, also an ex-muslim, im proud you are not ashamed of your self, but be careful who you tell around you. Got nothing to ask you, but if you need someone to talk to anonymously, feel free to hit me up.",
            "comments": {}
        },
        "i7uqmrd": {
            "body": "Have you tried bacon?",
            "comments": {
                "i7uqu8u": "No as my country prohibits selling bacon"
            }
        },
        "i7uswvc": {
            "body": "which country do you live in?",
            "comments": {
                "i7ut1lr": "I would rather not say"
            }
        }
    }
}