{
    "score": 813,
    "title": "I'm a British Queens Guard AMA",
    "selftext": "The guys with the funny hats and red jackets, been doing it for 4 years so have quite a bit of experience. AMA",
    "url": "https://www.reddit.com/r/AMA/comments/w2shq0/im_a_british_queens_guard_ama/",
    "comments": {
        "igsspwr": {
            "body": "When's the last time you laughed",
            "comments": {
                "igsvq3i": "What's laughing"
            }
        },
        "igs93vj": {
            "body": "How many geese could you, unarmed, take in a fight?",
            "comments": {
                "igsujtx": "I've fought one before and I am not confident"
            }
        },
        "igrwciz": {
            "body": "You guys remind me of some intimidating dark souls type enemy that just stays in one spot completely passive on the map but proceeds to absolutely whoop your ass if you cross boundaries. What are you looking out for exactly?",
            "comments": {
                "igrxsam": "Nothing usually, most of us people watch or try listen to strangers conversations to pass the time, you hear some interesting things"
            }
        },
        "igrylhw": {
            "body": "What happens if you gotta drop a deuce?How often do people fuck with you, on the job?Do you think a Monarchy is outdated and pointless?",
            "comments": {
                "igrz7c2": "You're only out there for 2 hours at a time so either hold it in or go before It can depend where you are but not that often unless you're on Tower of London I think the monarchy serves a role towards British culture and identity, and can bring in a lot of revenue especially on events like the queens birthday parade and the royal weddings. As for a modern role such as laws and that, definitely outdated. Depends how you look at it if you ask me"
            }
        },
        "igsxlg5": {
            "body": "What kind of tourists are the worst that you have seen or dealt with?Are there any historical places that are off-limit to the public that you get to see?",
            "comments": {
                "igsy2b3": "Tiktokers are the worst cause they tend to mimic us when we're just trying to get some blood flow in our legs which is probably the only real annoying thing Other than the guardrooms, nothing that everyone else can't see"
            }
        },
        "igs99k3": {
            "body": "Did the chap who drank water yesterday get a bollocking? Hope not.",
            "comments": {
                "igsu8b5": "Absolutely not, if you watch for long enough we usually have sneaky ways of getting water when it's hot"
            }
        },
        "igs5igc": {
            "body": "Under What circumstances are you allowed to interact with the public. I assume if someone fell down and had an episode you'd have to give medical attention. Or no?Edit: autocorrect correction.",
            "comments": {
                "igsu0xg": "In the orders it quotes I will not converse with anyone unless in the course of my duty so generally if someone's doing something they shouldn't be",
                "igu7q2p": "I fully expected this to be a joke thread where OP doesn't answer any questions and for once that'd still mean he delivered"
            }
        },
        "igtdjaj": {
            "body": "Is there a respectable way to take a picture near the Queens Guard with them in it, or should we just leave them be and let them do their job?",
            "comments": {
                "igteeri": "No feel free, most don't mind as long as you don't get touchy. The best thing you can do is after you've taken the picture is to tell him the time so he knows how long he's got left and he'll appreciate it"
            }
        },
        "igsa6i6": {
            "body": "Did you choose to be a queens guard? What is the application process like? E.g qualifications, recommendations. And except from parade stuff and standing still, what else do you do? Do you just go back to your Barack after the 2h shift ends (where the normal soldiers reside) or do you have a special housing only for queens quards?Edit: another one: is it an honor amongst  soldiers to do this job or is it just like any other position?",
            "comments": {
                "igsuyb0": "It's a military role which isn't necessarily seen as an honour but is seen as interesting to some. You don't need any qualifications unless you want to be an officer, and after your 2 hour shift you go chill out in the guard room on standby with the quick reaction force"
            }
        },
        "igs3blo": {
            "body": "What's the funniest thing you've heard while on duty",
            "comments": {
                "igsu6ig": "Hmm it's a hard one, but kids are usually pretty funny with how random they can be"
            }
        },
        "igt0sxq": {
            "body": "1. When they change shifts, the NCO in charge read some stuff to you. What is it?2. How do you endure being able to stand guard like that? Existential crisis? People watching?3. Behind your sentry box is a guard room is it where people move in or out and standing by? What do they do over there? Your regular infantry stuff? Joking, waiting, etc?4. If there's a dumb guy, tourist or else, that gets in the way and you mow them down, are you mostly annoyed or amused?5. A lance corporal on guard duty like that - is he going to be the NCO in charge or is he still going to be the guy doing guard duty standing there?6. What's the average age of a Foot Guard? Are they like the US (late teens - early to mid twenties) or somewhat older?7. What's the hour-to-hour daily routine be like? When do you usually wake up, how many shifts did you take per day, what do you do when you aren't standing on duty, etc ?8. Do you enjoy your job?",
            "comments": {
                "igtaglw": "That's the orders board, just making sure he knows what he's on People watching, trying to remember movies in your head The guardroom people usually just wait about, watch tv, standard break stuff but stay on a readiness to move if anything happens Doesn't usually happen, but when it does it's usually a drama with investigations, we aren't above the law The NCO will post the guardsmen out, but it'll be the lowest rank on guard. NCOs have different duties Yea all fighting age, late teens to mid twenties Usually wake up around 6-7, get food, have a shower, then take turns rotating through guard stags It has perks but like every job, there's drawbacks"
            }
        },
        "igt9f91": {
            "body": "How hostile are you demanded to be, when someone touches you or gets in the middle of your routines? I've seen videos where a guard shoves up a woman a couple of times, and that got me thinking if that dude just had a bad day, or if it's the regular procedure.",
            "comments": {
                "igtbve6": "You're not ordered to be aggressive, but when strangers start touching you and getting in the way of your job for the sake of a joke, then I think most people would be annoyed. Chances are she's been told to move a couple times already and keeps coming back"
            }
        },
        "igtckce": {
            "body": "Do children ever encounter you? If yes, what is your favourite encounter?",
            "comments": {
                "igtdq0t": "All the time, and it's got to be the kids that come dressed as guards and just tell you some absolute wild stories"
            }
        },
        "igts0bu": {
            "body": "Hello, thanks for this AMA.Is there anything nice a person can do for you? Can you accept small gifts? Other than the time, is there anything else you would like to hear from us? What's the best interaction you've had with an adult?Have a good day!",
            "comments": {
                "igtt155": "Honestly telling someone the time is the best thing even if we can't say we appreciate it, we can't accept any gifts or anything. Ask them if they can do a patrol or something and they'll most likely do it"
            }
        },
        "igtcf8y": {
            "body": "Do you think you'd be able to keep a straight face if Jimmy Carr was whispering in your ear?",
            "comments": {
                "igtd7ai": "I'm probably be questioning how I've ended up in a situation with jimmy carr whispering in my ear"
            }
        },
        "igrwd2f": {
            "body": "Hi, dutch military college student here. Why choose to basically do drill literally all day long?",
            "comments": {
                "igrwp1t": "It's not drill all day long for most, you do a stint in a ceremonial company then move onto a battalion where you will take turns doing the guards, while also rotating through operations and oversea exercises :)"
            }
        },
        "igs7889": {
            "body": "How much do you get paid?",
            "comments": {
                "igsurje": "Depends on rank, at the lowest it's pretty shit but you get housed in the barracks which is cheap so the disposable income can be good"
            }
        },
        "igs74v4": {
            "body": "How do you cope with the heat today?",
            "comments": {
                "igsucip": "I wasn't out today, but when I've been out when it's hot. Usually we're fine, but if it's bad enough they'll bring down the amount of time we're outside for and change more often"
            }
        },
        "igsgawl": {
            "body": "Bit of a stupid question, but have you ever actually met the queen?",
            "comments": {
                "igsvpcn": "I have but it's not a regular thing for most, she gave me a bottle of water"
            }
        },
        "igsn2cd": {
            "body": "Can women join?",
            "comments": {
                "igsvql2": "They can"
            }
        },
        "igtf0jt": {
            "body": "Sorry for the stupid question but are y'all really guards or just show? Secondly have anyone in your ranks ever went awol and left position for any reason?",
            "comments": {
                "igtgcrp": "Yes we're all operational, and serve a dual role. When not doing ceremony we deploy on operations around the world I've heard of it happening but it's very rare"
            }
        },
        "igsgp50": {
            "body": "How have u guys been keeping up with the heat?How annoying is it when random people come up to you?What's the most serious scenario you have/ someone you know has been involved with on the job?Orange juice with bits or no bits?",
            "comments": {
                "igsvjho": "Pretty good with the heat Not that annoying, most people just want a photo and leave. Most of us aren't even paying attention Most serious scenario was when someone rammed the gate to Windsor with their car when they were drunk and tried to drive up to the queens room With no bits, I'm human"
            }
        },
        "igtd9g5": {
            "body": "What was the funniest thing that made you laugh?What does the queen smell like?What was the most serious threat/situation you've been in?",
            "comments": {
                "igte5ot": "I've never laughed when on guard, but some have came close. Some of the children are really funny with how random they can be I have no idea but I do wonder Someone rammed the gate when they were drunk with their car"
            }
        },
        "igt7s3e": {
            "body": "If you encountered Paddington when it was raining would you invite him into your station undercover and share your tea or kick him out?",
            "comments": {
                "igtavsn": "Marmalade"
            }
        },
        "igtejky": {
            "body": "What do you guys think of Meghan and Harry, and Kate and William? What's the general sentiment towards either couple?",
            "comments": {
                "igtg15x": "Harry has my upmost respect, he wanted to serve in Afghanistan as a solider, and then later as a pilot and he did.But in total, the interactions I've had or heard about they're all very nice people and the drama isn't as bad as the media likes to make out"
            }
        },
        "igtkrxl": {
            "body": "What do people usually tell you when they wanna be funny and bother you? What is the most common joke?",
            "comments": {
                "igtn552": "People try to climb over the fences a lot if they want a reaction out of us, never works and usually gets them a word with the police The amount of people who have asked me is the queen home as a joke is unbelievable. Everyone seems to think it's hilarious to ask us and I have no idea why or another popular one is stand still if your gay"
            }
        },
        "igs53ta": {
            "body": "I understand there's a lot of ceremony and traditions, but why do you still have to wear that hat in the heat? Would the queen be less safe if you were dressed comfortably?",
            "comments": {
                "igsv532": "Fun fact, the guys in red aren't the ones doing the protecting it's more ceremonial. It's when your out of the red in the guard room with 10-11 other lads where you have your body armour, and kit ready to go if anything happens"
            }
        },
        "igswoxz": {
            "body": "What happens if a guard has to sneeze or cough? Does he get in trouble for breaking his stance?What happens if there's an emergency right in front of your post, like if someone has a heart attack or an epileptic seizure? Are you allowed to intervene/assist?",
            "comments": {
                "igsx8dw": "It sounds rude but as long as they don't move to cover their mouth or whatever, they'll be fine I've never heard of that happening, but we have radios in the box and we'd request assistance and then move to help or at the very least get someone  nearby that can help"
            }
        },
        "igs4vgu": {
            "body": "Always seemed boring,how's the pay?",
            "comments": {
                "igsumnq": "It depends on your rank, if you're a guardsmen it's pretty shit, but if you're a sergeant it can be pretty good"
            }
        },
        "igt430f": {
            "body": "how do the royal family treat you ?and if u can tell me how to do u get paid and do u get paid monthly or weekly ?",
            "comments": {
                "igtas5j": "The royal family are very nice, always got time for us whenever they are about. But it's not often that we meet them"
            }
        },
        "igtfqi7": {
            "body": "Do your feet kill? What about being so bored? Also how tf do you not smile or laugh at things",
            "comments": {
                "igtgmxh": "Feet hurting is bad, same with your kneesBeing bored is just part of the job really  Most people aren't that funny, and I don't know how it happens but everyone says the same jokes"
            }
        },
        "igsck62": {
            "body": "How the hell are you surviving out there in the heat waves?",
            "comments": {
                "igsug44": "It's not that bad, you work for a couple hours then usually have about 4-6 hours resting"
            }
        },
        "igs9345": {
            "body": "Is this something you get stuck with out of basic training or something you have to ask for?I was in the US Marine Corps, never been to England, and know next to nothing about your military besides drinking with the British Royal Marines stateside lol.",
            "comments": {
                "igsvb54": "You apply for the regiment when you're first wanting to join, other regiments will get an honourable posting to do the guards for a week or so every now and then"
            }
        },
        "igsn5is": {
            "body": "Has there been any recent talks of female gaurds in the household divisions? I seem to remember there was a few during the 2020 Trooping the colour.",
            "comments": {
                "igsvmgj": "There are actually a couple already in, if they can meet the standard then they can do the job in my eyes"
            }
        },
        "igsy7pb": {
            "body": "Do you have duties besides standing in place at certain locations?",
            "comments": {
                "igt9jcf": "Yea, all household regiments have their ceremonial roles and operational roles. Many of us have deployed to Afghanistan, Iraq, Mali and the lot"
            }
        },
        "igtqqoa": {
            "body": "Do other countries help guard the palace from time to time?",
            "comments": {
                "igtrdd7": "Yea, I was working with the Canadians not too long ago"
            }
        },
        "iguznoz": {
            "body": "Do you notice pretty girls ? When I visited in 2019, one of the guard was sooo gorgeous, and deep down I hoped he noticed me (even if he couldn't react lol).",
            "comments": {
                "igvus3t": "Most likely did notice, a lot of us people watch to pass the time"
            }
        },
        "igsz16p": {
            "body": "Is it true you keep one round in your rifle?  Follow up question, but when someone does act out of line in a way that would call for you to react ,is it anything like the American Tomb of the Unknown soldier guards, where they chamber a round (not sure if they actually have ammunition in their rifles) and try to intimidate the rowdy folks into backing down?",
            "comments": {
                "igt9fi3": "No, we don't carry any ammunition, there's people in the guard room that are ready to react if anything happens. We do shout at people if they start climbing over the fence or whatever"
            }
        },
        "igt27qf": {
            "body": "Have the tourists gotten worse over the years in terms of disrespecting/annoying you?",
            "comments": {
                "igtajzt": "Not really, you do learn to ignore it"
            }
        },
        "igt8m6p": {
            "body": "Have you met the ravens at the Tower of London?",
            "comments": {
                "igtbfo3": "Yea and there's a good joke we play on the new lads that involve the ravens"
            }
        },
        "igtj7qm": {
            "body": "What are the barracks like? When I visited London and went to the Tower, I was told some of the Queen's Guard lives there. Are they incredibly old and outdated, or have they been kept nice over the years? Also, any spooky ghost legends you have heard while working there?",
            "comments": {
                "igtjx64": "The barracks that we stay in as a regiment are okay, not the best but not the worst, the guardrooms are pretty good considering the space they have to work with. They've been kept up to date as best they can It can be quite eerie at night in the Tower of London when walking around, and the tower falls completely silent when the Last Post is played is played at the keys ceremony. Strange coincidence or spooky?EDIT: Not the worst*"
            }
        },
        "igu05gr": {
            "body": "Late to the party but hoping i get an answer.What's the difference/ significance of the different uniforms of the queens guard? Most people are familiar with the big fuzzy hat, but I've also seen videos of different uniforms. One for example was the classic red coat, a helmet/ cap, black boots up to the thighs, and carrying a saber and what looked like a rifle, albiet a ceremonial looking one. Is it updates to the uniform, seasonal dress, or different posts having different uniforms? Genuinely curious.",
            "comments": {
                "igu4f5j": "Different regiments have different uniforms, either small differences or quite large. Take the Coldstream guards and the grenadier guards, the Coldstream guards have their buttons in twos, a red plume on the right side, whereas the grenadiers have singular buttons and a white plume on the left. Subtle differences between guard regiments The regiment your referring to with the white helmets and red tunics, I'm guessing is the Canadians, and honestly couldn't tell you much about them other than I think they look good"
            }
        },
        "igu2wvo": {
            "body": "Hypothetically speaking because I don't want feds at my door or to be on some fucking list. Here in America, we had some dude jump the fence to the Whitehouse, run up to the door and run around for more than a few minutes before being apprehended. My question is, likely/unlikely would it be for someone to make it into the palace from off the street? Would they be shot immediately?",
            "comments": {
                "igu4vge": "On top of the ceremonial guards, there's armed police outside the front as well. Then there's a guard room with the off duty guards who are on a short notice to move, then there's also the off duty police who are stationed there who are also on a short notice to move You'd probably have around 20-30 armed men on-top of you before you got half way across the courtyard"
            }
        },
        "igugia5": {
            "body": "Do you hate Americans more than any other nationality?  And why?  Is it because we're so noisy?",
            "comments": {
                "igvt8b5": "No actually, Americans are surprisingly the most respectful when it comes to tourists. You guys love your military and it seems to follow when you come over here"
            }
        },
        "igsj74n": {
            "body": "how do you feel about people trying to make the queens guards laugh",
            "comments": {
                "igsvwb6": "Most aren't funny, but most of us don't mind"
            }
        },
        "igslehp": {
            "body": "Are queens guards considered a more elite division in the military, like rangers or green beret?",
            "comments": {
                "igsvtvn": "Not special forces, but are known for our discipline"
            }
        },
        "igut675": {
            "body": "Seems like people keep asking about how you avoid laughing. What about the other direction though? Like if you're having a terrible day, standing still being completely alone with your thoughts for two hours must be hard. Sure there's stuff happening around you but that's only limited distraction I'd imagine",
            "comments": {}
        },
        "igtomld": {
            "body": "Is She a reptilian?",
            "comments": {
                "igtr15s": "Classified information"
            }
        },
        "igsabwz": {
            "body": "Is a British Queens Guard the same thing as a Beefeater?",
            "comments": {
                "igsw32z": "No, so the beefeaters are veterans that were warrant officers (I believe) and have the long service good conduct medal, whereas we're infantry and join directly from being a civilian"
            }
        },
        "igt6skp": {
            "body": "How is it to serve the Queen?",
            "comments": {
                "igtath0": "Living the dream serving the queen"
            }
        },
        "igthl6m": {
            "body": "Idk if you're still answering questions,  or if this has already been answered, but can women/non men be Queens Guards? Also, how do you get into the Queens Guard?",
            "comments": {
                "igtigx4": "Absolutely anyone can be a guard if you meet the standard (and be either British or Commonwealth) You simply apply on the British Army website or in your nearest careers office"
            }
        },
        "igten2u": {
            "body": "Have you ever straight up stomped a motherfucker into the ground, and then shouted SIT WHEN YOU PEE MOTHERFUCKER!!!?",
            "comments": {
                "igtg4s1": "No but it's on the bucket list now"
            }
        },
        "igtrnxi": {
            "body": "What rules did you secretly broke while working",
            "comments": {
                "igtt9u8": "too many to list"
            }
        },
        "igu997a": {
            "body": "behind the scenes are the other guards actually funny and cool people?",
            "comments": {
                "igu9n26": "We're mostly late teens to mid twenties, we're no different to anyone else once we're out of uniform"
            }
        }
    }
}