{
    "score": 1120,
    "title": "I was kidnapped as a little girl and survived. AMA",
    "selftext": "At 7 years old I was kidnapped by my mothers drug dealer. He knew I was starving and asked if I wanted to get groceries with him. I knew we were not going back at some point. I remember him getting gas and thinking I could run to the pay phone and call 911. Except I knew he would catch me. He pornographed me and tried to sell me on several occasions. At one point, a female noticed me traveling with a much older male and reported me to the police. My own mother had yet to report me missing. Days had gone by at this point. He knew she was reporting him and he fled. I remember thinking I was going to die. He drugged me and the next thing I remember was waking up naked to firemen wrapping me in aluminum blankets to cover my naked body. I was later told that I was payment for a drug debt my mother owed. I have no idea what happened to my kidnapper. I do know he hurt other kids because he told me about them. I know the statistics of me surviving this are extremely rare. I've never met a kidnapping survivor. I'm thankful every day to be alive.",
    "url": "https://www.reddit.com/r/AMA/comments/upc1bw/i_was_kidnapped_as_a_little_girl_and_survived_ama/",
    "comments": {
        "i8k1edm": {
            "body": "How has this affected your relationship with your mom? Has it affected your everyday life now? I'm sure it has to some extent, I can't imagine that just goes away.. although I know a lot of my trauma's details are kind of blocked from memory which I think helps cope. Is this the case for you? I'm so sorry you had to go through that though, OP. Hugs",
            "comments": {
                "i8k2h37": "My biological mother lost custody of all of her children after this happened. I was eventually adopted with one of my siblings. I was in court ordered therapy right away and was fortunate to have a very good adopted mother. I have flashbacks to my trauma daily over the most innocuous things. I have had to work hard to desensitize myself from my own flashbacks. I go to therapy once, sometimes twice a week. I work hard at conquering whatever I have in front of me. I try to pay it forward by sharing bits of wisdom I've learned. I live my life with the knowledge that I have the power to control how things impact me and that no matter what, I've stared evil in the face and won. I am usually hyper vigilant and I have a hard time relaxing. I'm also really really funny and an AMAZING poker player. And I love my kids and my family and my garden. Oh, and food! I love to cook and feed everyone. And children? I love all of the children. They call me the protector mom The little things really"
            }
        },
        "i8l25cf": {
            "body": "Are you worried you'll see your kidnapper ever again? And how does this affect the way you parent your kiddos? Thanks for sharing your experience. I'm glad you survived.",
            "comments": {
                "i8l5zjs": "He's dead now but when I was younger I would see his face in any stranger that looked remotely like him. I definitely was afraid of that for a long time. Now I worry about my own children."
            }
        },
        "i8kq1f7": {
            "body": "You mentioned in another comment that you have kids. Will you tell us about them? What do you love most about your life now?Thank you for doing an AMA and sharing your experiences. <3",
            "comments": {
                "i8l8hxg": "My babies are my LIFE. Kids are my passion. I pride myself on what a good (slightly paranoid) mother I am. They humble me. No matter how much you want to be a great parent, you always make mistakes. I have 4, 2 of my own and 2 bonus kids. They are ages 7, 8, 11, 15. I probably spoil my kids a little too much. They want for nothing and I cook them food excessively. They tell me often I smother them a little bit LOL Before I was kidnapped, I was abused and neglected. But even then I had a nurturing spirit. I would plant birdseed I found just to watch it grow. I love life. I also believe that the way we ALL combat this evil is by loving our people at home. Broken homes cause so much hurt in little people's hearts. And I know that hurt people hurt people."
            }
        },
        "i8lkz6c": {
            "body": "Do you have any contact with your biological mom?Also, reading the comments ,I must say that I absolutely love your spirit.",
            "comments": {
                "i8m0qqo": "Thank you! I allow both biological parents to observe my social media. They have no contact with my children and my children will never be in proximity of them. I have met with both as an adult multiple times with questions. Mostly HOW THE FUCK COULD YOU DO THIS. As a mother and a human I find it incredibly disturbing to think about how my own mother was with me. Neither had an answer but in their lack of answer I learned a lot. They were 2 people who had major deficiencies of their own who came together to seek love and out of their own injuries, recreated their abuse. They were both major drug addicts and that has deteriorated their minds and in turn, their character. They had no chance really. I have taken the time to forgive them both in person. I wish they would stop harming themselves and stop contributing to evil. I wish their pain would stop. And in them, I see many many many people in this world."
            }
        },
        "i8k36z8": {
            "body": "Well i don't have much to say other then, you should have a lovely and happy life, and take my free reward",
            "comments": {
                "i8l74wu": "It is always my goal to live a well lived life. It's how I take my power back"
            }
        },
        "i8l12jt": {
            "body": "How long ago was this?",
            "comments": {
                "i8l9ab7": "I was 7 then and I am 33 now. 1995 I believe. I posted a newspaper article I have about it on my profile. This is the only official document I have. I would love to get the entire case record. I have no idea what happened to him or the conclusion of the case."
            }
        },
        "i8lg58j": {
            "body": "Wow I can tell you have an infectious spirit! I am proud of you after all you have gone through to build a life that you love. I don't know how to word this correctly  there is a lot of trauma in the foster system. I want to adopt but I am terrified because I know people who have adopted and it ended up horrible for them due to the children they adopted having horrible trauma. What are your thoughts on this?",
            "comments": {}
        },
        "i8k8dkl": {
            "body": "Were you aware of how bad this was at the time?",
            "comments": {
                "i8l8upq": "Yes and no. My instincts told me when he took me that I was very much in danger. He drugged me with Benadryl and I remember knowing that was dangerous. My survival adaption is friending and feigning. I just did what I was told and pretended it was safe for me. Inside I was terrified. I have distinct memories of knowing he would kill me. As far as the sexual abuse and the fear in general, no- I didn't think that was wrong. My life was so scary that this seemed like I just chose to open the wrong door. I didn't understand for a LONG time the whole picture of what had happened to me. It took a long time for my story to be something I felt as MY story."
            }
        },
        "i8lo7tw": {
            "body": "Did you tell your children, or maybe only the 15 year old, about it? Are you planning on doing it?",
            "comments": {
                "i8lrnpa": "I have very real conversations with my children about the presence of evil in the world. I tell them that people exist that want to hurt kids so it is important to be aware for yourself and for other kids. I definitely have every single one of them gps tagged. Apple air tags  in their shoe soles. They think I'm kinda crazy but I refuse to ever put my children in harm or not be able to find them. That is a fear. My oldest knows the most probably but even that is vague. I usually make jokes about my early childhood and stealing my food. I have told them all how important they are to me and how much I wanted to be a mother. I try to mostly create relationships to gain their trust. And therefore continue to be an influential person in their life for as long as possible. But no, they really have no idea who I am"
            }
        },
        "i8mh6bp": {
            "body": "I hate to asks, but I notice a line where your kidnapper had told you, he done harm to other kids. Like was he just casually telling you about it while he driving around?I feel like it's a dumb questions cuz predator will say just anything to install fear. And what kind of human tells a 7 years old?I admire your strength from reading the comments, I can't imagine the pain.I also have another questions but it's more asking for advice/experience: I may have been molested between the age of 3 to 6 years old and I 'woke up' at 7 because it felt safe to do so from my understanding of the memories. I can remember memories really well before and after that time but between those years it's replace with nightmares of the same 'demon' with heavy insinuation that he doing something bad.I tried to press for clarity, and remember the surrounding of who was around me and it basically pointed close to family friend at the time. Because of who he is as a person and vaguely remember a rumor.My question is did trauma tried to block some of your memories? If it did, what was the step to unravel it? I feel like I NEED to know what happen and I also get the feeling somebody knows about it and ain't telling as my family has a history of not dealing with the problem or it outcome head on.",
            "comments": {
                "i8n6qey": "This man had access to me prior to my abduction and was grooming me. Part of his grooming process was to normalize the sexualization of me. He really wanted my brother and I to perform for him together and separately we were shown and told about another brother and sister that he had done this to. I remember seeing photos of them and being instructed to behave in that manner. Sorry to tell you that. I'm sure disturbing. With regards to your abuse- memory is linked to emotion. I would hypothesize that you disassociated from the experience. Meaning your body could not escape but your mind could. You likely learned to shut everything off and disconnect and you may even find that you still do this to cope with overwhelming situations or to self soothe. I could understand wanting to know WHO it was. A part of you knows something was robbed from you. Another part of you wants it back. I totally understand this. I have sought out knowledge to create a whole picture because KNOWLEDGE is a form of regulation. Meaning knowing things calms me down. I would leave you with this- the mind prevents us from knowing what we are not capable of processing. Our subconscious is the power in our mind and it knows our limits. I have personally experienced memory recall with the assistance of magic mushrooms. I was able to go all the way back to before I could speak. We remember our emotions. They are stored inside of our body's and we can recall them. We just have to be ready for the pain. Until we are, we will try to bandage it. Numb it out. I'm really sorry this happened to you and it is very very common. Sit with your imagery and finish it in a way that you are the victor. I had a recurring nightmare where I was frozen and unable to pull the trigger on a gun. Powerless once again. I was protecting my child in my dream, but every time I froze. I spent hours recalling that image and pulling the damn trigger. In my mind I blew off so many bad guys heads. Why? Because we believe what we tell ourselves. What is most important is that you can go inward and comfort that little person in you who was terrified. Give them the love you deserved then. You've got this! Thanks for being brave and sharing "
            }
        },
        "i8ksp1g": {
            "body": "You playing 7 2 off suit?",
            "comments": {
                "i8la574": "Always! Actually poker is a hobby for me. I read people like books LOL"
            }
        },
        "i8m4wul": {
            "body": "I just wanted to say thank you for sharing your story and I'm sorry this happened to you and that you're an amazing example of resilience!",
            "comments": {}
        },
        "i8khh81": {
            "body": "What did he get you to eat?",
            "comments": {
                "i8l90ay": "Well, we didn't go to the grocery store. The first stop was a Payless because I was not wearing shoes and he knew someone would notice that. We stayed in off season cabins and broke into them. I ate a lot of canned things and I also just didn't eat. Not an uncommon thing for me."
            }
        },
        "i8lew8l": {
            "body": "I was also kidnapped by my dad when i was in elementary school and the police did nothing about it because it was a civil issue (bruh) i'm happy to see you're doing well OP, im glad you're alive and well and have amazing kiddos.",
            "comments": {}
        },
        "i8lgcm1": {
            "body": "I don't mean to minimize your trauma, and I'm sorry you went through what you did. But I'm curious as to how you feel about the current atmosphere of male caretakers being questioned and presumed in a negative light, by default?To clarify, I come from a place where I hear about fathers having police called on them for taking care of their daughters, of men being pushed away from childcare roles, etc. As an uncle without children, myself, it's always a fear for me when I take care of my nephews.I guess what I'm asking is, what's the best way to step in on a situation like you had, versus intruding on a male caretaker's right to simply care for children (in your opinion and perspective)? Like, there has to be a line between assuming every male caretaker is a predator and stepping up against child abuse. How would you draw that line, with your unique experience? And again, I'm genuinely sorry for your trauma. I'm not trying to be callous or hurtful by my dialogue, it's just the most relevant thing that came to mind.",
            "comments": {
                "i8lq08x": "I absolutely LOVE this question and I am very glad you brought it up. Essentially what you are asking is how do we protect without being paranoid towards men. My answer would be long but also short. Education and Awareness - When we hyper focus on male predators we miss the females. When we fixate on men, we push the male care takers away who are there for the right reasons. When we assume that gender either makes us guilty or innocent of a potential crime, we miss the entire picture. In my experience there are 3 types of people who do this type of thing. Those that had it done to them. Those that have a true sickness that attracts them to children and then the last which is the most heinous- those that understand the demand for this type of commodity if you would and without any desire of their own, they use this to profit or create power for themselves. The real psychopaths. I say all of this to say- anyone could be a predator of children. What's more important is to not be afraid of being falsely accused and instead be aware of who could be hurting kids you love in your life. Teach them important signs of grooming- teach them that adults who tell you to keep secrets are hurting you. Tell them the reality that exists and empower them to protect themselves. Listen to the little things in their life. By all means HAVE THE BEST RELATIONSHIP you can with your nephews- because if something happens in THEIR life, they will have YOU to turn to."
            }
        }
    }
}